{'arxiv_id': 'arXiv:2503.20754', 'title': 'Flying Vines: Design, Modeling, and Control of a Soft Aerial Robotic Arm', 'authors': 'Rianna Jitosho, Crystal E. Winston, Shengan Yang, Jinxin Li, Maxwell Ahlquist, Nicholas John Woehrle, C. Karen Liu, Allison M. Okamura', 'link': 'https://arxiv.org/abs/2503.20754', 'abstract': 'Aerial robotic arms aim to enable inspection and environment interaction in otherwise hard-to-reach areas from the air. However, many aerial manipulators feature bulky or heavy robot manipulators mounted to large, high-payload aerial vehicles. Instead, we propose an aerial robotic arm with low mass and a small stowed configuration called a "flying vine". The flying vine consists of a small, maneuverable quadrotor equipped with a soft, growing, inflated beam as the arm. This soft robot arm is underactuated, and positioning of the end effector is achieved by controlling the coupled quadrotor-vine dynamics. In this work, we present the flying vine design and a modeling and control framework for tracking desired end effector trajectories. The dynamic model leverages data-driven modeling methods and introduces bilinear interpolation to account for time-varying dynamic parameters. We use trajectory optimization to plan quadrotor controls that produce desired end effector motions. Experimental results on a physical prototype demonstrate that our framework enables the flying vine to perform high-speed end effector tracking, laying a foundation for performing dynamic maneuvers with soft aerial manipulators.', 'abstract_zh': '基于飞行攀援臂的低质量空中机械臂设计及其控制框架研究', 'title_zh': '飞藤：软 aerial 机器人手臂的设计、建模与控制'}
{'arxiv_id': 'arXiv:2503.20723', 'title': 'Multi-Robot Coordination Under Physical Limitations', 'authors': 'Tohid Kargar Tasooji, Sakineh Khodadadi', 'link': 'https://arxiv.org/abs/2503.20723', 'abstract': 'Multi-robot coordination is fundamental to various applications, including autonomous exploration, search and rescue, and cooperative transportation. This paper presents an optimal consensus framework for multi-robot systems (MRSs) that ensures efficient rendezvous while minimizing energy consumption and addressing actuator constraints. A critical challenge in real-world deployments is actuator limitations, particularly wheel velocity saturation, which can significantly degrade control performance. To address this issue, we incorporate Pontryagin Minimum Principle (PMP) into the control design, facilitating constrained optimization while ensuring system stability and feasibility. The resulting optimal control policy effectively balances coordination efficiency and energy consumption, even in the presence of actuation constraints. The proposed framework is validated through extensive numerical simulations and real-world experiments conducted using a team of Robotarium mobile robots. The experimental results confirm that our control strategies achieve reliable and efficient coordinated rendezvous while addressing real-world challenges such as communication delays, sensor noise, and packet loss.', 'abstract_zh': '多机器人协调是多种应用的基础，包括自主探索、搜索与救援以及协同运输。本文提出了一种多机器人系统的最优共识框架，该框架确保高效会遇的同时最小化能量消耗并解决执行器约束问题。实际部署中的一个关键挑战是执行器限制，尤其是轮速饱和，这可能会显著降低控制性能。为解决这一问题，将庞特里亚金最小原理（PMP）纳入控制设计中，以实现约束优化并确保系统稳定性和可行性。所提出的最优控制策略即使在存在执行器约束的情况下也能有效地平衡协调效率和能量消耗。所提出框架通过使用Robotarium移动机器人的广泛数值仿真和真实世界实验进行验证。实验结果证实，我们的控制策略能够在通信延迟、传感器噪声和数据包丢失等实际问题面前实现可靠且高效的协同会遇。', 'title_zh': '物理限制下的多机器人协调'}
{'arxiv_id': 'arXiv:2503.20714', 'title': 'Beyond Visuals: Investigating Force Feedback in Extended Reality for Robot Data Collection', 'authors': 'Xueyin Li, Xinkai Jiang, Philipp Dahlinger, Gerhard Neumann, Rudolf Lioutikov', 'link': 'https://arxiv.org/abs/2503.20714', 'abstract': 'This work explores how force feedback affects various aspects of robot data collection within the Extended Reality (XR) setting. Force feedback has been proved to enhance the user experience in Extended Reality (XR) by providing contact-rich information. However, its impact on robot data collection has not received much attention in the robotics community. This paper addresses this shortcoming by conducting an extensive user study on the effects of force feedback during data collection in XR. We extended two XR-based robot control interfaces, Kinesthetic Teaching and Motion Controllers, with haptic feedback features. The user study is conducted using manipulation tasks ranging from simple pick-place to complex peg assemble, requiring precise operations. The evaluations show that force feedback enhances task performance and user experience, particularly in tasks requiring high-precision manipulation. These improvements vary depending on the robot control interface and task complexity. This paper provides new insights into how different factors influence the impact of force feedback.', 'abstract_zh': '本研究探讨了力反馈如何影响扩展现实（XR）环境中机器人数据收集的各个方面。力反馈已被证明可以通过提供丰富的接触信息来增强扩展现实（XR）中的用户体验。然而，力反馈对其它机器人数据收集的影响在机器人社区中尚未得到过多关注。本文通过在XR数据采集过程中进行广泛用户研究，来解决这一缺陷。我们扩展了两种基于XR的机器人控制接口——亲身体验教学和运动控制器——以包含触觉反馈功能。用户研究使用从简单拾放任务到复杂棋子组装任务的操作任务，这些任务要求高度精确的操作。评估结果表明，力反馈可以提高任务性能和用户体验，尤其是在需要高精度操作的任务中。这些改进因所使用的机器人控制接口和任务复杂度而异。本文提供了关于不同因素如何影响力反馈效果的新见解。', 'title_zh': '超越视觉：探究扩展现实中的力反馈在机器人数据收集中的应用'}
{'arxiv_id': 'arXiv:2503.20693', 'title': 'Toward Dynamic Control of Tendon-Driven Continuum Robots using Clarke Transform', 'authors': 'Christian Muhmann, Reinhard M. Grassmann, Max Bartholdt, Jessica Burgner-Kahrs', 'link': 'https://arxiv.org/abs/2503.20693', 'abstract': 'In this paper, we propose a dynamic model and control framework for tendon-driven continuum robots with multiple segments and an arbitrary number of tendons per segment. Our approach leverages the Clarke transform, the Euler-Lagrange formalism, and the piecewise constant curvature assumption to formulate a dynamic model on a two-dimensional manifold embedded in the joint space that inherently satisfies tendon constraints. We present linear controllers that operate directly on this manifold, along with practical methods for preventing negative tendon forces without compromising control fidelity. We validate these approaches in simulation and on a physical prototype with one segment and five tendons, demonstrating accurate dynamic behavior and robust trajectory tracking under real-time conditions.', 'abstract_zh': '本文提出了一种用于多段连续驱动机器人（每段具有任意数量肌腱）的动力学模型和控制框架。该方法采用克拉克变换、欧拉-拉格朗日形式主义和分段恒定曲率假设，在关节空间中嵌入的二维流形上构建动力学模型，该模型固有地满足肌腱约束条件。我们提出了直接在该流形上操作的线性控制器，并介绍了防止负肌腱力的方法，同时不牺牲控制精度。我们在仿真和一个段五肌腱的物理原型上验证了这些方法，在实时条件下实现了准确的动力学行为和稳健的轨迹跟踪。', 'title_zh': '基于克拉克变换的动态控制腱驱动连续机器人研究'}
{'arxiv_id': 'arXiv:2503.20521', 'title': 'Decremental Dynamics Planning for Robot Navigation', 'authors': 'Yuanjie Lu, Tong Xu, Linji Wang, Nick Hawes, Xuesu Xiao', 'link': 'https://arxiv.org/abs/2503.20521', 'abstract': "Most, if not all, robot navigation systems employ a decomposed planning framework that includes global and local planning. To trade-off onboard computation and plan quality, current systems have to limit all robot dynamics considerations only within the local planner, while leveraging an extremely simplified robot representation (e.g., a point-mass holonomic model without dynamics) in the global level. However, such an artificial decomposition based on either full or zero consideration of robot dynamics can lead to gaps between the two levels, e.g., a global path based on a holonomic point-mass model may not be realizable by a non-holonomic robot, especially in highly constrained obstacle environments. Motivated by such a limitation, we propose a novel paradigm, Decremental Dynamics Planning that integrates dynamic constraints into the entire planning process, with a focus on high-fidelity dynamics modeling at the beginning and a gradual fidelity reduction as the planning progresses. To validate the effectiveness of this paradigm, we augment three different planners with DDP and show overall improved planning performance. We also develop a new DDP-based navigation system, which achieves first place in the simulation phase of the 2025 BARN Challenge. Both simulated and physical experiments validate DDP's hypothesized benefits.", 'abstract_zh': '递减动力学Planning：整合动力学约束的整个规划过程', 'title_zh': '机器人导航中的递减动力学规划'}
{'arxiv_id': 'arXiv:2503.20280', 'title': 'Turning Circle-based Control Barrier Function for Efficient Collision Avoidance of Nonholonomic Vehicles', 'authors': 'Changyu Lee, Kiyong Park, Jinwhan Kim', 'link': 'https://arxiv.org/abs/2503.20280', 'abstract': "This paper presents a new control barrier function (CBF) designed to improve the efficiency of collision avoidance for nonholonomic vehicles. Traditional CBFs typically rely on the shortest Euclidean distance to obstacles, overlooking the limited heading change ability of nonholonomic vehicles. This often leads to abrupt maneuvers and excessive speed reductions, which is not desirable and reduces the efficiency of collision avoidance. Our approach addresses these limitations by incorporating the distance to the turning circle, considering the vehicle's limited maneuverability imposed by its nonholonomic constraints. The proposed CBF is integrated with model predictive control (MPC) to generate more efficient trajectories compared to existing methods that rely solely on Euclidean distance-based CBFs. The effectiveness of the proposed method is validated through numerical simulations on unicycle vehicles and experiments with underactuated surface vehicles.", 'abstract_zh': '本文提出了一种新的控制障碍函数（CBF），旨在提高非完整车辆碰撞避免的效率。传统的CBF通常依赖于最短欧几里得距离来避开障碍，忽略了非完整车辆的有限转向能力。这常常导致突发性的操作和过度的减速，这不符合期望，降低了碰撞避免的效率。我们的方法通过结合转向圈距离和考虑非完整约束对车辆的有限操控性，解决了这些问题。所提出的CBF与模型预测控制（MPC）结合，生成了比仅依赖欧几里得距离CBF的方法更高效的轨迹。通过统一车辆的数值仿真和欠驱动水面车辆的实验，验证了所提出方法的有效性。', 'title_zh': '基于转弯圆的控制障碍函数用于非holonomic车辆的高效避碰'}
{'arxiv_id': 'arXiv:2503.20237', 'title': 'A Virtual Fencing Framework for Safe and Efficient Collaborative Robotics', 'authors': 'Vineela Reddy Pippera Badguna, Aliasghar Arab, Durga Avinash Kodavalla', 'link': 'https://arxiv.org/abs/2503.20237', 'abstract': 'Collaborative robots (cobots) increasingly operate alongside humans, demanding robust real-time safeguarding. Current safety standards (e.g., ISO 10218, ANSI/RIA 15.06, ISO/TS 15066) require risk assessments but offer limited guidance for real-time responses. We propose a virtual fencing approach that detects and predicts human motion, ensuring safe cobot operation. Safety and performance tradeoffs are modeled as an optimization problem and solved via sequential quadratic programming. Experimental validation shows that our method minimizes operational pauses while maintaining safety, providing a modular solution for human-robot collaboration.', 'abstract_zh': '协作机器人（cobot）越来越多地与人类并肩工作，要求具备 robust 的实时保护能力。当前的安全标准（如 ISO 10218、ANSI/RIA 15.06、ISO/TS 15066）要求进行风险评估，但对实时响应提供的指导有限。我们提出了一种虚拟围栏方法，用于检测和预测人类运动，以确保协作机器人的安全运行。安全性和性能之间的权衡被建模为一个优化问题，并通过逐步二次规划进行求解。实验验证表明，该方法在保证安全的同时最小化了操作暂停时间，提供了一种模块化的人机协作解决方案。', 'title_zh': '虚拟围栏框架实现安全高效协作机器人系统'}
