{'arxiv_id': 'arXiv:2502.12152', 'title': 'Learning Getting-Up Policies for Real-World Humanoid Robots', 'authors': 'Xialin He, Runpei Dong, Zixuan Chen, Saurabh Gupta', 'link': 'https://arxiv.org/abs/2502.12152', 'abstract': 'Automatic fall recovery is a crucial prerequisite before humanoid robots can be reliably deployed. Hand-designing controllers for getting up is difficult because of the varied configurations a humanoid can end up in after a fall and the challenging terrains humanoid robots are expected to operate on. This paper develops a learning framework to produce controllers that enable humanoid robots to get up from varying configurations on varying terrains. Unlike previous successful applications of humanoid locomotion learning, the getting-up task involves complex contact patterns, which necessitates accurately modeling the collision geometry and sparser rewards. We address these challenges through a two-phase approach that follows a curriculum. The first stage focuses on discovering a good getting-up trajectory under minimal constraints on smoothness or speed / torque limits. The second stage then refines the discovered motions into deployable (i.e. smooth and slow) motions that are robust to variations in initial configuration and terrains. We find these innovations enable a real-world G1 humanoid robot to get up from two main situations that we considered: a) lying face up and b) lying face down, both tested on flat, deformable, slippery surfaces and slopes (e.g., sloppy grass and snowfield). To the best of our knowledge, this is the first successful demonstration of learned getting-up policies for human-sized humanoid robots in the real world. Project page: this https URL', 'abstract_zh': '自动摔倒恢复是 humanoid 机器人可靠部署的关键前提。设计用于站立的控制器因人形机器人摔倒后可能处于多种配置以及其预期在复杂地形上操作而具有挑战性。本文开发了一种学习框架，以生成使人在形机器人能够在多种配置和地形上自主站立的控制器。与以往成功的类人行走学习应用不同，站立任务涉及复杂的接触模式，因此需要准确地建模碰撞几何形状和稀疏的奖励。我们通过遵循课程的两阶段方法解决了这些挑战。第一阶段专注于在最小平滑度或速度/力矩限制约束下发现良好的站立轨迹。第二阶段则将发现的运动细化为可部署（即平滑且缓慢）且能够应对初始配置和地形变化的运动。我们发现这些创新使现实世界中的 G1 人形机器人能够在我们考虑的两种主要情况下站立：a) 仰卧；b) 俯卧，两种情况均在平坦、可变形、滑腻的表面以及斜坡（如泥泞的草地和雪地）上进行测试。据我们所知，这是首次在现实世界中成功演示用于人体大小人形机器人的学习站立策略。项目页面：this https URL', 'title_zh': '实时 humanoid 机器人起床策略的学习'}
{'arxiv_id': 'arXiv:2502.12019', 'title': 'Robotic CBCT Meets Robotic Ultrasound', 'authors': 'Feng Li, Yuan Bi, Dianye Huang, Zhongliang Jiang, Nassir Navab', 'link': 'https://arxiv.org/abs/2502.12019', 'abstract': 'The multi-modality imaging system offers optimal fused images for safe and precise interventions in modern clinical practices, such as computed tomography - ultrasound (CT-US) guidance for needle insertion. However, the limited dexterity and mobility of current imaging devices hinder their integration into standardized workflows and the advancement toward fully autonomous intervention systems. In this paper, we present a novel clinical setup where robotic cone beam computed tomography (CBCT) and robotic US are pre-calibrated and dynamically co-registered, enabling new clinical applications. This setup allows registration-free rigid registration, facilitating multi-modal guided procedures in the absence of tissue deformation. First, a one-time pre-calibration is performed between the systems. To ensure a safe insertion path by highlighting critical vasculature on the 3D CBCT, SAM2 segments vessels from B-mode images, using the Doppler signal as an autonomously generated prompt. Based on the registration, the Doppler image or segmented vessel masks are then mapped onto the CBCT, creating an optimally fused image with comprehensive detail. To validate the system, we used a specially designed phantom, featuring lesions covered by ribs and multiple vessels with simulated moving flow. The mapping error between US and CBCT resulted in an average deviation of 1.72+-0.62 mm. A user study demonstrated the effectiveness of CBCT-US fusion for needle insertion guidance, showing significant improvements in time efficiency, accuracy, and success rate. Needle intervention performance improved by approximately 50% compared to the conventional US-guided workflow. We present the first robotic dual-modality imaging system designed to guide clinical applications. The results show significant performance improvements compared to traditional manual interventions.', 'abstract_zh': '多模态成像系统在现代临床实践中通过CT-超声（CT-US）引导针刺等操作提供最优融合图像，实现安全和精确的介入。然而，当前成像设备的有限灵活性和移动性限制了其整合到标准化工作流和向完全自主介入系统的进步。本文提出了一种新型临床设置，其中通过预校准和动态共注册实现了机器人锥束计算机断层扫描（CBCT）和机器人超声的整合，从而开启了新的临床应用。该设置允许无需配准的刚性配准，便于在没有组织变形的情况下进行多模态引导程序。首先，在系统之间进行一次性预校准。为确保安全的插入路径，SAM2从B模式图像中分割血管，使用多普勒信号作为自主生成的提示，突出显示3D CBCT中的关键血管。基于配准，多普勒图像或分割血管掩模被映射到CBCT上，生成具有全面细节的最优融合图像。为验证该系统，我们使用了一个特别设计的 phantom，其中包含由肋骨覆盖的病灶和多个具有模拟流动的血管。US 和 CBCT 之间的映射误差平均偏差为 1.72±0.62 mm。用户研究展示了CBCT-US融合在针刺引导方面的有效性，显示了显著的时间效率、准确性和成功率的提升。与传统的超声引导流程相比，针刺干预性能提高了约50%。我们介绍了首款用于临床应用的机器人双模态成像系统。结果显示，与传统手动干预相比，该系统具有显著的性能提升。', 'title_zh': '机器人CBCT与机器人超声融合'}
{'arxiv_id': 'arXiv:2502.11940', 'title': 'The Dynamic Model of the UR10 Robot and its ROS2 Integration', 'authors': 'Vincenzo Petrone, Enrico Ferrentino, Pasquale Chiacchio', 'link': 'https://arxiv.org/abs/2502.11940', 'abstract': "This paper presents the full dynamic model of the UR10 industrial robot. A triple-stage identification approach is adopted to estimate the manipulator's dynamic coefficients. First, linear parameters are computed using a standard linear regression algorithm. Subsequently, nonlinear friction parameters are estimated according to a sigmoidal model. Lastly, motor drive gains are devised to map estimated joint currents to torques. The overall identified model can be used for both control and planning purposes, as the accompanied ROS2 software can be easily reconfigured to account for a generic payload. The estimated robot model is experimentally validated against a set of exciting trajectories and compared to the state-of-the-art model for the same manipulator, achieving higher current prediction accuracy (up to a factor of 4.43) and more precise motor gains. The related software is available at this https URL.", 'abstract_zh': '本文呈现了UR10工业机器人的完整动力学模型。采用三阶段辨识方法估计 manipulator 的动态系数。首先，使用标准线性回归算法计算线性参数；随后，根据sigmoid模型估计非线性摩擦参数；最后，设计电机驱动增益，将估计的关节电流映射到扭矩。整体辨识模型可用于控制和规划目的，伴随的ROS2软件可以轻松重新配置以适应通用负载。实验结果表明，所估计的机器人模型与一组激发轨迹一致，并且在电流预测准确性（高达4.43倍）和电机增益精度方面优于同 manipulator 的最新模型。相关软件可在以下链接获取。', 'title_zh': 'UR10机器人及其ROS2集成的动力学模型'}
{'arxiv_id': 'arXiv:2502.11904', 'title': '1 A formal implementation of Behavior Trees to act in robotics', 'authors': 'Felix Ingrand', 'link': 'https://arxiv.org/abs/2502.11904', 'abstract': 'Behavior Trees (BT) are becoming quite popular as an Acting component of autonomous robotic systems. We propose to define a formal semantics to BT by translating them to a formal language which enables us to perform verification of programs written with BT, as well as runtime verification while these BT execute. This allows us to formally verify BT correctness without requiring BT programmers to master formal language and without compromising BT most valuable features: modularity, flexibility and reusability. We present the formal framework we use: Fiacre, its langage and the produced TTS model; Tina, its model checking tools and Hippo, its runtime verification engine. We then show how the translation from BT to Fiacre is automatically done, the type of formal LTL and CTL properties we can check offline and how to execute the formal model online in place of a regular BT engine. We illustrate our approach on two robotics applications, and show how BT could benefit of other features available in the Fiacre formal framework (state variables, time, etc).', 'abstract_zh': '行为树（BT）作为自主机器人系统中的行为组件正变得越来越流行。我们提出通过将BT翻译为形式语言来定义其形式语义，从而能够验证使用BT编写的程序，同时在BT执行过程中进行运行时验证。这使我们能够在不要求BT程序员掌握形式语言的情况下正式验证BT的正确性，同时保留其最宝贵的特性：模块性、灵活性和重用性。我们介绍了我们使用的正式框架：Fiacre、其语言以及生成的TTS模型Tina、其模型检查工具以及运行时验证引擎Hippo。然后我们展示了如何自动将BT翻译为Fiacre的过程，可以在离线检查的形式属性类型（如LTL和CTL属性），以及如何在线执行正式模型以替代常规的BT引擎。我们通过两个机器人应用实例说明了这种方法，并展示了BT如何从Fiacre正式框架中的其他功能（如状态变量、时间等）中受益。', 'title_zh': '基于行为树的正式实现及其在机器人领域的应用'}
{'arxiv_id': 'arXiv:2502.11887', 'title': 'Stonefish: Supporting Machine Learning Research in Marine Robotics', 'authors': 'Michele Grimaldi, Patryk Cieslak, Eduardo Ochoa, Vibhav Bharti, Hayat Rajani, Ignacio Carlucho, Maria Koskinopoulou, Yvan R. Petillot, Nuno Gracias', 'link': 'https://arxiv.org/abs/2502.11887', 'abstract': "Simulations are highly valuable in marine robotics, offering a cost-effective and controlled environment for testing in the challenging conditions of underwater and surface operations. Given the high costs and logistical difficulties of real-world trials, simulators capable of capturing the operational conditions of subsea environments have become key in developing and refining algorithms for remotely-operated and autonomous underwater vehicles. This paper highlights recent enhancements to the Stonefish simulator, an advanced open-source platform supporting development and testing of marine robotics solutions. Key updates include a suite of additional sensors, such as an event-based camera, a thermal camera, and an optical flow camera, as well as, visual light communication, support for tethered operations, improved thruster modelling, more flexible hydrodynamics, and enhanced sonar accuracy. These developments and an automated annotation tool significantly bolster Stonefish's role in marine robotics research, especially in the field of machine learning, where training data with a known ground truth is hard or impossible to collect.", 'abstract_zh': '模拟在水下机器人领域具有高度的价值，提供了一种在经济有效且受控的环境中测试 underwater 和表面操作挑战性条件的方法。鉴于实地试验高昂的成本和后勤难度，能够捕捉水下环境操作条件的模拟器已成为开发和改进遥控和自主水下车辆算法的关键。本文强调了对 Stonefish 模拟器的最新改进，这是一个先进的开源平台，支持水下机器人解决方案的开发和测试。关键更新包括一系列附加传感器，如事件驱动相机、热成像相机和光学流相机，以及视觉光通信、系缆操作支持、推进器模型改进、更灵活的水动力学和声纳精度增强。这些发展和自动标注工具极大地增强了 Stonefish 在水下机器人研究中的作用，尤其是在机器学习领域，因为很难或不可能收集具有已知真实值的训练数据。', 'title_zh': '石鱼：支持海洋机器人领域的机器学习研究'}
{'arxiv_id': 'arXiv:2502.11535', 'title': 'Disentangled Iterative Surface Fitting for Contact-stable Grasp Planning', 'authors': 'Tomoya Yamanokuchi, Alberto Bacchin, Emilio Olivastri, Takamitsu Matsubara, Emanuele Menegatti', 'link': 'https://arxiv.org/abs/2502.11535', 'abstract': 'In this work, we address the limitation of surface fitting-based grasp planning algorithm, which primarily focuses on geometric alignment between the gripper and object surface while overlooking the stability of contact point distribution, often resulting in unstable grasps due to inadequate contact configurations. To overcome this limitation, we propose a novel surface fitting algorithm that integrates contact stability while preserving geometric compatibility. Inspired by human grasping behavior, our method disentangles the grasp pose optimization into three sequential steps: (1) rotation optimization to align contact normals, (2) translation refinement to improve Center of Mass (CoM) alignment, and (3) gripper aperture adjustment to optimize contact point distribution. We validate our approach through simulations on ten YCB dataset objects, demonstrating an 80% improvement in grasp success over conventional surface fitting methods that disregard contact stability. Further details can be found on our project page: this https URL.', 'abstract_zh': '在这项工作中，我们解决了基于表面拟合的抓取规划算法的局限性，该算法主要关注手指与物体表面的几何对齐，而忽视了接触点分布的稳定性，导致由于接触配置不足而产生不稳定的抓取。为了克服这一局限性，我们提出了一种新型的表面拟合算法，该算法结合了接触稳定性的同时保持几何兼容性。受人类抓握行为的启发，我们的方法将抓取姿态优化分解为三个 sequential 步骤：（1）旋转优化以对齐接触法线，（2）平移细化以改善质心对齐，（3）手指开口调整以优化接触点分布。我们通过在 YCB 数据集的十个对象上进行仿真实验，证明了与忽视接触稳定性的传统表面拟合方法相比，我们的方法在抓取成功率上有80%的提升。更多详情请参见我们的项目页面：this https URL。', 'title_zh': '解耦迭代表面拟合用于接触稳定的抓取规划'}
{'arxiv_id': 'arXiv:2502.11534', 'title': 'SurgPose: a Dataset for Articulated Robotic Surgical Tool Pose Estimation and Tracking', 'authors': 'Zijian Wu, Adam Schmidt, Randy Moore, Haoying Zhou, Alexandre Banks, Peter Kazanzides, Septimiu E. Salcudean', 'link': 'https://arxiv.org/abs/2502.11534', 'abstract': 'Accurate and efficient surgical robotic tool pose estimation is of fundamental significance to downstream applications such as augmented reality (AR) in surgical training and learning-based autonomous manipulation. While significant advancements have been made in pose estimation for humans and animals, it is still a challenge in surgical robotics due to the scarcity of published data. The relatively large absolute error of the da Vinci end effector kinematics and arduous calibration procedure make calibrated kinematics data collection expensive. Driven by this limitation, we collected a dataset, dubbed SurgPose, providing instance-aware semantic keypoints and skeletons for visual surgical tool pose estimation and tracking. By marking keypoints using ultraviolet (UV) reactive paint, which is invisible under white light and fluorescent under UV light, we execute the same trajectory under different lighting conditions to collect raw videos and keypoint annotations, respectively. The SurgPose dataset consists of approximately 120k surgical instrument instances (80k for training and 40k for validation) of 6 categories. Each instrument instance is labeled with 7 semantic keypoints. Since the videos are collected in stereo pairs, the 2D pose can be lifted to 3D based on stereo-matching depth. In addition to releasing the dataset, we test a few baseline approaches to surgical instrument tracking to demonstrate the utility of SurgPose. More details can be found at this http URL.', 'abstract_zh': '准确高效的外科手术工具姿态估计对于下游应用如手术训练中的增强现实(AR)及基于学习的自主操作具有基础性意义。尽管在人类和动物的姿态估计方面取得了显著进展，但在外科手术机器人领域仍然面临挑战，主要原因在于发表数据的稀缺性。达芬奇末端执行器的动力学绝对误差较大且校准过程繁琐，使得经过校准的动力学数据采集成本高昂。为克服这一限制，我们收集了一个名为SurgPose的数据集，提供了用于视觉手术工具姿态估计和追踪的实例感知语义关键点和骨架。通过使用紫外线（UV）反应性油漆，在不同光照条件下执行相同的轨迹来收集原始视频和关键点标注。SurgPose数据集包含约12万例手术器械实例（其中8万例用于训练，4万例用于验证），分属6个类别。每个器械实例标注有7个语义关键点。由于视频是以立体成对的方式采集的，可以通过立体匹配深度将2D姿态提升为3D。除了发布数据集外，我们还测试了几种基线方法以验证SurgPose的实用性。更多详情请参见此链接：此http URL。', 'title_zh': 'SurgPose: 一种用于 articulated 手术工具姿态估计和跟踪的数据集'}
{'arxiv_id': 'arXiv:2502.11426', 'title': 'Verti-Bench: A General and Scalable Off-Road Mobility Benchmark for Vertically Challenging Terrain', 'authors': 'Tong Xu, Chenhui Pan, Madhan B. Rao, Aniket Datar, Anuj Pokhrel, Yuanjie Lu, Xuesu Xiao', 'link': 'https://arxiv.org/abs/2502.11426', 'abstract': 'Recent advancement in off-road autonomy has shown promises in deploying autonomous mobile robots in outdoor off-road environments. Encouraging results have been reported from both simulated and real-world experiments. However, unlike evaluating off-road perception tasks on static datasets, benchmarking off-road mobility still faces significant challenges due to a variety of factors, including variations in vehicle platforms and terrain properties. Furthermore, different vehicle-terrain interactions need to be unfolded during mobility evaluation, which requires the mobility systems to interact with the environments instead of comparing against a pre-collected dataset. In this paper, we present Verti-Bench, a mobility benchmark that focuses on extremely rugged, vertically challenging off-road environments. 100 unique off-road environments and 1000 distinct navigation tasks with millions of off-road terrain properties, including a variety of geometry and semantics, rigid and deformable surfaces, and large natural obstacles, provide standardized and objective evaluation in high-fidelity multi-physics simulation. Verti-Bench is also scalable to various vehicle platforms with different scales and actuation mechanisms. We also provide datasets from expert demonstration, random exploration, failure cases (rolling over and getting stuck), as well as a gym-like interface for reinforcement learning. We use Verti-Bench to benchmark ten off-road mobility systems, present our findings, and identify future off-road mobility research directions.', 'abstract_zh': '最近在非道路自主领域的进展展示了在户外非道路环境中部署自主移动机器人带来的前景。已从模拟和实际实验中报告了令人鼓舞的结果。然而，由于车辆平台和地形特性等多种因素的变化，与静态数据集评估非道路感知任务不同，非道路机动性的基准测试仍然面临巨大挑战。此外，机动性评估期间需要展开不同车辆-地形交互作用，这要求机动性系统与环境互动，而不仅仅是与预收集的数据集进行比较。本文介绍了一种专注于极端崎岖、垂直挑战性非道路环境的机动性基准测试——Verti-Bench。它提供了100种独特的非道路环境、1000个不同的导航任务以及包含多种几何和语义特性、刚性和可变形表面、以及大型自然障碍在内的数百万种非道路地形特性，以高保真度多物理场模拟提供标准化和客观评估。Verti-Bench 还可以扩展到具有不同规模和执行机制的各种车辆平台。我们还提供了专家演示、随机探索、失败案例（翻车和卡住）的数据集，以及用于强化学习的类似健身房的接口。我们使用 Verti-Bench 对十种非道路机动性系统进行了基准测试，展示了我们的研究成果，并指出了未来的非道路机动性研究方向。', 'title_zh': 'Verti-Bench: 一种适用于垂直挑战性地形的通用可扩展离路移动基准测试'}
{'arxiv_id': 'arXiv:2502.11124', 'title': 'AdaManip: Adaptive Articulated Object Manipulation Environments and Policy Learning', 'authors': 'Yuanfei Wang, Xiaojie Zhang, Ruihai Wu, Yu Li, Yan Shen, Mingdong Wu, Zhaofeng He, Yizhou Wang, Hao Dong', 'link': 'https://arxiv.org/abs/2502.11124', 'abstract': "Articulated object manipulation is a critical capability for robots to perform various tasks in real-world scenarios. Composed of multiple parts connected by joints, articulated objects are endowed with diverse functional mechanisms through complex relative motions. For example, a safe consists of a door, a handle, and a lock, where the door can only be opened when the latch is unlocked. The internal structure, such as the state of a lock or joint angle constraints, cannot be directly observed from visual observation. Consequently, successful manipulation of these objects requires adaptive adjustment based on trial and error rather than a one-time visual inference. However, previous datasets and simulation environments for articulated objects have primarily focused on simple manipulation mechanisms where the complete manipulation process can be inferred from the object's appearance. To enhance the diversity and complexity of adaptive manipulation mechanisms, we build a novel articulated object manipulation environment and equip it with 9 categories of objects. Based on the environment and objects, we further propose an adaptive demonstration collection and 3D visual diffusion-based imitation learning pipeline that learns the adaptive manipulation policy. The effectiveness of our designs and proposed method is validated through both simulation and real-world experiments. Our project page is available at: this https URL", 'abstract_zh': 'articulated物体操作是机器人在实际场景中执行各种任务的关键能力。由关节连接多个部分组成的articulated物体通过复杂相对运动具备多样化的功能机制。例如，一个保险箱包括门、把手和锁，只有当锁扣解锁时门才能打开。内部结构，如锁的状态或关节角度约束，无法通过视觉观察直接观察到。因此，成功操纵这些物体需要基于尝试和错误的适应性调整，而不是一次性的视觉推理。然而，以往articulated物体的数据集和仿真环境主要集中在简单的操作机制上，通过物体的外观可以推断出完整的操作过程。为了增强适应性操作机制的多样性和复杂性，我们构建了一个新的articulated物体操作环境，并配备了9类物体。基于该环境和物体，我们进一步提出了一种适应性演示采集及基于3D视觉扩散的模仿学习管道，以学习适应性操作策略。我们通过仿真和真实世界实验验证了设计和提出的有效方法。项目页面可访问：this https URL。', 'title_zh': 'AdaManip: 自适应 articulated 物体 manipulation 环境及策略学习'}
{'arxiv_id': 'arXiv:2502.10983', 'title': 'Learning Quiet Walking for a Small Home Robot', 'authors': 'Ryo Watanabe, Takahiro Miki, Fan Shi, Yuki Kadokawa, Filip Bjelonic, Kento Kawaharazuka, Andrei Cramariuc, Marco Hutter', 'link': 'https://arxiv.org/abs/2502.10983', 'abstract': 'As home robotics gains traction, robots are increasingly integrated into households, offering companionship and assistance. Quadruped robots, particularly those resembling dogs, have emerged as popular alternatives for traditional pets. However, user feedback highlights concerns about the noise these robots generate during walking at home, particularly the loud footstep sound. To address this issue, we propose a sim-to-real based reinforcement learning (RL) approach to minimize the foot contact velocity highly related to the footstep sound. Our framework incorporates three key elements: learning varying PD gains to actively dampen and stiffen each joint, utilizing foot contact sensors, and employing curriculum learning to gradually enforce penalties on foot contact velocity. Experiments demonstrate that our learned policy achieves superior quietness compared to a RL baseline and the carefully handcrafted Sony commercial controllers. Furthermore, the trade-off between robustness and quietness is shown. This research contributes to developing quieter and more user-friendly robotic companions in home environments.', 'abstract_zh': '随着家庭机器人技术的发展，机器人越来越多地被集成到家庭中，提供陪伴和辅助。仿四足机器人，尤其是外观像狗的机器人，已成为传统宠物的流行替代品。然而，用户反馈显示，这些机器人在家中行走时产生的噪音，尤其是脚步声，引发了关切。为了应对这一问题，我们提出了一种基于模拟到现实的强化学习（RL）方法，以最小化与脚步声高度相关的脚接触速度。我们的框架包含三个关键要素：学习变化的PD增益以主动减振和强化每个关节、利用脚接触传感器，并采用课程学习逐步对脚接触速度施加惩罚。实验表明，我们学习到的策略在静音方面优于RL基准和精心手工设计的SONY商用控制器。此外，还展示了鲁棒性和静音之间的权衡关系。这项研究为在家庭环境中开发更安静和更用户友好的机器人伴侣奠定了基础。', 'title_zh': '学习安静行走的小型家用机器人'}
{'arxiv_id': 'arXiv:2502.10761', 'title': 'A Whole-Body Disturbance Rejection Control Framework for Dynamic Motions in Legged Robots', 'authors': 'Bolin Li, Wentao Zhang, Xuecong Huang, Lijun Zhu', 'link': 'https://arxiv.org/abs/2502.10761', 'abstract': "This letter presents a control framework for legged robots that enables self-perception and resistance to external disturbances and model uncertainties. First, a novel disturbance estimator is proposed, integrating adaptive control and extended state observers (ESO) to estimate external disturbances and model uncertainties. This estimator is embedded within the whole-body control framework to compensate for disturbances in the legged system. Second, a comprehensive whole-body disturbance rejection control framework (WB-DRC) is introduced, accounting for the robot's full-body dynamics. Compared to previous whole-body control frameworks, WB-DRC effectively handles external disturbances and model uncertainties, with the potential to adapt to complex terrain. Third, simulations of both biped and quadruped robots are conducted in the Gazebo simulator to demonstrate the effectiveness and versatility of WB-DRC. Finally, extensive experimental trials on the quadruped robot validate the robustness and stability of the robot system using WB-DRC under various disturbance conditions.", 'abstract_zh': '基于自感知和对外部干扰及模型不确定性抵抗的腿式机器人控制框架', 'title_zh': '全身体姿干扰抑制控制框架：腿式机器人动态运动中的应用'}
{'arxiv_id': 'arXiv:2502.10547', 'title': 'A standardised platform for translational advances in fluidic soft systems', 'authors': 'M. Gepner, J. Mack, A. A. Stokes', 'link': 'https://arxiv.org/abs/2502.10547', 'abstract': 'Soft machines are poised to deliver significant real-world impact, with soft robotics emerging as a key sub-discipline. This field integrates biological inspiration, materials science, and embodied intelligence to create bio-robotic hybrids, blurring the boundary between engineered systems and biology. Over the past 15 years, research in fluidically controlled soft robots has led to commercialised systems that leverage "softness" to improve human-machine interaction or to handle delicate objects. However, translating laboratory advancements into scalable applications remains challenging due to difficulties in prototyping and manufacturing ultra-flexible materials, as well as the absence of standardised design processes. Here we show that the Flex Printer, an open-source, low-cost FDM platform, enables reliable printing of ultra-flexible soft robots with embedded fluidic logic. By employing an innovative upside-down print orientation, the system significantly expands the range of printable geometries. We demonstrate how this approach allows robots to autonomously walk off the print bed immediately after fabrication - a milestone achievement in soft robotics. This work provides a foundation for standardisation and scalable manufacturing, critical for accelerating the field\'s impact. More broadly, by lowering barriers to entry, this platform has the potential to democratise soft robotics research and facilitate the development of new applications. We invite the community to contribute to the shared development of this technology to drive the next wave of breakthroughs in soft robotics.', 'abstract_zh': '软机器人的崛起预示着巨大的现实世界影响，柔软的机器人学正成为一个关键的子学科。该领域通过整合生物学启发、材料科学和本体智能，创造出生物-机械人混合体，模糊了工程系统与生物学之间的界限。在过去15年里，流体控制柔软机器人的研究已经导致商业化系统利用“柔软性”来改善人机交互或处理精细物体。然而，将实验室成果转化为可扩展的应用仍然具有挑战性，主要是由于难以原型制作和制造超柔性材料，以及缺乏标准化的设计流程。我们展示了FlexPrinter这一开源低成本的FDM平台，能够可靠地打印嵌入流体逻辑的超柔性软机器人。通过采用创新的倒立打印方向，该系统显著扩展了可打印几何形状的范围。我们证明了这种方法使得机器人可以在制造完成后立即自主离开发印制板，这是软机器人领域的里程碑式成就。这项工作为标准化和可扩展制造奠定了基础，对于加速该领域的影响至关重要。更广泛地说，通过降低进入壁垒，该平台有望使软机器人研究更加平民化，促进新应用的发展。我们邀请社区共同开发这项技术，以推动软机器人领域的下一波突破。', 'title_zh': '标准化平台促进流体软系统转化研究'}
{'arxiv_id': 'arXiv:2502.10480', 'title': 'Safe Multi-agent Satellite Servicing with Control Barrier Functions', 'authors': 'Deep Parikh, David van Wijk, Manoranjan Majji', 'link': 'https://arxiv.org/abs/2502.10480', 'abstract': 'The use of control barrier functions under uncertain pose information of multiple small servicing agents is analyzed for a satellite servicing application. The application consists of modular servicing agents deployed towards a tumbling space object from a mothership. Relative position and orientation of each agent is obtained via fusion of relative range and inertial measurement sensors. The control barrier functions are utilized to avoid collisions with other agents for the application of simultaneously relocating servicing agents on a tumbling body. A differential collision detection and avoidance framework using the polytopic hull of the tumbling space object is utilized to safely guide the agents away from the tumbling object.', 'abstract_zh': '基于多个小型服务代理不确定姿态信息的控制障碍函数在卫星 servicing 应用中的应用分析', 'title_zh': '安全的多agent卫星服务控制屏障函数方法'}
