{'arxiv_id': 'arXiv:2504.11377', 'title': 'Improving Swimming Performance in Soft Robotic Fish with Distributed Muscles and Embedded Kinematic Sensing', 'authors': 'Kevin Soto, Isabel Hess, Brandon Schrader, Shan He, Patrick Musgrave', 'link': 'https://arxiv.org/abs/2504.11377', 'abstract': 'Bio-inspired underwater vehicles could yield improved efficiency, maneuverability, and environmental compatibility over conventional propeller-driven underwater vehicles. However, to realize the swimming performance of biology, there is a need for soft robotic swimmers with both distributed muscles and kinematic feedback. This study presents the design and swimming performance of a soft robotic fish with independently controllable muscles and embedded kinematic sensing distributed along the body. The soft swimming robot consists of an interior flexible spine, three axially distributed sets of HASEL artificial muscles, embedded strain gauges, a streamlined silicone body, and off-board electronics. In a fixed configuration, the soft robot generates a maximum thrust of 7.9 mN when excited near its first resonant frequency (2 Hz) with synchronized antagonistic actuation of all muscles. When excited near its second resonant frequency (8 Hz), synchronized muscle actuation generates 5.0 mN of thrust. By introducing a sequential phase offset into the muscle actuation, the thrust at the second resonant frequency increases to 7.2 mN, a 44% increase from simple antagonistic activation. The sequential muscle activation improves the thrust by increasing 1) the tail-beat velocity and 2) traveling wave content in the swimming kinematics by four times. Further, the second resonant frequency (8 Hz) generates nearly as much thrust as the first resonance (2 Hz) while requiring only $\\approx25$% of the tail displacement, indicating that higher resonant frequencies have benefits for swimming in confined environments where a smaller kinematic envelope is necessary. These results demonstrate the performance benefits of independently controllable muscles and distributed kinematic sensing, and this type of soft robotic swimmer provides a platform to address the open challenge of sensorimotor control.', 'abstract_zh': '受生物启发的 underwater 软体机器人鱼在推进效率、操控性和环境兼容性方面可能优于传统的螺旋桨驱动 underwater 车辆。然而，为了实现生物学的游泳性能，需要具有分布式肌肉和运动学反馈的软体机器人鱼。本研究介绍了具有独立可控肌肉和沿身体分布嵌入式运动学感应的软体机器人鱼的设计及其游泳性能。该软体游动机器人包括一个内部柔性脊柱、三组轴向分布的HASEL人工肌肉、嵌入式应变计、流线型硅胶体外壳和外部电子设备。在固定配置下，当在第一共振频率（2 Hz）附近激发并进行所有肌肉的同步拮抗激活时，软机器人产生最大推力7.9 mN。当在第二共振频率（8 Hz）附近激发并进行同步肌肉激活时，产生的推力为5.0 mN。通过引入肌肉激活的顺序相位偏移，第二共振频率下的推力增加到7.2 mN，比简单的拮抗激活增加了44%。顺序肌肉激活通过增加1) 尾拍速度和2) 游泳运动学中的行波成分四倍来提高推力。此外，第二共振频率（8 Hz）产生的推力几乎与第一共振频率（2 Hz）一样多，但仅需约25%的尾巴位移，表明在需要较小运动学包络的受限环境中，较高共振频率具有优势。这些结果展示了独立可控肌肉和分布式的运动学传感带来的性能优势，这种类型的软体机器人鱼为解决传感器运动控制这一开放性挑战提供了平台。', 'title_zh': '具有分布式肌肉和嵌入式运动传感的软体鱼类游泳性能提升'}
{'arxiv_id': 'arXiv:2504.11073', 'title': 'FreeDOM: Online Dynamic Object Removal Framework for Static Map Construction Based on Conservative Free Space Estimation', 'authors': 'Chen Li, Wanlei Li, Wenhao Liu, Yixiang Shu, Yunjiang Lou', 'link': 'https://arxiv.org/abs/2504.11073', 'abstract': 'Online map construction is essential for autonomous robots to navigate in unknown environments. However, the presence of dynamic objects may introduce artifacts into the map, which can significantly degrade the performance of localization and path planning. To tackle this problem, a novel online dynamic object removal framework for static map construction based on conservative free space estimation (FreeDOM) is proposed, consisting of a scan-removal front-end and a map-refinement back-end. First, we propose a multi-resolution map structure for fast computation and effective map representation. In the scan-removal front-end, we employ raycast enhancement to improve free space estimation and segment the LiDAR scan based on the estimated free space. In the map-refinement back-end, we further eliminate residual dynamic objects in the map by leveraging incremental free space information. As experimentally verified on SemanticKITTI, HeLiMOS, and indoor datasets with various sensors, our proposed framework overcomes the limitations of visibility-based methods and outperforms state-of-the-art methods with an average F1-score improvement of 9.7%.', 'abstract_zh': '基于保守自由空间估计的在线动态物体去除框架以构建静态地图', 'title_zh': 'FreeDOM：基于保守自由空间估计的静态地图构建在线动态对象移除框架'}
{'arxiv_id': 'arXiv:2504.10962', 'title': '$π$-MPPI: A Projection-based Model Predictive Path Integral Scheme for Smooth Optimal Control of Fixed-Wing Aerial Vehicles', 'authors': 'Edvin Martin Andrejev, Amith Manoharan, Karl-Eerik Unt, Arun Kumar Singh', 'link': 'https://arxiv.org/abs/2504.10962', 'abstract': 'Model Predictive Path Integral (MPPI) is a popular sampling-based Model Predictive Control (MPC) algorithm for nonlinear systems. It optimizes trajectories by sampling control sequences and averaging them. However, a key issue with MPPI is the non-smoothness of the optimal control sequence, leading to oscillations in systems like fixed-wing aerial vehicles (FWVs). Existing solutions use post-hoc smoothing, which fails to bound control derivatives. This paper introduces a new approach: we add a projection filter $\\pi$ to minimally correct control samples, ensuring bounds on control magnitude and higher-order derivatives. The filtered samples are then averaged using MPPI, leading to our $\\pi$-MPPI approach. We minimize computational overhead by using a neural accelerated custom optimizer for the projection filter. $\\pi$-MPPI offers a simple way to achieve arbitrary smoothness in control sequences. While we focus on FWVs, this projection filter can be integrated into any MPPI pipeline. Applied to FWVs, $\\pi$-MPPI is easier to tune than the baseline, resulting in smoother, more robust performance.', 'abstract_zh': '基于投影滤波的模型预测路径积分（π-MPPI）算法', 'title_zh': '基于投影的路径积分模型预测控制方案：固定翼 aerial 车辆平滑最优控制'}
{'arxiv_id': 'arXiv:2504.10783', 'title': 'Superfast Configuration-Space Convex Set Computation on GPUs for Online Motion Planning', 'authors': 'Peter Werner, Richard Cheng, Tom Stewart, Russ Tedrake, Daniela Rus', 'link': 'https://arxiv.org/abs/2504.10783', 'abstract': 'In this work, we leverage GPUs to construct probabilistically collision-free convex sets in robot configuration space on the fly. This extends the use of modern motion planning algorithms that leverage such representations to changing environments. These planners rapidly and reliably optimize high-quality trajectories, without the burden of challenging nonconvex collision-avoidance constraints. We present an algorithm that inflates collision-free piecewise linear paths into sequences of convex sets (SCS) that are probabilistically collision-free using massive parallelism. We then integrate this algorithm into a motion planning pipeline, which leverages dynamic roadmaps to rapidly find one or multiple collision-free paths, and inflates them. We then optimize the trajectory through the probabilistically collision-free sets, simultaneously using the candidate trajectory to detect and remove collisions from the sets. We demonstrate the efficacy of our approach on a simulation benchmark and a KUKA iiwa 7 robot manipulator with perception in the loop. On our benchmark, our approach runs 17.1 times faster and yields a 27.9% increase in reliability over the nonlinear trajectory optimization baseline, while still producing high-quality motion plans.', 'abstract_zh': '本研究利用GPU实时构建机器人配置空间中的概率无碰撞凸集。此方法将依赖此类表示的现代运动规划算法扩展到动态环境。这些规划器能够迅速可靠地优化高质量轨迹，同时避免复杂的非凸碰撞约束。我们提出了一种算法，利用大规模并行性将无碰撞的分段线性路径膨胀为概率无碰撞的凸集序列（SCS）。然后，我们将此算法集成到运动规划管道中，利用动态路网快速找到一个或多个无碰撞路径，并将其膨胀。随后，我们通过这些概率无碰撞的集屮优化轨迹，同时使用候选轨迹检测并移除集中的碰撞。我们通过仿真基准和带有感知的KUKA iiwa 7机器人 manipulator演示了该方法的有效性。在基准测试中，与非线性轨迹优化基准相比，该方法运行速度快17.1倍，可靠性能提高27.9%，同时生成高质量的运动规划。', 'title_zh': '基于GPU的超快速配置空间凸集计算在线运动规划'}
{'arxiv_id': 'arXiv:2504.10699', 'title': 'HyRRT-Connect: Bidirectional Motion Planning for Hybrid Dynamical Systems', 'authors': 'Nan Wang, Ricardo G. Sanfelice', 'link': 'https://arxiv.org/abs/2504.10699', 'abstract': 'This paper proposes a bidirectional rapidly-exploring random trees (RRT) algorithm to solve the motion planning problem for hybrid systems. The proposed algorithm, called HyRRT-Connect, propagates in both forward and backward directions in hybrid time until an overlap between the forward and backward propagation results is detected. Then, HyRRT-Connect constructs a motion plan through the reversal and concatenation of functions defined on hybrid time domains, ensuring that the motion plan satisfies the given hybrid dynamics. To address the potential discontinuity along the flow caused by tolerating some distance between the forward and backward partial motion plans, we reconstruct the backward partial motion plan by a forward-in-hybrid-time simulation from the final state of the forward partial motion plan. effectively eliminating the discontinuity. The proposed algorithm is applied to an actuated bouncing ball system and a walking robot example to highlight its computational improvement.', 'abstract_zh': '该论文提出了一种双向快速探索随机树（RRT）算法以解决混合系统的运动规划问题。所提出的方法称为HyRRT-Connect，它在混合时间的前后两个方向上进行扩展，直到检测到前后扩展之间的重叠。然后，HyRRT-Connect通过反转和拼接定义在混合时间域上的函数来构造运动计划，确保运动计划满足给定的混合动力学。为了解决由前后局部运动计划之间允许的距离导致的沿流的潜在不连续性，我们通过从前向混合时间的最终状态进行反向模拟来重构后向局部运动计划，从而有效消除不连续性。所提出的方法应用于一个受控跳球系统和一个步行机器人示例，以突出其计算上的改进。', 'title_zh': 'HyRRT-Connect：混合动力系统双向运动规划'}
{'arxiv_id': 'arXiv:2504.11064', 'title': 'A Multi-UAV Formation Obstacle Avoidance Method Combined Improved Simulated Annealing and Adaptive Artificial Potential Field', 'authors': 'Bo Ma, Yi Ji, Liyong Fang', 'link': 'https://arxiv.org/abs/2504.11064', 'abstract': 'The traditional Artificial Potential Field (APF) method exhibits limitations in its force distribution: excessive attraction when UAVs are far from the target may cause collisions with obstacles, while insufficient attraction near the goal often results in failure to reach the target. Furthermore, APF is highly susceptible to local minima, compromising motion reliability in complex environments. To address these challenges, this paper presents a novel hybrid obstacle avoidance algorithm-Deflected Simulated Annealing-Adaptive Artificial Potential Field (DSA-AAPF)-which combines an improved simulated annealing mechanism with an enhanced APF model. The proposed approach integrates a Leader-Follower distributed formation strategy with the APF framework, where the resultant force formulation is redefined to smooth UAV trajectories. An adaptive gravitational gain function is introduced to dynamically adjust UAV velocity based on environmental context, and a fast-converging controller ensures accurate and efficient convergence to the target. Moreover, a directional deflection mechanism is embedded within the simulated annealing process, enabling UAVs to escape local minima caused by semi-enclosed obstacles through continuous rotational motion. The simulation results, covering formation reconfiguration, complex obstacle avoidance, and entrapment escape, demonstrate the feasibility, robustness, and superiority of the proposed DSA-AAPF algorithm.', 'abstract_zh': '改进的模拟退火-自适应人工势场混合避障算法（改进DSA-AAPF算法）', 'title_zh': '改进模拟退火算法和自适应人工势场相结合的多无人机编队障碍避让方法'}
{'arxiv_id': 'arXiv:2504.10764', 'title': 'SeeTree -- A modular, open-source system for tree detection and orchard localization', 'authors': 'Jostan Brown, Cindy Grimm, Joseph R. Davidson', 'link': 'https://arxiv.org/abs/2504.10764', 'abstract': 'Accurate localization is an important functional requirement for precision orchard management. However, there are few off-the-shelf commercial solutions available to growers. In this paper, we present SeeTree, a modular, open source embedded system for tree trunk detection and orchard localization that is deployable on any vehicle. Building on our prior work on vision-based in-row localization using particle filters, SeeTree includes several new capabilities. First, it provides capacity for full orchard localization including out-of-row headland turning. Second, it includes the flexibility to integrate either visual, GNSS, or wheel odometry in the motion model. During field experiments in a commercial orchard, the system converged to the correct location 99% of the time over 800 trials, even when starting with large uncertainty in the initial particle locations. When turning out of row, the system correctly tracked 99% of the turns (860 trials representing 43 unique row changes). To help support adoption and future research and development, we make our dataset, design files, and source code freely available to the community.', 'abstract_zh': '精准定位是精确果园管理的重要功能需求。然而，面向种植者提供的现成商业解决方案很少。本文介绍SeeTree，一种基于模块化和开源的嵌入式系统，用于检测树干并实现果园定位，可在任何车辆上部署。该系统在我们之前基于粒子滤波的行内视觉定位工作基础上，包含了几种新的功能。首先，它提供了包括行间调头的整个果园定位能力。其次，其运动模型能够灵活地整合视觉、GNSS或轮式里程计。在商业化果园的实地试验中，系统在800次试验中有99%的时间能够从初始位置的高不确定性中收敛到正确位置；在行间调头时，系统正确跟踪了99%的转弯（860次试验，涵盖43次不同的行变化）。为了支持推广应用和未来的研究开发，我们将数据集、设计文件和源代码免费提供给社区。', 'title_zh': 'SeeTree ——一种模块化开源的树木检测与果园定位系统'}
{'arxiv_id': 'arXiv:2504.11374', 'title': 'A Winner-Takes-All Mechanism for Event Generation', 'authors': 'Yongkang Huo, Fuvio Forni, Rodolphe Sepulchre', 'link': 'https://arxiv.org/abs/2504.11374', 'abstract': 'We present a novel framework for central pattern generator design that leverages the intrinsic rebound excitability of neurons in combination with winner-takes-all computation. Our approach unifies decision-making and rhythmic pattern generation within a simple yet powerful network architecture that employs all-to-all inhibitory connections enhanced by designable excitatory interactions. This design offers significant advantages regarding ease of implementation, adaptability, and robustness. We demonstrate its efficacy through a ring oscillator model, which exhibits adaptive phase and frequency modulation, making the framework particularly promising for applications in neuromorphic systems and robotics.', 'abstract_zh': '一种利用神经元内源性反弹可兴奋性与胜者全取计算相结合的新型中央模式发生器设计框架', 'title_zh': '全胜者机制事件生成'}
