{'arxiv_id': 'arXiv:2506.08868', 'title': 'MOMAV: A highly symmetrical fully-actuated multirotor drone using optimizing control allocation', 'authors': 'Marco Ruggia', 'link': 'https://arxiv.org/abs/2506.08868', 'abstract': "MOMAV (Marco's Omnidirectional Micro Aerial Vehicle) is a multirotor drone that is fully actuated, meaning it can control its orientation independently of its position. MOMAV is also highly symmetrical, making its flight efficiency largely unaffected by its current orientation. These characteristics are achieved by a novel drone design where six rotor arms align with the vertices of an octahedron, and where each arm can actively rotate along its long axis. Various standout features of MOMAV are presented: The high flight efficiency compared to arm configuration of other fully-actuated drones, the design of an original rotating arm assembly featuring slip-rings used to enable continuous arm rotation, and a novel control allocation algorithm based on sequential quadratic programming (SQP) used to calculate throttle and arm-angle setpoints in flight. Flight tests have shown that MOMAV is able to achieve remarkably low mean position/orientation errors of 6.6mm, 2.1° ({\\sigma}: 3.0mm, 1.0°) when sweeping position setpoints, and 11.8mm, 3.3° ({\\sigma}: 8.6mm, 2.0°) when sweeping orientation setpoints.", 'abstract_zh': '马科斯的全向微型飞行器（MOMAV）是一种全自主飞行的多旋翼无人机，能够独立控制姿态而不受位置影响。MOMAV具有高度对称性，其飞行效率在当前姿态变化时几乎不受影响。这些特性通过一种创新的无人机设计实现，该设计将六个旋翼臂排列成八面体的顶点，并且每根旋翼臂都可以沿其长轴主动旋转。MOMAV的一些突出特征包括与其它全自主飞行旋翼机相比的高飞行效率、一种新型旋转臂组件设计，该设计采用滑动环实现连续旋转，以及基于序列二次规划（SQP）的新型控制分配算法，用于飞行中计算油门和旋翼臂角度设定值。飞行测试表明，MOMAV在位置设定点扫描时可以实现显著低的平均位置/姿态偏差6.6毫米、2.1度（σ：3.0毫米、1.0度），在姿态设定点扫描时可以实现11.8毫米、3.3度（σ：8.6毫米、2.0度）的平均偏差。', 'title_zh': 'MOMAV：一种采用优化控制分配的高度对称全驱动多旋翼无人机'}
{'arxiv_id': 'arXiv:2506.08856', 'title': 'Fast Estimation of Globally Optimal Independent Contact Regions for Robust Grasping and Manipulation', 'authors': 'Jonathan P. King, Harnoor Ahluwalia, Michael Zhang, Nancy S. Pollard', 'link': 'https://arxiv.org/abs/2506.08856', 'abstract': 'This work presents a fast anytime algorithm for computing globally optimal independent contact regions (ICRs). ICRs are regions such that one contact within each region enables a valid grasp. Locations of ICRs can provide guidance for grasp and manipulation planning, learning, and policy transfer. However, ICRs for modern applications have been little explored, in part due to the expense of computing them, as they have a search space exponential in the number of contacts. We present a divide and conquer algorithm based on incremental n-dimensional Delaunay triangulation that produces results with bounded suboptimality in times sufficient for real-time planning. This paper presents the base algorithm for grasps where contacts lie within a plane. Our experiments show substantial benefits over competing grasp quality metrics and speedups of 100X and more for competing approaches to computing ICRs. We explore robustness of a policy guided by ICRs and outline a path to general 3D implementation. Code will be released on publication to facilitate further development and applications.', 'abstract_zh': '本工作提出一种快速的任意时序算法，用于计算全局最优独立接触区域（ICRs）。ICRs是这样一些区域：每个区域内的一个接触点能形成一个有效的握持。ICRs的位置可为抓取和操作规划、学习和策略转移提供指导。然而，由于计算ICRs的成本高昂，特别是在接触点数量增加时搜索空间呈指数增长，现代应用中的ICRs尚未得到充分探索。我们提出了一种基于增量n维Delaunay三角剖分的分而治之算法，能够在满足实时规划要求的时间内产生带有有界次优性的结果。本文提出的基算法适用于接触点位于平面内的抓取情况。我们的实验表明，该算法在抓取质量度量方面优于竞争对手，并且在计算ICRs的竞争方法上实现了100倍以上的加速。我们探讨了由ICRs引导的策略的鲁棒性，并概述了一条通向三维通用实现的方法。代码将在发表后公开，以促进进一步的发展和应用。', 'title_zh': '全局最优独立接触区域的快速估算：提高抓取与操作的鲁棒性'}
{'arxiv_id': 'arXiv:2506.08706', 'title': 'ROS-related Robotic Systems Development with V-model-based Application of MeROS Metamodel', 'authors': 'Tomasz Winiarski, Jan Kaniuka, Daniel Giełdowski, Jakub Ostrysz, Krystian Radlak, Dmytro Kushnir', 'link': 'https://arxiv.org/abs/2506.08706', 'abstract': 'As robotic systems grow increasingly complex, heterogeneous, and safety-critical, the need for structured development methodologies becomes paramount. Although frameworks like the Robot Operating System (ROS) and Model-Based Systems Engineering (MBSE) offer foundational tools, they often lack integration when used together. This paper addresses that gap by aligning the widely recognized V-model development paradigm with the MeROS metamodel SysML-based modeling language tailored for ROS-based systems.\nWe propose a domain-specific methodology that bridges ROS-centric modelling with systems engineering practices. Our approach formalises the structure, behaviour, and validation processes of robotic systems using MeROS, while extending it with a generalized, adaptable V-model compatible with both ROS and ROS 2. Rather than prescribing a fixed procedure, the approach supports project-specific flexibility and reuse, offering guidance across all stages of development.\nThe approach is validated through a comprehensive case study on HeROS, a heterogeneous multi-robot platform comprising manipulators, mobile units, and dynamic test environments. This example illustrates how the MeROS-compatible V-model enhances traceability and system consistency while remaining accessible and extensible for future adaptation. The work contributes a structured, tool-agnostic foundation for developers and researchers seeking to apply MBSE practices in ROS-based projects.', 'abstract_zh': '随着机器人系统日益复杂、异构化和安全性关键性提高，结构化的开发方法学变得至关重要。虽然像Robot Operating System (ROS)和基于模型的系统工程（MBSE）这样的框架提供了基础工具，但它们在结合使用时往往缺乏集成。本文通过将广泛认可的V模型开发范式与基于SysML的MeROS元模型对齐，解决了这一问题，MeROS专门针对基于ROS的系统进行建模。我们提出了一种领域特定的方法，将以ROS为中心的建模与系统工程实践相结合。该方法使用MeROS形式化机器人系统的结构、行为和验证过程，并通过扩展，使其兼容ROS和ROS 2的通用和可扩展V模型。这种方法不规定固定流程，而是支持项目特定的灵活性和重用，在整个开发阶段提供指导。该方法通过一个全面的案例研究HeROS进行验证，HeROS是一个异构多机器人平台，包含操作臂、移动单元和动态测试环境。这一示例展示了MeROS兼容的V模型如何增强可追溯性和系统一致性，同时保持可访问性和未来扩展性。本研究为寻求在基于ROS的项目中应用MBSE实践的开发者和研究者提供了一个结构化、工具无关的基础。', 'title_zh': '基于MeROS元模型的V模型应用的ROS相关机器人系统开发'}
{'arxiv_id': 'arXiv:2506.08291', 'title': 'TensorTouch: Calibration of Tactile Sensors for High Resolution Stress Tensor and Deformation for Dexterous Manipulation', 'authors': 'Won Kyung Do, Matthew Strong, Aiden Swann, Boshu Lei, Monroe Kennedy III', 'link': 'https://arxiv.org/abs/2506.08291', 'abstract': 'Advanced dexterous manipulation involving multiple simultaneous contacts across different surfaces, like pinching coins from ground or manipulating intertwined objects, remains challenging for robotic systems. Such tasks exceed the capabilities of vision and proprioception alone, requiring high-resolution tactile sensing with calibrated physical metrics. Raw optical tactile sensor images, while information-rich, lack interpretability and cross-sensor transferability, limiting their real-world utility. TensorTouch addresses this challenge by integrating finite element analysis with deep learning to extract comprehensive contact information from optical tactile sensors, including stress tensors, deformation fields, and force distributions at pixel-level resolution. The TensorTouch framework achieves sub-millimeter position accuracy and precise force estimation while supporting large sensor deformations crucial for manipulating soft objects. Experimental validation demonstrates 90% success in selectively grasping one of two strings based on detected motion, enabling new contact-rich manipulation capabilities previously inaccessible to robotic systems.', 'abstract_zh': '涉及多种同时接触不同表面的高级灵巧操作，如从地面夹取硬币或操作交织物体，仍是对机器人系统的一项挑战。此类任务超出了仅依赖视觉和本体感觉的能力范围，需要具备校准物理指标的高分辨率触觉感知。尽管光学触觉传感器图像信息丰富，但缺乏可解释性和跨传感器转移性，限制了其在实际中的应用。TensorTouch通过将有限元分析与深度学习结合，从光学触觉传感器中提取全面的接触信息，包括像素级分辨率的应力张量、变形场和力分布。TensorTouch框架实现了亚毫米级别的位置精度和精确的力估计，同时支持对于操纵软物体至关重要的大传感器变形。实验验证显示，在基于检测到的运动选择性抓取两条线之一方面达到了90%的成功率，为机器人系统提供了新的丰富的接触操作能力，这些能力以前是不可及的。', 'title_zh': 'TensorTouch: 用于 Dexterous 操作的高分辨率应力张量和变形校准的触觉传感器标定'}
{'arxiv_id': 'arXiv:2506.08344', 'title': 'Re4MPC: Reactive Nonlinear MPC for Multi-model Motion Planning via Deep Reinforcement Learning', 'authors': 'Neşet Ünver Akmandor, Sarvesh Prajapati, Mark Zolotas, Taşkın Padır', 'link': 'https://arxiv.org/abs/2506.08344', 'abstract': 'Traditional motion planning methods for robots with many degrees-of-freedom, such as mobile manipulators, are often computationally prohibitive for real-world settings. In this paper, we propose a novel multi-model motion planning pipeline, termed Re4MPC, which computes trajectories using Nonlinear Model Predictive Control (NMPC). Re4MPC generates trajectories in a computationally efficient manner by reactively selecting the model, cost, and constraints of the NMPC problem depending on the complexity of the task and robot state. The policy for this reactive decision-making is learned via a Deep Reinforcement Learning (DRL) framework. We introduce a mathematical formulation to integrate NMPC into this DRL framework. To validate our methodology and design choices, we evaluate DRL training and test outcomes in a physics-based simulation involving a mobile manipulator. Experimental results demonstrate that Re4MPC is more computationally efficient and achieves higher success rates in reaching end-effector goals than the NMPC baseline, which computes whole-body trajectories without our learning mechanism.', 'abstract_zh': '面向多自由度机器人的传统运动规划方法在实际应用场景中往往计算代价高昂。本文提出了一种名为Re4MPC的新型多模型运动规划管道，通过非线性模型预测控制（NMPC）计算轨迹。Re4MPC根据任务复杂性和机器人状态反应性地选择NMPC问题中的模型、成本和约束条件，从而以计算高效的方式生成轨迹。该反应性决策策略通过深度强化学习（DRL）框架学习。本文引入了将NMPC整合到该DRL框架中的数学公式。为了验证我们的方法和设计选择，我们在涉及移动 manipulator的基于物理的仿真中评估了DRL训练和测试结果。实验结果表明，与不包含学习机制的全身体现NMPC基线相比，Re4MPC在计算效率和末端执行器目标达到的成功率方面更具优势。', 'title_zh': 'Re4MPC: 基于深度强化学习的多模型运动规划的反应式非线性MPC'}
