{'arxiv_id': 'arXiv:2504.15263', 'title': 'Interpretable Locomotion Prediction in Construction Using a Memory-Driven LLM Agent With Chain-of-Thought Reasoning', 'authors': 'Ehsan Ahmadi, Chao Wang', 'link': 'https://arxiv.org/abs/2504.15263', 'abstract': 'Construction tasks are inherently unpredictable, with dynamic environments and safety-critical demands posing significant risks to workers. Exoskeletons offer potential assistance but falter without accurate intent recognition across diverse locomotion modes. This paper presents a locomotion prediction agent leveraging Large Language Models (LLMs) augmented with memory systems, aimed at improving exoskeleton assistance in such settings. Using multimodal inputs - spoken commands and visual data from smart glasses - the agent integrates a Perception Module, Short-Term Memory (STM), Long-Term Memory (LTM), and Refinement Module to predict locomotion modes effectively. Evaluation reveals a baseline weighted F1-score of 0.73 without memory, rising to 0.81 with STM, and reaching 0.90 with both STM and LTM, excelling with vague and safety-critical commands. Calibration metrics, including a Brier Score drop from 0.244 to 0.090 and ECE from 0.222 to 0.044, affirm improved reliability. This framework supports safer, high-level human-exoskeleton collaboration, with promise for adaptive assistive systems in dynamic industries.', 'abstract_zh': '一种利用大型语言模型增强的记忆系统进行步行模式预测的外骨骼辅助方法', 'title_zh': '基于记忆驱动的链式思维推理LLM代理的可解释建筑施工运动预测'}
{'arxiv_id': 'arXiv:2504.15235', 'title': 'Cascade IPG Observer for Underwater Robot State Estimation', 'authors': 'Kaustubh Joshi, Tianchen Liu, Nikhil Chopra', 'link': 'https://arxiv.org/abs/2504.15235', 'abstract': 'This paper presents a novel cascade nonlinear observer framework for inertial state estimation. It tackles the problem of intermediate state estimation when external localization is unavailable or in the event of a sensor outage. The proposed observer comprises two nonlinear observers based on a recently developed iteratively preconditioned gradient descent (IPG) algorithm. It takes the inputs via an IMU preintegration model where the first observer is a quaternion-based IPG. The output for the first observer is the input for the second observer, estimating the velocity and, consequently, the position. The proposed observer is validated on a public underwater dataset and a real-world experiment using our robot platform. The estimation is compared with an extended Kalman filter (EKF) and an invariant extended Kalman filter (InEKF). Results demonstrate that our method outperforms these methods regarding better positional accuracy and lower variance.', 'abstract_zh': '本文提出了一种新型级联非线性观测量化框架用于惯性状态估计。该框架解决了在外置定位不可用或传感器故障时的中间状态估计问题。所提出的观测量化器包括两个基于 recently developed 迭代预条件梯度下降 (IPG) 算法的非线性观测量化器。观测量化器通过陀螺仪数据预积分模型接收输入，其中第一个观测量化器是基于四元数的 IPG。第一个观测量化器的输出作为第二个观测量化器的输入，估计速度并进而估计位置。所提出的观测量化器在公共水下数据集和使用我们机器人平台的真实世界实验中进行了验证。估计结果与扩展卡尔曼滤波器 (EKF) 和不变扩展卡尔曼滤波器 (InEKF) 进行了比较。结果表明，我们的方法在位置准确性方面优于这两种方法，并且具有更低的变异。', 'title_zh': '级联IPG观测器用于水下机器人状态估计'}
{'arxiv_id': 'arXiv:2504.15229', 'title': 'Immersive Teleoperation Framework for Locomanipulation Tasks', 'authors': 'Takuya Boehringer, Jonathan Embley-Riches, Karim Hammoud, Valerio Modugno, Dimitrios Kanoulas', 'link': 'https://arxiv.org/abs/2504.15229', 'abstract': 'Recent advancements in robotic loco-manipulation have leveraged Virtual Reality (VR) to enhance the precision and immersiveness of teleoperation systems, significantly outperforming traditional methods reliant on 2D camera feeds and joystick controls. Despite these advancements, challenges remain, particularly concerning user experience across different setups. This paper introduces a novel VR-based teleoperation framework designed for a robotic manipulator integrated onto a mobile platform. Central to our approach is the application of Gaussian splatting, a technique that abstracts the manipulable scene into a VR environment, thereby enabling more intuitive and immersive interactions. Users can navigate and manipulate within the virtual scene as if interacting with a real robot, enhancing both the engagement and efficacy of teleoperation tasks. An extensive user study validates our approach, demonstrating significant usability and efficiency improvements. Two-thirds (66%) of participants completed tasks faster, achieving an average time reduction of 43%. Additionally, 93% preferred the Gaussian Splat interface overall, with unanimous (100%) recommendations for future use, highlighting improvements in precision, responsiveness, and situational awareness. Finally, we demonstrate the effectiveness of our framework through real-world experiments in two distinct application scenarios, showcasing the practical capabilities and versatility of the Splat-based VR interface.', 'abstract_zh': '近期机器人移动操作领域的进展通过虚拟现实（VR）提高了远程操作系统的精确度和沉浸感，显著优于依赖2D相机馈送和操纵杆控制的传统方法。尽管取得了这些进展，仍存在挑战，尤其是在不同配置下的用户体验方面。本文提出了一种新型基于VR的远程操作框架，适用于集成在移动平台上的机器人 manipulator。我们方法的核心是应用高斯点积技术，将可操作场景抽象为VR环境，从而实现更具直观性和沉浸感的交互。用户可以像操作真实机器人一样导航和操控虚拟场景，增强远程操作任务的参与度和有效性。广泛用户的实验验证了我们方法的有效性，显示出显著的可用性和效率提升。66%的参与者完成任务的速度更快，平均时间减少了43%。此外，93%的参与者整体上更偏好高斯点积界面，并一致推荐用于未来使用，突显了在精确度、响应性和情境意识方面的改进。最后，我们通过两个不同应用场景的实际实验展示了基于点积的VR界面的有效性和灵活性。', 'title_zh': '沉浸式远程操作框架用于局部操作任务'}
{'arxiv_id': 'arXiv:2504.15226', 'title': 'A Genetic Fuzzy-Enabled Framework on Robotic Manipulation for In-Space Servicing', 'authors': 'Nathan Steffen, Wilhelm Louw, Nicholas Ernest, Timothy Arnett, Kelly Cohen', 'link': 'https://arxiv.org/abs/2504.15226', 'abstract': "Automation of robotic systems for servicing in cislunar space is becoming extremely important as the number of satellites in orbit increases. Safety is critical in performing satellite maintenance, so the control techniques utilized must be trusted in addition to being highly efficient. In this work, Genetic Fuzzy Trees are combined with the widely used LQR control scheme via Thales' TrUE AI Toolkit to create a trusted and efficient controller for a two-degree-of-freedom planar robotic manipulator that would theoretically be used to perform satellite maintenance. It was found that Genetic Fuzzy-LQR is 18.5% more performant than optimal LQR on average, and that it is incredibly robust to uncertainty.", 'abstract_zh': '月球轨道内空间服务机器人系统自动化日益重要：基于Genetic Fuzzy Trees与LQR的控制器设计及其性能分析', 'title_zh': '基于遗传模糊系统的空间维修机器人操作框架'}
{'arxiv_id': 'arXiv:2504.15138', 'title': 'Automatic Generation of Aerobatic Flight in Complex Environments via Diffusion Models', 'authors': 'Yuhang Zhong, Anke Zhao, Tianyue Wu, Tingrui Zhang, Fei Gao', 'link': 'https://arxiv.org/abs/2504.15138', 'abstract': 'Performing striking aerobatic flight in complex environments demands manual designs of key maneuvers in advance, which is intricate and time-consuming as the horizon of the trajectory performed becomes long. This paper presents a novel framework that leverages diffusion models to automate and scale up aerobatic trajectory generation. Our key innovation is the decomposition of complex maneuvers into aerobatic primitives, which are short frame sequences that act as building blocks, featuring critical aerobatic behaviors for tractable trajectory synthesis. The model learns aerobatic primitives using historical trajectory observations as dynamic priors to ensure motion continuity, with additional conditional inputs (target waypoints and optional action constraints) integrated to enable user-editable trajectory generation. During model inference, classifier guidance is incorporated with batch sampling to achieve obstacle avoidance. Additionally, the generated outcomes are refined through post-processing with spatial-temporal trajectory optimization to ensure dynamical feasibility. Extensive simulations and real-world experiments have validated the key component designs of our method, demonstrating its feasibility for deploying on real drones to achieve long-horizon aerobatic flight.', 'abstract_zh': '利用扩散模型自动扩展空中特技轨迹生成的新框架：在复杂环境中执行令人印象深刻的有氧飞行需要提前手动设计关键机动，随着飞行轨迹范围变得广泛，这一过程既复杂又耗时。本文提出了一种利用扩散模型自动扩展和放大空中特技轨迹生成的新框架。我们的核心创新是将复杂的机动分解为空中特技基本功，这些基本功是作为构建块的短帧序列，具备关键的空中特技行为，以实现可处理的轨迹合成。该模型通过历史轨迹观察动态先验学习空中特技基本功，并通过额外的条件输入（目标航点和可选的动作约束）实现用户可编辑的轨迹生成。在模型推理过程中，通过批量采样结合分类器指导实现障碍物避免。此外，通过时空轨迹优化后处理生成的结果，以确保动力学可行性。本方法的关键组件设计经过广泛的仿真和实地实验验证，证明其可用于实际无人机上的高航程空中特技飞行。', 'title_zh': '通过扩散模型在复杂环境下自动生成空中飞行机动动作'}
{'arxiv_id': 'arXiv:2504.15130', 'title': 'Neural ATTF: A Scalable Solution to Lifelong Multi-Agent Path Planning', 'authors': 'Kushal Shah, Jihyun Park, Seung-Kyum Choi', 'link': 'https://arxiv.org/abs/2504.15130', 'abstract': "Multi-Agent Pickup and Delivery (MAPD) is a fundamental problem in robotics, particularly in applications such as warehouse automation and logistics. Existing solutions often face challenges in scalability, adaptability, and efficiency, limiting their applicability in dynamic environments with real-time planning requirements. This paper presents Neural ATTF (Adaptive Task Token Framework), a new algorithm that combines a Priority Guided Task Matching (PGTM) Module with Neural STA* (Space-Time A*), a data-driven path planning method. Neural STA* enhances path planning by enabling rapid exploration of the search space through guided learned heuristics and ensures collision avoidance under dynamic constraints. PGTM prioritizes delayed agents and dynamically assigns tasks by prioritizing agents nearest to these tasks, optimizing both continuity and system throughput. Experimental evaluations against state-of-the-art MAPD algorithms, including TPTS, CENTRAL, RMCA, LNS-PBS, and LNS-wPBS, demonstrate the superior scalability, solution quality, and computational efficiency of Neural ATTF. These results highlight the framework's potential for addressing the critical demands of complex, real-world multi-agent systems operating in high-demand, unpredictable settings.", 'abstract_zh': '基于神经网络的自适应任务令牌框架（Neural ATTF）：多智能体捡取与交付（MAPD）问题的新算法', 'title_zh': '神经ATTF： lifelong多agent路径规划的可扩展解决方案'}
{'arxiv_id': 'arXiv:2504.15129', 'title': 'A General Infrastructure and Workflow for Quadrotor Deep Reinforcement Learning and Reality Deployment', 'authors': 'Kangyao Huang, Hao Wang, Yu Luo, Jingyu Chen, Jintao Chen, Xiangkui Zhang, Xiangyang Ji, Huaping Liu', 'link': 'https://arxiv.org/abs/2504.15129', 'abstract': "Deploying robot learning methods to a quadrotor in unstructured outdoor environments is an exciting task. Quadrotors operating in real-world environments by learning-based methods encounter several challenges: a large amount of simulator generated data required for training, strict demands for real-time processing onboard, and the sim-to-real gap caused by dynamic and noisy conditions. Current works have made a great breakthrough in applying learning-based methods to end-to-end control of quadrotors, but rarely mention the infrastructure system training from scratch and deploying to reality, which makes it difficult to reproduce methods and applications. To bridge this gap, we propose a platform that enables the seamless transfer of end-to-end deep reinforcement learning (DRL) policies. We integrate the training environment, flight dynamics control, DRL algorithms, the MAVROS middleware stack, and hardware into a comprehensive workflow and architecture that enables quadrotors' policies to be trained from scratch to real-world deployment in several minutes. Our platform provides rich types of environments including hovering, dynamic obstacle avoidance, trajectory tracking, balloon hitting, and planning in unknown environments, as a physical experiment benchmark. Through extensive empirical validation, we demonstrate the efficiency of proposed sim-to-real platform, and robust outdoor flight performance under real-world perturbations. Details can be found from our website this https URL.", 'abstract_zh': '将基于学习方法的机器人技术应用于未结构化的户外环境四旋翼飞行器是一个令人兴奋的任务。当前的研究在端到端控制四旋翼飞行器方面取得了巨大突破，但在从头训练和部署到现实环境的基础设施系统方面鲜有提及，这使得方法和应用的重现性较差。为了解决这一问题，我们提出了一种平台，能够无缝地转移端到端深度强化学习（DRL）策略。该平台整合了训练环境、飞行动力学控制、DRL算法、MAVROS中间件堆栈和硬件，形成了一个全面的工作流和架构，使得四旋翼飞行器的策略可以在几分钟内从头训练到实际部署。我们的平台提供了包括悬停、动态障碍物回避、轨迹跟踪、击打气球和未知环境规划等多种类型的环境，作为物理实验基准。通过广泛的实证验证，我们证明了所提出的仿真实际平台的高效性以及在实际环境扰动下的稳健户外飞行性能。详情请访问我们的网站：this https URL。', 'title_zh': '一种四旋翼无人机深度增强学习及其现实部署的通用基础设施和工作流'}
{'arxiv_id': 'arXiv:2504.15089', 'title': 'Robust Planning and Control of Omnidirectional MRAVs for Aerial Communications in Wireless Networks', 'authors': 'Giuseppe Silano, Daniel Bonilla Licea, Hajar El Hammouti, Mounir Ghogho, and Martin Saska', 'link': 'https://arxiv.org/abs/2504.15089', 'abstract': 'A new class of Multi-Rotor Aerial Vehicles (MRAVs), known as omnidirectional MRAVs (o-MRAVs), has gained attention for their ability to independently control 3D position and orientation. This capability enhances robust planning and control in aerial communication networks, enabling more adaptive trajectory planning and precise antenna alignment without additional mechanical components. These features are particularly valuable in uncertain environments, where disturbances such as wind and interference affect communication stability. This paper examines o-MRAVs in the context of robust aerial network planning, comparing them with the more common under-actuated MRAVs (u-MRAVs). Key applications, including physical layer security, optical communications, and network densification, are highlighted, demonstrating the potential of o-MRAVs to improve reliability and efficiency in dynamic communication scenarios.', 'abstract_zh': '一种新的全方位多旋翼航空车辆（o-MRAVs）类：在 robust 悬空网络规划中的应用及其优势', 'title_zh': 'omnidirectional MRAVs在无线网络中空中通信的稳健规划与控制'}
{'arxiv_id': 'arXiv:2504.14989', 'title': 'Dynamic Legged Ball Manipulation on Rugged Terrains with Hierarchical Reinforcement Learning', 'authors': 'Dongjie Zhu, Zhuo Yang, Tianhang Wu, Luzhou Ge, Xuesong Li, Qi Liu, Xiang Li', 'link': 'https://arxiv.org/abs/2504.14989', 'abstract': 'Advancing the dynamic loco-manipulation capabilities of quadruped robots in complex terrains is crucial for performing diverse tasks. Specifically, dynamic ball manipulation in rugged environments presents two key challenges. The first is coordinating distinct motion modalities to integrate terrain traversal and ball control seamlessly. The second is overcoming sparse rewards in end-to-end deep reinforcement learning, which impedes efficient policy convergence. To address these challenges, we propose a hierarchical reinforcement learning framework. A high-level policy, informed by proprioceptive data and ball position, adaptively switches between pre-trained low-level skills such as ball dribbling and rough terrain navigation. We further propose Dynamic Skill-Focused Policy Optimization to suppress gradients from inactive skills and enhance critical skill learning. Both simulation and real-world experiments validate that our methods outperform baseline approaches in dynamic ball manipulation across rugged terrains, highlighting its effectiveness in challenging environments. Videos are on our website: this http URL.', 'abstract_zh': '在复杂地形中提升四足机器人动态搬运能力和操作球体的能力对于执行多样化任务至关重要。具体地，险恶环境中的动态球体操纵面临着两个核心挑战。首先，协调不同的运动模式以无缝地整合地形穿越和球体控制。其次，端到端深度强化学习中的稀疏奖励阻碍了高效政策收敛。为应对这些挑战，我们提出了一种分层强化学习框架。高层策略通过 proprioceptive 数据和球体位置信息，适应性地切换到预先训练好的低层技能，如球体运球和崎岖地形导航。我们还提出了一种动态技能集中策略优化方法，以抑制不活跃技能的梯度，并增强关键技能的学习。仿真和实地实验均表明，我们的方法在险恶地形中的动态球体操纵性能优于基准方法，凸显了其在挑战性环境中的有效性。视频详见我们的网站：this http URL。', 'title_zh': '在崎岖地形上基于层次强化学习的动态腿式球操作'}
{'arxiv_id': 'arXiv:2504.14894', 'title': 'Never too Cocky to Cooperate: An FIM and RL-based USV-AUV Collaborative System for Underwater Tasks in Extreme Sea Conditions', 'authors': 'Jingzehua Xu, Guanwen Xie, Jiwei Tang, Yimian Ding, Weiyi Liu, Shuai Zhang, Yi Li', 'link': 'https://arxiv.org/abs/2504.14894', 'abstract': "This paper develops a novel unmanned surface vehicle (USV)-autonomous underwater vehicle (AUV) collaborative system designed to enhance underwater task performance in extreme sea conditions. The system integrates a dual strategy: (1) high-precision multi-AUV localization enabled by Fisher information matrix-optimized USV path planning, and (2) reinforcement learning-based cooperative planning and control method for multi-AUV task execution. Extensive experimental evaluations in the underwater data collection task demonstrate the system's operational feasibility, with quantitative results showing significant performance improvements over baseline methods. The proposed system exhibits robust coordination capabilities between USV and AUVs while maintaining stability in extreme sea conditions. To facilitate reproducibility and community advancement, we provide an open-source simulation toolkit available at: this https URL .", 'abstract_zh': '本文开发了一种新颖的自主水面车辆（USV）-自主水下 vehicle（AUV）协作系统，旨在在极端海况下增强水下任务性能。该系统集成了一种双策略：（1）由Fisher信息矩阵优化的USV路径规划实现的高精度多AUV定位；（2）基于强化学习的多AUV任务执行协作规划与控制方法。在水下数据采集任务中的广泛实验评估证明了该系统的操作可行性，并且定量结果表明与基准方法相比有显著性能改进。所提系统在极端海况下展示了USV与AUV之间的稳健协调能力，同时保持稳定性。为了促进可复制性和社区发展，我们提供了一个开源仿真工具包，可通过以下链接访问： this https URL 。', 'title_zh': '始终保持谦逊的合作：一种基于FIM和RL的USV-AUV协作系统，用于极端海况下的水下任务'}
{'arxiv_id': 'arXiv:2504.14862', 'title': 'FERMI: Flexible Radio Mapping with a Hybrid Propagation Model and Scalable Autonomous Data Collection', 'authors': 'Yiming Luo, Yunfei Wang, Hongming Chen, Chengkai Wu, Ximin Lyu, Jinni Zhou, Jun Ma, Fu Zhang, Boyu Zhou', 'link': 'https://arxiv.org/abs/2504.14862', 'abstract': 'Communication is fundamental for multi-robot collaboration, with accurate radio mapping playing a crucial role in predicting signal strength between robots. However, modeling radio signal propagation in large and occluded environments is challenging due to complex interactions between signals and obstacles. Existing methods face two key limitations: they struggle to predict signal strength for transmitter-receiver pairs not present in the training set, while also requiring extensive manual data collection for modeling, making them impractical for large, obstacle-rich scenarios. To overcome these limitations, we propose FERMI, a flexible radio mapping framework. FERMI combines physics-based modeling of direct signal paths with a neural network to capture environmental interactions with radio signals. This hybrid model learns radio signal propagation more efficiently, requiring only sparse training data. Additionally, FERMI introduces a scalable planning method for autonomous data collection using a multi-robot team. By increasing parallelism in data collection and minimizing robot travel costs between regions, overall data collection efficiency is significantly improved. Experiments in both simulation and real-world scenarios demonstrate that FERMI enables accurate signal prediction and generalizes well to unseen positions in complex environments. It also supports fully autonomous data collection and scales to different team sizes, offering a flexible solution for creating radio maps. Our code is open-sourced at this https URL.', 'abstract_zh': '基于物理学的建模与神经网络结合的灵活无线地图构建框架', 'title_zh': 'FERMI: 灵活的无线电地图构建方法结合混合传播模型和可扩展的自主数据收集'}
{'arxiv_id': 'arXiv:2504.14857', 'title': 'SuFIA-BC: Generating High Quality Demonstration Data for Visuomotor Policy Learning in Surgical Subtasks', 'authors': 'Masoud Moghani, Nigel Nelson, Mohamed Ghanem, Andres Diaz-Pinto, Kush Hari, Mahdi Azizian, Ken Goldberg, Sean Huver, Animesh Garg', 'link': 'https://arxiv.org/abs/2504.14857', 'abstract': 'Behavior cloning facilitates the learning of dexterous manipulation skills, yet the complexity of surgical environments, the difficulty and expense of obtaining patient data, and robot calibration errors present unique challenges for surgical robot learning. We provide an enhanced surgical digital twin with photorealistic human anatomical organs, integrated into a comprehensive simulator designed to generate high-quality synthetic data to solve fundamental tasks in surgical autonomy. We present SuFIA-BC: visual Behavior Cloning policies for Surgical First Interactive Autonomy Assistants. We investigate visual observation spaces including multi-view cameras and 3D visual representations extracted from a single endoscopic camera view. Through systematic evaluation, we find that the diverse set of photorealistic surgical tasks introduced in this work enables a comprehensive evaluation of prospective behavior cloning models for the unique challenges posed by surgical environments. We observe that current state-of-the-art behavior cloning techniques struggle to solve the contact-rich and complex tasks evaluated in this work, regardless of their underlying perception or control architectures. These findings highlight the importance of customizing perception pipelines and control architectures, as well as curating larger-scale synthetic datasets that meet the specific demands of surgical tasks. Project website: this https URL', 'abstract_zh': '行为 cloning 有助于灵巧操作技能的学习，但在手术环境中复杂的任务需求、获取患者数据的难度和成本以及机器人校准误差为手术机器人学习带来了独特挑战。我们提供一种增强的手术数字孪生体，集成具有超高逼真度的人体解剖器官，并结合了一个综合模拟器，以生成高质量的合成数据以解决手术自主性的基本任务。我们提出了 SuFIA-BC：用于手术首次互动自主助理的视觉行为克隆策略。我们研究了包括多视角摄像头和从单个内窥镜相机视角提取的三维视觉表示在内的视觉观察空间。通过系统的评估，我们发现本工作中引入的多样的逼真手术任务能够全面评估行为克隆模型在手术环境中面临的独特挑战。我们观察到，当前最先进的行为克隆技术在解决本研究中评估的接触丰富且复杂的任务时存在困难，不考虑其底层的感知或控制架构。这些发现突显了定制感知管道和控制架构的重要性，以及编目规模更大的满足特定手术任务需求的合成数据集的重要性。项目网站：this https URL', 'title_zh': 'SuFIA-BC：为手术子任务的视运动策略学习生成高质量示范数据'}
{'arxiv_id': 'arXiv:2504.14820', 'title': 'Accelerating Visual Reinforcement Learning with Separate Primitive Policy for Peg-in-Hole Tasks', 'authors': 'Zichun Xu, Zhaomin Wang, Yuntao Li, Lei Zhuang, Zhiyuan Zhao, Guocai Yang, Jingdong Zhao', 'link': 'https://arxiv.org/abs/2504.14820', 'abstract': 'For peg-in-hole tasks, humans rely on binocular visual perception to locate the peg above the hole surface and then proceed with insertion. This paper draws insights from this behavior to enable agents to learn efficient assembly strategies through visual reinforcement learning. Hence, we propose a Separate Primitive Policy (S2P) to simultaneously learn how to derive location and insertion actions. S2P is compatible with model-free reinforcement learning algorithms. Ten insertion tasks featuring different polygons are developed as benchmarks for evaluations. Simulation experiments show that S2P can boost the sample efficiency and success rate even with force constraints. Real-world experiments are also performed to verify the feasibility of S2P. Ablations are finally given to discuss the generalizability of S2P and some factors that affect its performance.', 'abstract_zh': '基于 peg-in-hole 任务，人类依赖双眼视觉感知来定位 peg 上方的孔位，然后进行插入。本文从这一行为中获得灵感，通过视觉强化学习使代理学习高效的装配策略。因此，我们提出了一种分离基础政策（S2P）来同时学习如何获取定位和插入动作。S2P 兼容无模型的强化学习算法。开发了包含不同多边形的十种插入任务作为评估基准。仿真实验表明，即使在力约束下，S2P 也能提高样本效率和成功率。我们也进行了实际实验验证 S2P 的可行性。最后给出了消融实验以讨论 S2P 的泛化能力和影响其性能的一些因素。', 'title_zh': '基于独立基本策略加速视觉强化学习：以孔插针任务为例'}
{'arxiv_id': 'arXiv:2504.14806', 'title': 'An Iterative Task-Driven Framework for Resilient LiDAR Place Recognition in Adverse Weather', 'authors': 'Xiongwei Zhao, Yang Wang, Qihao Sun, Haojie Bai, Xingxiang Xie', 'link': 'https://arxiv.org/abs/2504.14806', 'abstract': "LiDAR place recognition (LPR) plays a vital role in autonomous navigation. However, existing LPR methods struggle to maintain robustness under adverse weather conditions such as rain, snow, and fog, where weather-induced noise and point cloud degradation impair LiDAR reliability and perception accuracy. To tackle these challenges, we propose an Iterative Task-Driven Framework (ITDNet), which integrates a LiDAR Data Restoration (LDR) module and a LiDAR Place Recognition (LPR) module through an iterative learning strategy. These modules are jointly trained end-to-end, with alternating optimization to enhance performance. The core rationale of ITDNet is to leverage the LDR module to recover the corrupted point clouds while preserving structural consistency with clean data, thereby improving LPR accuracy in adverse weather. Simultaneously, the LPR task provides feature pseudo-labels to guide the LDR module's training, aligning it more effectively with the LPR task. To achieve this, we first design a task-driven LPR loss and a reconstruction loss to jointly supervise the optimization of the LDR module. Furthermore, for the LDR module, we propose a Dual-Domain Mixer (DDM) block for frequency-spatial feature fusion and a Semantic-Aware Generator (SAG) block for semantic-guided restoration. In addition, for the LPR module, we introduce a Multi-Frequency Transformer (MFT) block and a Wavelet Pyramid NetVLAD (WPN) block to aggregate multi-scale, robust global descriptors. Finally, extensive experiments on the Weather-KITTI, Boreas, and our proposed Weather-Apollo datasets demonstrate that, demonstrate that ITDNet outperforms existing LPR methods, achieving state-of-the-art performance in adverse weather. The datasets and code will be made publicly available at this https URL.", 'abstract_zh': '基于迭代任务驱动框架的LiDAR位置识别方法研究：应对恶劣天气条件下的鲁棒性挑战', 'title_zh': '一种用于恶劣天气条件下的 resilient LiDAR 地点识别的迭代任务驱动框架'}
{'arxiv_id': 'arXiv:2504.14755', 'title': 'Safe Autonomous Environmental Contact for Soft Robots using Control Barrier Functions', 'authors': 'Akua K. Dickson, Juan C. Pacheco Garcia, Meredith L. Anderson, Ran Jing, Sarah Alizadeh-Shabdiz, Audrey X. Wang, Charles DeLorey, Zach J. Patterson, Andrew P. Sabelhaus', 'link': 'https://arxiv.org/abs/2504.14755', 'abstract': "Robots built from soft materials will inherently apply lower environmental forces than their rigid counterparts, and therefore may be more suitable in sensitive settings with unintended contact. However, these robots' applied forces result from both their design and their control system in closed-loop, and therefore, ensuring bounds on these forces requires controller synthesis for safety as well. This article introduces the first feedback controller for a soft manipulator that formally meets a safety specification with respect to environmental contact. In our proof-of-concept setting, the robot's environment has known geometry and is deformable with a known elastic modulus. Our approach maps a bound on applied forces to a safe set of positions of the robot's tip via predicted deformations of the environment. Then, a quadratic program with Control Barrier Functions in its constraints is used to supervise a nominal feedback signal, verifiably maintaining the robot's tip within this safe set. Hardware experiments on a multi-segment soft pneumatic robot demonstrate that the proposed framework successfully constrains its environmental contact forces. This framework represents a fundamental shift in perspective on control and safety for soft robots, defining and implementing a formally verifiable logic specification on their pose and contact forces.", 'abstract_zh': '软材料构建的机器人相较于刚性机器人会施加更低的环境作用力，因此在可能产生无意接触的敏感环境中可能更为适用。然而，这些机器人施加的作用力来源于其设计及闭环控制系统的控制，因此确保这些作用力的边界需要通过控制器合成来保障安全性。本文引入了首个正式满足环境接触安全性规范的软 manipulator 的反馈控制器。在我们的概念验证设定中，机器人环境具有已知的几何结构，并且具有已知的弹性模量的变形能力。我们的方法将施加力的边界映射到机器人末端安全位置集合，通过预测环境变形实现。然后，通过具有控制约束功能的二次规划来监督名义反馈信号，验证性地保持机器人末端在安全集合内。硬件实验表明，所提出框架成功地约束了其环境接触力。该框架代表了软机器人控制与安全的基本视角转变，定义并实现了一个形式化可验证的姿态与接触力逻辑规范。', 'title_zh': '软体机器人安全自主环境接触控制策略研究'}
{'arxiv_id': 'arXiv:2504.14739', 'title': 'A Modularized Design Approach for GelSight Family of Vision-based Tactile Sensors', 'authors': 'Arpit Agarwal, Mohammad Amin Mirzaee, Xiping Sun, Wenzhen Yuan', 'link': 'https://arxiv.org/abs/2504.14739', 'abstract': "GelSight family of vision-based tactile sensors has proven to be effective for multiple robot perception and manipulation tasks. These sensors are based on an internal optical system and an embedded camera to capture the deformation of the soft sensor surface, inferring the high-resolution geometry of the objects in contact. However, customizing the sensors for different robot hands requires a tedious trial-and-error process to re-design the optical system. In this paper, we formulate the GelSight sensor design process as a systematic and objective-driven design problem and perform the design optimization with a physically accurate optical simulation. The method is based on modularizing and parameterizing the sensor's optical components and designing four generalizable objective functions to evaluate the sensor. We implement the method with an interactive and easy-to-use toolbox called OptiSense Studio. With the toolbox, non-sensor experts can quickly optimize their sensor design in both forward and inverse ways following our predefined modules and steps. We demonstrate our system with four different GelSight sensors by quickly optimizing their initial design in simulation and transferring it to the real sensors.", 'abstract_zh': '基于视觉的GelSight家族触觉传感器在多种机器人感知与操作任务中已被证明非常有效。这些传感器通过内部光学系统和嵌入式摄像头捕捉软传感器表面的变形，推断接触物体的高分辨率几何形状。然而，为不同的机器人手定制传感器需要一个烦琐的试错过程来重新设计光学系统。本文将GelSight传感器设计过程形式化为一个系统化和目标驱动的设计问题，并利用物理精确的光学仿真进行设计优化。该方法基于模块化和参数化传感器的光学组件，并设计了四个通用的目标函数来评估传感器。我们利用一个交互式且易于使用的工具箱OptiSense Studio实现了该方法。借助该工具箱，非传感器专家可以遵循我们预定义的模块和步骤快速从前向和逆向优化其传感器设计。我们通过快速在仿真中优化四种不同GelSight传感器的初始设计并将优化结果应用于真实传感器来演示我们的系统。', 'title_zh': '基于视觉触觉传感器GelSight家族的模块化设计方法'}
{'arxiv_id': 'arXiv:2504.14712', 'title': 'BiDexHand: Design and Evaluation of an Open-Source 16-DoF Biomimetic Dexterous Hand', 'authors': 'Zhengyang Kris Weng', 'link': 'https://arxiv.org/abs/2504.14712', 'abstract': 'Achieving human-level dexterity in robotic hands remains a fundamental challenge for enabling versatile manipulation across diverse applications. This extended abstract presents BiDexHand, a cable-driven biomimetic robotic hand that combines human-like dexterity with accessible and efficient mechanical design. The robotic hand features 16 independently actuated degrees of freedom and 5 mechanically coupled joints through novel phalange designs that replicate natural finger motion. Performance validation demonstrated success across all 33 grasp types in the GRASP Taxonomy, 9 of 11 positions in the Kapandji thumb opposition test, a measured fingertip force of 2.14\\,N, and the capability to lift a 10\\,lb weight. As an open-source platform supporting multiple control modes including vision-based teleoperation, BiDexHand aims to democratize access to advanced manipulation capabilities for the broader robotics research community.', 'abstract_zh': '实现人类级别的灵巧性在机器人手中仍然是跨多种应用实现通用操作的 fundamental 挑战。本扩展摘要介绍 BiDexHand，一种集成了人类灵巧性和可访问高效机械设计的电缆驱动仿生机器人手。该机器人手具备 16 个独立驱动的自由度和 5 个机械耦合关节，通过新颖的指节设计模仿天然手指运动。性能验证显示，其在 GRASP 分类法中的 33 种抓取类型、Kapandji 小指对指测试中的 9 个位置、测得的指尖力量为 2.14 N，以及举起 10 磅重量的能力。作为支持多种控制模式（包括基于视觉的远程操作）的开源平台，BiDexHand 力求为更广泛的机器人研究社区提供高级操作能力的平权访问。', 'title_zh': 'BiDexHand：一种开源16自由度仿生灵巧手的设计与评估'}
{'arxiv_id': 'arXiv:2504.14681', 'title': 'An LLM-enabled Multi-Agent Autonomous Mechatronics Design Framework', 'authors': 'Zeyu Wang, Frank P.-W. Lo, Qian Chen, Yongqi Zhang, Chen Lin, Xu Chen, Zhenhua Yu, Alexander J. Thompson, Eric M. Yeatman, Benny P. L. Lo', 'link': 'https://arxiv.org/abs/2504.14681', 'abstract': 'Existing LLM-enabled multi-agent frameworks are predominantly limited to digital or simulated environments and confined to narrowly focused knowledge domain, constraining their applicability to complex engineering tasks that require the design of physical embodiment, cross-disciplinary integration, and constraint-aware reasoning. This work proposes a multi-agent autonomous mechatronics design framework, integrating expertise across mechanical design, optimization, electronics, and software engineering to autonomously generate functional prototypes with minimal direct human design input. Operating primarily through a language-driven workflow, the framework incorporates structured human feedback to ensure robust performance under real-world constraints. To validate its capabilities, the framework is applied to a real-world challenge involving autonomous water-quality monitoring and sampling, where traditional methods are labor-intensive and ecologically disruptive. Leveraging the proposed system, a fully functional autonomous vessel was developed with optimized propulsion, cost-effective electronics, and advanced control. The design process was carried out by specialized agents, including a high-level planning agent responsible for problem abstraction and dedicated agents for structural, electronics, control, and software development. This approach demonstrates the potential of LLM-based multi-agent systems to automate real-world engineering workflows and reduce reliance on extensive domain expertise.', 'abstract_zh': '现有的基于LLM的多Agent框架主要局限于数字或模拟环境，并且局限于狭隘的知识领域，限制了其在需要设计物理实体、跨学科集成和约束意识推理的复杂工程任务中的应用。本文提出了一种多Agent自主机电设计框架，整合机械设计、优化、电子学和软件工程领域的专业知识，以最少的手动设计输入自主生成功能性原型。该框架主要通过语言驱动的工作流运行，并结合结构化的人机反馈以确保在实际约束下的稳健性能。为验证其能力，该框架应用于一个实际挑战，即自主水质监测和采样，传统方法劳动密集且生态破坏性大。利用所提出的系统，开发了一艘功能完善的自主船只，具有优化推进、经济型电子设备和高级控制。设计过程由专门的Agent执行，包括负责问题抽象的高级规划Agent和专注于结构、电子学、控制和软件开发的专业Agent。该方法展示了基于LLM的多Agent系统在自动化的实际工程工作流中和减少对广泛领域专业知识依赖方面的潜力。', 'title_zh': 'LLM赋能的多agent自主机电设计框架'}
{'arxiv_id': 'arXiv:2504.14680', 'title': 'A Complete and Bounded-Suboptimal Algorithm for a Moving Target Traveling Salesman Problem with Obstacles in 3D', 'authors': 'Anoop Bhat, Geordan Gutow, Bhaskar Vundurthy, Zhongqiang Ren, Sivakumar Rathinam, Howie Choset', 'link': 'https://arxiv.org/abs/2504.14680', 'abstract': "The moving target traveling salesman problem with obstacles (MT-TSP-O) seeks an obstacle-free trajectory for an agent that intercepts a given set of moving targets, each within specified time windows, and returns to the agent's starting position. Each target moves with a constant velocity within its time windows, and the agent has a speed limit no smaller than any target's speed. We present FMC*-TSP, the first complete and bounded-suboptimal algorithm for the MT-TSP-O, and results for an agent whose configuration space is $\\mathbb{R}^3$. Our algorithm interleaves a high-level search and a low-level search, where the high-level search solves a generalized traveling salesman problem with time windows (GTSP-TW) to find a sequence of targets and corresponding time windows for the agent to visit. Given such a sequence, the low-level search then finds an associated agent trajectory. To solve the low-level planning problem, we develop a new algorithm called FMC*, which finds a shortest path on a graph of convex sets (GCS) via implicit graph search and pruning techniques specialized for problems with moving targets. We test FMC*-TSP on 280 problem instances with up to 40 targets and demonstrate its smaller median runtime than a baseline based on prior work.", 'abstract_zh': '带障碍的移动目标旅行商问题（MT-TSP-O）寻求一条无障碍路径，使代理拦截一组在指定时间窗口内移动的目标，并返回代理的起始位置。每个目标在时间窗口内以恒定速度移动，代理的速度限制不低于任何目标的速度。我们提出了第一个完整的且近乎最优的算法FMC*-TSP，该算法适用于配置空间为$\\mathbb{R}^3$的代理，并解决了包含移动目标的一系列规划问题。该算法交替进行高层次搜索和低层次搜索，高层次搜索求解带时间窗口的一般化旅行商问题（GTSP-TW），以找到代理访问的目标序列及其对应的时间窗口。给定这样一个序列，低层次搜索则寻找相应的代理路径。为解决低层次规划问题，我们开发了一种新的算法FMC*，该算法通过特定于移动目标问题的隐式图搜索和修剪技术，在凸集图（GCS）上寻找最短路径。我们对最多包含40个目标的280个问题实例测试了FMC*-TSP，并展示了其中位数运行时间比基于先前工作的基线算法更短。', 'title_zh': '一个完整的且在3D中有障碍物的移动目标旅行商问题的有界次优算法'}
{'arxiv_id': 'arXiv:2504.14634', 'title': 'Latent Representations for Visual Proprioception in Inexpensive Robots', 'authors': 'Sahara Sheikholeslami, Ladislau Bölöni', 'link': 'https://arxiv.org/abs/2504.14634', 'abstract': "Robotic manipulation requires explicit or implicit knowledge of the robot's joint positions. Precise proprioception is standard in high-quality industrial robots but is often unavailable in inexpensive robots operating in unstructured environments. In this paper, we ask: to what extent can a fast, single-pass regression architecture perform visual proprioception from a single external camera image, available even in the simplest manipulation settings? We explore several latent representations, including CNNs, VAEs, ViTs, and bags of uncalibrated fiducial markers, using fine-tuning techniques adapted to the limited data available. We evaluate the achievable accuracy through experiments on an inexpensive 6-DoF robot.", 'abstract_zh': '基于单个外部摄像头图像的快速单次通过回归架构能否实现视觉本体感觉：在简单的操作设置中，这种架构能在多大程度上从单一外部相机图像中进行视觉本体感觉估计？', 'title_zh': '廉价机器人中的视觉本体感受表示'}
{'arxiv_id': 'arXiv:2504.14604', 'title': 'RoboOcc: Enhancing the Geometric and Semantic Scene Understanding for Robots', 'authors': 'Zhang Zhang, Qiang Zhang, Wei Cui, Shuai Shi, Yijie Guo, Gang Han, Wen Zhao, Hengle Ren, Renjing Xu, Jian Tang', 'link': 'https://arxiv.org/abs/2504.14604', 'abstract': "3D occupancy prediction enables the robots to obtain spatial fine-grained geometry and semantics of the surrounding scene, and has become an essential task for embodied perception. Existing methods based on 3D Gaussians instead of dense voxels do not effectively exploit the geometry and opacity properties of Gaussians, which limits the network's estimation of complex environments and also limits the description of the scene by 3D Gaussians. In this paper, we propose a 3D occupancy prediction method which enhances the geometric and semantic scene understanding for robots, dubbed RoboOcc. It utilizes the Opacity-guided Self-Encoder (OSE) to alleviate the semantic ambiguity of overlapping Gaussians and the Geometry-aware Cross-Encoder (GCE) to accomplish the fine-grained geometric modeling of the surrounding scene. We conduct extensive experiments on Occ-ScanNet and EmbodiedOcc-ScanNet datasets, and our RoboOcc achieves state-of the-art performance in both local and global camera settings. Further, in ablation studies of Gaussian parameters, the proposed RoboOcc outperforms the state-of-the-art methods by a large margin of (8.47, 6.27) in IoU and mIoU metric, respectively. The codes will be released soon.", 'abstract_zh': '3D 占有预测使机器人能够获得周围场景的空间精细几何和语义信息，并已成为体现式感知中的一个必备任务。现有的基于 3D 高斯分布而非密集体素的方法未能有效地利用高斯的几何和不透明性特性，这限制了网络对复杂环境的估计能力，也限制了由 3D 高斯分布描述场景的能力。本文提出了一种增强机器人对几何和语义场景理解的 3D 占有预测方法，名为 RoboOcc。它利用不透明度引导自编码器（OSE）减轻重叠高斯的语义不确定性，并利用几何感知交叉编码器（GCE）完成周围场景的精细几何建模。我们在 Occ-ScanNet 和 EmbodiedOcc-ScanNet 数据集上进行了广泛的实验，RoboOcc 在局部和全局摄像机设置中均实现了最佳性能。进一步的高斯参数消融研究中，提出的 RoboOcc 在 IoU 和 mIoU 指标上分别比最先进的方法显著提高了（8.47，6.27）。代码将很快发布。', 'title_zh': 'RoboOcc: 提升机器人对几何与语义场景理解的研究'}
{'arxiv_id': 'arXiv:2504.14602', 'title': 'K2MUSE: A human lower limb multimodal dataset under diverse conditions for facilitating rehabilitation robotics', 'authors': 'Jiwei Li, Bi Zhang, Xiaowei Tan, Wanxin Chen, Zhaoyuan Liu, Juanjuan Zhang, Weiguang Huo, Jian Huang, Lianqing Liu, Xingang Zhao', 'link': 'https://arxiv.org/abs/2504.14602', 'abstract': 'The natural interaction and control performance of lower limb rehabilitation robots are closely linked to biomechanical information from various human locomotion activities. Multidimensional human motion data significantly deepen the understanding of the complex mechanisms governing neuromuscular alterations, thereby facilitating the development and application of rehabilitation robots in multifaceted real-world environments. However, currently available lower limb datasets are inadequate for supplying the essential multimodal data and large-scale gait samples necessary for effective data-driven approaches, and they neglect the significant effects of acquisition interference in real this http URL fill this gap, we present the K2MUSE dataset, which includes a comprehensive collection of multimodal data, comprising kinematic, kinetic, amplitude-mode ultrasound (AUS), and surface electromyography (sEMG) measurements. The proposed dataset includes lower limb multimodal data from 30 able-bodied participants walking under different inclines (0$^\\circ$, $\\pm$5$^\\circ$, and $\\pm$10$^\\circ$), various speeds (0.5 m/s, 1.0 m/s, and 1.5 m/s), and different nonideal acquisition conditions (muscle fatigue, electrode shifts, and inter-day differences). The kinematic and ground reaction force data were collected via a Vicon motion capture system and an instrumented treadmill with embedded force plates, whereas the sEMG and AUS data were synchronously recorded for thirteen muscles on the bilateral lower limbs. This dataset offers a new resource for designing control frameworks for rehabilitation robots and conducting biomechanical analyses of lower limb locomotion. The dataset is available at this https URL.', 'abstract_zh': '下肢康复机器人的人机自然交互与控制性能与多种人体运动活动的生物力学信息密切相关。多维人体运动数据加深了对调控神经肌肉改变复杂机制的理解，进而促进了康复机器人在多种现实环境中的开发与应用。然而，目前可用的下肢数据集无法提供有效数据驱动方法所需的关键多模态数据和大规模步态样本，并且忽略了实际获取干扰的影响。为填补这一空白，我们提出了K2MUSE数据集，该数据集包含全面的多模态数据，包括运动学、动力学、振幅模式超声波（AUS）和表层肌电图（sEMG）测量。拟议的数据集包括30名健康参与者在不同坡度（0°、±5°和±10°）、不同速度（0.5 m/s、1.0 m/s和1.5 m/s）和不同非理想采集条件（肌肉疲劳、电极移位和日间差异）下行走的下肢多模态数据。运动学和地面反作用力数据是通过Vicon运动捕捉系统和内置力板的仪器跑步机收集的，而sEMG和AUS数据则同步记录了双侧下肢的十三块肌肉。该数据集为设计康复机器人控制框架和下肢运动的生物力学分析提供了新的资源。数据集可在以下链接获取：[此链接]。', 'title_zh': 'K2MUSE: 在多样化条件下的人类下肢多模态数据集，用于促进康复机器人技术'}
{'arxiv_id': 'arXiv:2504.14588', 'title': 'Phoenix: A Motion-based Self-Reflection Framework for Fine-grained Robotic Action Correction', 'authors': 'Wenke Xia, Ruoxuan Feng, Dong Wang, Di Hu', 'link': 'https://arxiv.org/abs/2504.14588', 'abstract': "Building a generalizable self-correction system is crucial for robots to recover from failures. Despite advancements in Multimodal Large Language Models (MLLMs) that empower robots with semantic reflection ability for failure, translating semantic reflection into how to correct fine-grained robotic actions remains a significant challenge. To address this gap, we build the Phoenix framework, which leverages motion instruction as a bridge to connect high-level semantic reflection with low-level robotic action correction. In this motion-based self-reflection framework, we start with a dual-process motion adjustment mechanism with MLLMs to translate the semantic reflection into coarse-grained motion instruction adjustment. To leverage this motion instruction for guiding how to correct fine-grained robotic actions, a multi-task motion-conditioned diffusion policy is proposed to integrate visual observations for high-frequency robotic action correction. By combining these two models, we could shift the demand for generalization capability from the low-level manipulation policy to the MLLMs-driven motion adjustment model and facilitate precise, fine-grained robotic action correction. Utilizing this framework, we further develop a lifelong learning method to automatically improve the model's capability from interactions with dynamic environments. The experiments conducted in both the RoboMimic simulation and real-world scenarios prove the superior generalization and robustness of our framework across a variety of manipulation tasks. Our code is released at \\href{this https URL}{this https URL}.", 'abstract_zh': '构建可泛化的自纠错系统对于机器人从故障中恢复至关重要。尽管多模态大型语言模型（MLLMs）的发展赋予了机器人语义反思的能力，将语义反思转化为如何纠正精细的机器人动作仍是一项重大挑战。为解决这一缺口，我们构建了Phoenix框架，该框架利用运动指令作为桥梁，连接高层语义反思与低层机器人动作纠正。在基于运动的自我反思框架中，我们采用了一种基于双过程的运动调整机制，通过MLLMs将语义反思转换为粗粒度的运动指令调整。为了利用这种运动指令指导如何纠正精细的机器人动作，我们提出了一种多任务运动调节扩散策略，结合视觉观察实现高频率的机器人动作纠正。通过结合这两种模型，我们能够将低层操作策略的泛化需求转移到由MLLMs驱动的运动调整模型上，从而促进精确的精细机器人动作纠正。利用该框架，我们进一步开发了一种终身学习方法，自动通过与动态环境的交互提高模型的能力。在RoboMimic模拟和实际场景中的实验证明了该框架在各种操作任务中的优越泛化能力和鲁棒性。我们的代码发布在\\href{this https URL}{this https URL}。', 'title_zh': 'Phoenix：一种基于运动的自反思框架，用于细粒度机器人动作修正'}
{'arxiv_id': 'arXiv:2504.14573', 'title': 'Modality Selection and Skill Segmentation via Cross-Modality Attention', 'authors': 'Jiawei Jiang, Kei Ota, Devesh K. Jha, Asako Kanezaki', 'link': 'https://arxiv.org/abs/2504.14573', 'abstract': 'Incorporating additional sensory modalities such as tactile and audio into foundational robotic models poses significant challenges due to the curse of dimensionality. This work addresses this issue through modality selection. We propose a cross-modality attention (CMA) mechanism to identify and selectively utilize the modalities that are most informative for action generation at each timestep. Furthermore, we extend the application of CMA to segment primitive skills from expert demonstrations and leverage this segmentation to train a hierarchical policy capable of solving long-horizon, contact-rich manipulation tasks.', 'abstract_zh': '将触觉和音频等additional sensory modalities融入基础机器人模型中面临维数灾难问题，本工作通过模态选择来应对这一挑战。我们提出了一种跨模态注意力（CMA）机制，以识别并在每个时间步长中选择性地利用对动作生成最具信息性的模态。此外，我们将CMA的应用扩展到从专家演示中分割基本技能，并利用这种分割训练一种分层策略，以解决长期 horizon、接触丰富的操作任务。', 'title_zh': '跨模态注意力下的模态选择与技能分割'}
{'arxiv_id': 'arXiv:2504.14570', 'title': 'Haptic-based Complementary Filter for Rigid Body Rotations', 'authors': 'Amit Kumar, Domenico Campolo, Ravi N. Banavar', 'link': 'https://arxiv.org/abs/2504.14570', 'abstract': "The non-commutative nature of 3D rotations poses well-known challenges in generalizing planar problems to three-dimensional ones, even more so in contact-rich tasks where haptic information (i.e., forces/torques) is involved. In this sense, not all learning-based algorithms that are currently available generalize to 3D orientation estimation. Non-linear filters defined on $\\mathbf{\\mathbb{SO}(3)}$ are widely used with inertial measurement sensors; however, none of them have been used with haptic measurements. This paper presents a unique complementary filtering framework that interprets the geometric shape of objects in the form of superquadrics, exploits the symmetry of $\\mathbf{\\mathbb{SO}(3)}$, and uses force and vision sensors as measurements to provide an estimate of orientation. The framework's robustness and almost global stability are substantiated by a set of experiments on a dual-arm robotic setup.", 'abstract_zh': '非交换的三维旋转性质给平面问题推广到三维问题带来了已知的挑战，尤其是在涉及触觉信息（即力/力矩）的丰富触觉任务中。因此，并非所有当前可用的基于学习的算法都能推广到三维姿态估计。定义在$\\mathbf{\\mathbb{SO}(3)}$上的非线性滤波器通常与惯性测量传感器结合使用；然而，尚未有研究将此类滤波器与触觉测量结合使用。本文提出了一种独特的互补滤波框架，该框架以超 Quadrics 的几何形状来解释物体的形状，利用 $\\mathbf{\\mathbb{SO}(3)}$ 的对称性，并使用力和视觉传感器作为测量来提供姿态估计。该框架的鲁棒性和几乎全局稳定性通过在双臂机器人平台上的实验得以验证。', 'title_zh': '基于触觉的补充滤波器用于刚体旋转'}
{'arxiv_id': 'arXiv:2504.14495', 'title': 'RadarTrack: Enhancing Ego-Vehicle Speed Estimation with Single-chip mmWave Radar', 'authors': 'Argha Sen, Soham Chakraborty, Soham Tripathy, Sandip Chakraborty', 'link': 'https://arxiv.org/abs/2504.14495', 'abstract': 'In this work, we introduce RadarTrack, an innovative ego-speed estimation framework utilizing a single-chip millimeter-wave (mmWave) radar to deliver robust speed estimation for mobile platforms. Unlike previous methods that depend on cross-modal learning and computationally intensive Deep Neural Networks (DNNs), RadarTrack utilizes a novel phase-based speed estimation approach. This method effectively overcomes the limitations of conventional ego-speed estimation approaches which rely on doppler measurements and static surrondings. RadarTrack is designed for low-latency operation on embedded platforms, making it suitable for real-time applications where speed and efficiency are critical. Our key contributions include the introduction of a novel phase-based speed estimation technique solely based on signal processing and the implementation of a real-time prototype validated through extensive real-world evaluations. By providing a reliable and lightweight solution for ego-speed estimation, RadarTrack holds significant potential for a wide range of applications, including micro-robotics, augmented reality, and autonomous navigation.', 'abstract_zh': 'RadarTrack：一种利用单芯片毫米波雷达的创新自我速度估计框架', 'title_zh': 'RadarTrack: 采用单芯片毫米波雷达提升 ego-车辆速度估计'}
{'arxiv_id': 'arXiv:2504.14478', 'title': 'ApexNav: An Adaptive Exploration Strategy for Zero-Shot Object Navigation with Target-centric Semantic Fusion', 'authors': 'Mingjie Zhang, Yuheng Du, Chengkai Wu, Jinni Zhou, Zhenchao Qi, Jun Ma, Boyu Zhou', 'link': 'https://arxiv.org/abs/2504.14478', 'abstract': 'Navigating unknown environments to find a target object is a significant challenge. While semantic information is crucial for navigation, relying solely on it for decision-making may not always be efficient, especially in environments with weak semantic cues. Additionally, many methods are susceptible to misdetections, especially in environments with visually similar objects. To address these limitations, we propose ApexNav, a zero-shot object navigation framework that is both more efficient and reliable. For efficiency, ApexNav adaptively utilizes semantic information by analyzing its distribution in the environment, guiding exploration through semantic reasoning when cues are strong, and switching to geometry-based exploration when they are weak. For reliability, we propose a target-centric semantic fusion method that preserves long-term memory of the target object and similar objects, reducing false detections and minimizing task failures. We evaluate ApexNav on the HM3Dv1, HM3Dv2, and MP3D datasets, where it outperforms state-of-the-art methods in both SR and SPL metrics. Comprehensive ablation studies further demonstrate the effectiveness of each module. Furthermore, real-world experiments validate the practicality of ApexNav in physical environments. Project page is available at this https URL.', 'abstract_zh': '未知环境下导航寻找目标物体是一项重大挑战。虽然语义信息对于导航至关重要，但仅依赖其进行决策可能并不总是高效的，尤其是在语义线索较弱的环境中。此外，许多方法在视觉上相似的物体环境中容易产生误检测。为解决这些限制，我们提出了ApexNav，这是一种更高效且可靠的零-shot对象导航框架。为了提高效率，ApexNav通过分析环境中的语义信息分布，在语义线索强时通过语义推理引导探索，在语义线索弱时切换到基于几何的探索。为了提高可靠性，我们提出了一种以目标为中心的语义融合方法，保留了目标物体及其相似物体的长时记忆，减少了误检，并最小化任务失败。我们在HM3Dv1、HM3Dv2和MP3D数据集上评估了ApexNav，在SR和SPL指标上均优于现有方法。进一步的消融研究还证明了每个模块的有效性。此外，实地实验验证了ApexNav在物理环境中的实用性。项目页面请参见此链接。', 'title_zh': 'ApexNav：面向目标的自适应探索策略与目标中心语义融合的零样本对象导航'}
{'arxiv_id': 'arXiv:2504.14477', 'title': 'ExFace: Expressive Facial Control for Humanoid Robots with Diffusion Transformers and Bootstrap Training', 'authors': 'Dong Zhang, Jingwei Peng, Yuyang Jiao, Jiayuan Gu, Jingyi Yu, Jiahao Chen', 'link': 'https://arxiv.org/abs/2504.14477', 'abstract': 'This paper presents a novel Expressive Facial Control (ExFace) method based on Diffusion Transformers, which achieves precise mapping from human facial blendshapes to bionic robot motor control. By incorporating an innovative model bootstrap training strategy, our approach not only generates high-quality facial expressions but also significantly improves accuracy and smoothness. Experimental results demonstrate that the proposed method outperforms previous methods in terms of accuracy, frame per second (FPS), and response time. Furthermore, we develop the ExFace dataset driven by human facial data. ExFace shows excellent real-time performance and natural expression rendering in applications such as robot performances and human-robot interactions, offering a new solution for bionic robot interaction.', 'abstract_zh': '基于扩散变换器的新型表情面部控制方法（ExFace）及其应用', 'title_zh': 'ExFace: 表情 facial 控制 for 人形机器人 with 扩散变换器和 Bootstrap 训练'}
{'arxiv_id': 'arXiv:2504.14440', 'title': 'SG-Reg: Generalizable and Efficient Scene Graph Registration', 'authors': 'Chuhao Liu, Zhijian Qiao, Jieqi Shi, Ke Wang, Peize Liu, Shaojie Shen', 'link': 'https://arxiv.org/abs/2504.14440', 'abstract': 'This paper addresses the challenges of registering two rigid semantic scene graphs, an essential capability when an autonomous agent needs to register its map against a remote agent, or against a prior map. The hand-crafted descriptors in classical semantic-aided registration, or the ground-truth annotation reliance in learning-based scene graph registration, impede their application in practical real-world environments. To address the challenges, we design a scene graph network to encode multiple modalities of semantic nodes: open-set semantic feature, local topology with spatial awareness, and shape feature. These modalities are fused to create compact semantic node features. The matching layers then search for correspondences in a coarse-to-fine manner. In the back-end, we employ a robust pose estimator to decide transformation according to the correspondences. We manage to maintain a sparse and hierarchical scene representation. Our approach demands fewer GPU resources and fewer communication bandwidth in multi-agent tasks. Moreover, we design a new data generation approach using vision foundation models and a semantic mapping module to reconstruct semantic scene graphs. It differs significantly from previous works, which rely on ground-truth semantic annotations to generate data. We validate our method in a two-agent SLAM benchmark. It significantly outperforms the hand-crafted baseline in terms of registration success rate. Compared to visual loop closure networks, our method achieves a slightly higher registration recall while requiring only 52 KB of communication bandwidth for each query frame. Code available at: \\href{this http URL}{this http URL}.', 'abstract_zh': '本文解决了两个刚性语义场景图注册的挑战，这是当自主代理需要将其地图与远程代理或先验地图进行注册时所需的基本能力。经典的语义辅助注册中的手工设计描述符，以及基于学习的场景图注册中对地面truth标注的依赖，在实际现实环境中限制了它们的应用。为应对这些挑战，我们设计了一个场景图网络来编码语义节点的多种模态：开放式语义特征、局部拓扑结构以及空间意识和形状特征。这些模态融合生成紧凑的语义节点特征。匹配层随后以粗到细的方式搜索对应关系。在后端，我们采用鲁棒的姿态估计器根据对应关系决定变换。我们能够保持稀疏且分层的场景表示。我们的方法在多代理任务中需要较少的GPU资源和较少的通信带宽。此外，我们设计了一种新的数据生成方法，利用视觉基础模型和语义映射模块重建语义场景图。这种方法与以往依赖地面truth语义标注生成数据的方法显著不同。我们在一个双代理SLAM基准中验证了我们的方法，其在注册成功率方面显著优于手工设计的基线。与视觉环视闭合网络相比，我们的方法在注册召回率上略有提高，同时每次查询帧只需要52 KB的通信带宽。代码可在以下链接获取：[this http URL]。', 'title_zh': 'SG-Reg: 具有普遍适用性和高效性的场景图对齐方法'}
{'arxiv_id': 'arXiv:2504.14376', 'title': 'MILUV: A Multi-UAV Indoor Localization dataset with UWB and Vision', 'authors': 'Mohammed Ayman Shalaby, Syed Shabbir Ahmed, Nicholas Dahdah, Charles Champagne Cossette, Jerome Le Ny, James Richard Forbes', 'link': 'https://arxiv.org/abs/2504.14376', 'abstract': 'This paper introduces MILUV, a Multi-UAV Indoor Localization dataset with UWB and Vision measurements. This dataset comprises 217 minutes of flight time over 36 experiments using three quadcopters, collecting ultra-wideband (UWB) ranging data such as the raw timestamps and channel-impulse response data, vision data from a stereo camera and a bottom-facing monocular camera, inertial measurement unit data, height measurements from a laser rangefinder, magnetometer data, and ground-truth poses from a motion-capture system. The UWB data is collected from up to 12 transceivers affixed to mobile robots and static tripods in both line-of-sight and non-line-of-sight conditions. The UAVs fly at a maximum speed of 4.418 m/s in an indoor environment with visual fiducial markers as features. MILUV is versatile and can be used for a wide range of applications beyond localization, but the primary purpose of MILUV is for testing and validating multi-robot UWB- and vision-based localization algorithms. The dataset can be downloaded at this https URL. A development kit is presented alongside the MILUV dataset, which includes benchmarking algorithms such as visual-inertial odometry, UWB-based localization using an extended Kalman filter, and classification of CIR data using machine learning approaches. The development kit can be found at this https URL, and is supplemented with a website available at this https URL.', 'abstract_zh': 'MILUV：一种基于UWB和视觉的多无人机室内定位数据集', 'title_zh': 'MILUV: 一种基于UWB和视觉的多无人机室内定位数据集'}
{'arxiv_id': 'arXiv:2504.14305', 'title': 'Adversarial Locomotion and Motion Imitation for Humanoid Policy Learning', 'authors': 'Jiyuan Shi, Xinzhe Liu, Dewei Wang, Ouyang Lu, Sören Schwertfeger, Fuchun Sun, Chenjia Bai, Xuelong Li', 'link': 'https://arxiv.org/abs/2504.14305', 'abstract': 'Humans exhibit diverse and expressive whole-body movements. However, attaining human-like whole-body coordination in humanoid robots remains challenging, as conventional approaches that mimic whole-body motions often neglect the distinct roles of upper and lower body. This oversight leads to computationally intensive policy learning and frequently causes robot instability and falls during real-world execution. To address these issues, we propose Adversarial Locomotion and Motion Imitation (ALMI), a novel framework that enables adversarial policy learning between upper and lower body. Specifically, the lower body aims to provide robust locomotion capabilities to follow velocity commands while the upper body tracks various motions. Conversely, the upper-body policy ensures effective motion tracking when the robot executes velocity-based movements. Through iterative updates, these policies achieve coordinated whole-body control, which can be extended to loco-manipulation tasks with teleoperation systems. Extensive experiments demonstrate that our method achieves robust locomotion and precise motion tracking in both simulation and on the full-size Unitree H1 robot. Additionally, we release a large-scale whole-body motion control dataset featuring high-quality episodic trajectories from MuJoCo simulations deployable on real robots. The project page is this https URL.', 'abstract_zh': '人类展示了多样且富有表现力的全身运动。然而，赋予类人机器人类似人类的全身协调性仍然具有挑战性，因为传统的模仿全身运动的方法往往忽视了上下身的 distinct 角色。这种疏忽导致了计算强度大的策略学习，并且经常在实际执行过程中使机器人不稳定并摔倒。为了解决这些问题，我们提出了一种新的框架——对抗性行走与动作模仿（Adversarial Locomotion and Motion Imitation, ALMI），该框架能够在上下身之间进行对抗性策略学习。具体而言，下身旨在提供稳健的行走能力以跟随速度命令，而上身则跟踪各种动作。相反，上身策略确保机器人执行基于速度的动作时能够有效跟踪动作。通过迭代更新，这些策略能够实现协调的全身控制，该控制还可以通过远程操作系统扩展到操作操控任务。大量实验证明，我们的方法在模拟以及全尺寸的Untreed H1机器人上都能够实现稳健的行走和精确的动作跟踪。此外，我们还发布了包含高质量 episodic 轨迹的大规模全身运动控制数据集，这些轨迹来源于 MuJoCo 模拟并在实际机器人上可部署。项目页面详见 this https URL。', 'title_zh': 'adversarial 运动学习与运动模仿的人形机器人策略学习'}
{'arxiv_id': 'arXiv:2504.14259', 'title': 'Experience-based Refinement of Task Planning Knowledge in Autonomous Robots', 'authors': 'Hadeel Jazzaa, Thomas McCluskey, David Peebles', 'link': 'https://arxiv.org/abs/2504.14259', 'abstract': "The requirement for autonomous robots to exhibit higher-level cognitive skills by planning and adapting in an ever-changing environment is indeed a great challenge for the AI community. Progress has been made in the automated planning community on refinement and repair of an agent's symbolic knowledge to do task planning in an incomplete or changing environmental model, but these advances up to now have not been transferred to real physical robots. This paper demonstrates how a physical robot can be capable of adapting its symbolic knowledge of the environment, by using experiences in robot action execution to drive knowledge refinement and hence to improve the success rate of the task plans the robot creates. To implement more robust planning systems, we propose a method for refining domain knowledge to improve the knowledge on which intelligent robot behavior is based. This architecture has been implemented and evaluated using a NAO robot. The refined knowledge leads to the future synthesis of task plans which demonstrate decreasing rates of failure over time as faulty knowledge is removed or adjusted.", 'abstract_zh': '自主机器人在不断变化环境中展现高级认知技能的需求确实是人工智能社区面临的巨大挑战。自动化规划社区在完善和修复代理的符号知识以在不完整的或变化的环境模型中进行任务规划方面取得了进展，但这些进展迄今尚未转移到实际物理机器人中。本文展示了如何通过利用机器人动作执行的经验来驱动知识的完善，从而使物理机器人能够适应其对环境的符号知识，进而提高机器人创建的任务计划的成功率。为了建立更 robust 的规划系统，我们提出了一种方法来细化领域知识以改善基于该知识的智能机器人行为。该架构已在NAO机器人上实现和评估，细化的知识导致未来生成的任务计划在时间上失败率逐渐降低，故障知识被移除或调整。', 'title_zh': '基于经验的任务规划知识精炼在自主机器人中的应用'}
{'arxiv_id': 'arXiv:2504.14170', 'title': 'Collision Induced Binding and Transport of Shape Changing Robot Pairs', 'authors': 'Akash Vardhan, Ram Avinery, Hosain Bagheri, Velin Kojohourav, Shengkai Li, Hridesh Kedia, Tianyu Wang, Daniel Soto, Kurt Wiesenfeld, Daniel I. Goldman', 'link': 'https://arxiv.org/abs/2504.14170', 'abstract': "We report in experiment and simulation the spontaneous formation of dynamically bound pairs of shape changing robots undergoing locally repulsive collisions. These physical `gliders' robustly emerge from an ensemble of individually undulating three-link two-motor robots and can remain bound for hundreds of undulations and travel for multiple robot dimensions. Gliders occur in two distinct binding symmetries and form over a wide range of angular oscillation extent. This parameter sets the maximal concavity which influences formation probability and translation characteristics. Analysis of dynamics in simulation reveals the mechanism of effective dynamical attraction -- a result of the emergent interplay of appropriately oriented and timed repulsive interactions. Tactile sensing stabilizes the short-lived conformation via concavity modulation.", 'abstract_zh': '我们报告了实验和模拟中形状可变机器人在局部排斥碰撞下自发形成的动态结合对的现象。这些物理“滑行器”稳健地从三链双电机独立蜿蜒运动的机器人集群中涌现，并可保持结合数百次蜿蜒运动并行进多个机器人尺寸。滑行器具有两种不同的结合对称性，并可在广泛的角振幅范围内形成。该参数确定了最大凹度，影响形成概率和转换特性。仿真动力学分析揭示了有效的动态吸引力机制——这是适当定向和时间协调的排斥相互作用的涌现效应的结果。触觉感知通过凹度调节来稳定短暂的构型。', 'title_zh': '形状变化的机器人对的碰撞诱导结合与传输'}
{'arxiv_id': 'arXiv:2504.14135', 'title': 'Unreal Robotics Lab: A High-Fidelity Robotics Simulator with Advanced Physics and Rendering', 'authors': 'Jonathan Embley-Riches, Jianwei Liu, Simon Julier, Dimitrios Kanoulas', 'link': 'https://arxiv.org/abs/2504.14135', 'abstract': "High-fidelity simulation is essential for robotics research, enabling safe and efficient testing of perception, control, and navigation algorithms. However, achieving both photorealistic rendering and accurate physics modeling remains a challenge. This paper presents a novel simulation framework--the Unreal Robotics Lab (URL) that integrates the Unreal Engine's advanced rendering capabilities with MuJoCo's high-precision physics simulation. Our approach enables realistic robotic perception while maintaining accurate physical interactions, facilitating benchmarking and dataset generation for vision-based robotics applications. The system supports complex environmental effects, such as smoke, fire, and water dynamics, which are critical for evaluating robotic performance under adverse conditions. We benchmark visual navigation and SLAM methods within our framework, demonstrating its utility for testing real-world robustness in controlled yet diverse scenarios. By bridging the gap between physics accuracy and photorealistic rendering, our framework provides a powerful tool for advancing robotics research and sim-to-real transfer.", 'abstract_zh': '高保真模拟对于机器人研究至关重要，能够实现感知、控制和导航算法的安全和高效测试。然而，同时实现逼真的渲染和准确的物理建模仍然是一个挑战。本文提出了一种新颖的模拟框架——Unreal Robotics Lab (URL)，该框架将Unreal Engine的高级渲染能力与MuJoCo的高精度物理模拟相结合。我们的方法实现了真实的机器人感知，同时保持精确的物理交互，有利于基于视觉的机器人应用的基准测试和数据集生成。该系统支持复杂的环境效果，如烟雾、火灾和水动力学，对于评估机器人在恶劣条件下的性能至关重要。我们在这个框架内基准测试了视觉导航和SLAM方法，展示了其在受控但多样化场景中测试现实世界鲁棒性的用途。通过在物理准确性与逼真渲染之间架起桥梁，我们的框架提供了一个强大的工具，用于推动机器人研究和仿真实践向真实转化。', 'title_zh': '虚实机器人实验室：一种高保真机器人模拟器，具备高级物理和渲染技术'}
{'arxiv_id': 'arXiv:2504.14133', 'title': 'Enhanced UAV Navigation Systems through Sensor Fusion with Trident Quaternions', 'authors': 'Sebastian Incicco, Juan Ignacio Giribet, Leonardo Colombo', 'link': 'https://arxiv.org/abs/2504.14133', 'abstract': 'This paper presents an integrated navigation algorithm based on trident quaternions, an extension of dual quaternions. The proposed methodology provides an efficient approach for achieving precise and robust navigation by leveraging the advantages of trident quaternions. The performance of the navigation system was validated through experimental tests using a multi-rotor UAV equipped with two navigation computers: one executing the proposed algorithm and the other running a commercial autopilot, which was used as a reference.', 'abstract_zh': '基于三叉四元数的综合导航算法研究：扩展双四元数的应用', 'title_zh': '通过三叉四元数的传感器融合增强无人机导航系统'}
{'arxiv_id': 'arXiv:2504.14103', 'title': 'Coordinating Spinal and Limb Dynamics for Enhanced Sprawling Robot Mobility', 'authors': 'Merve Atasever, Ali Okhovat, Azhang Nazaripouya, John Nisbet, Omer Kurkutlu, Jyotirmoy V. Deshmukh, Yasemin Ozkan Aydin', 'link': 'https://arxiv.org/abs/2504.14103', 'abstract': 'Among vertebrates, salamanders, with their unique ability to transition between walking and swimming gaits, highlight the role of spinal mobility in locomotion. A flexible spine enables undulation of the body through a wavelike motion along the spine, aiding navigation over uneven terrains and obstacles. Yet environmental uncertainties, such as surface irregularities and variations in friction, can significantly disrupt body-limb coordination and cause discrepancies between predictions from mathematical models and real-world outcomes. Addressing this challenge requires the development of sophisticated control strategies capable of dynamically adapting to uncertain conditions while maintaining efficient locomotion. Deep reinforcement learning (DRL) offers a promising framework for handling non-deterministic environments and enabling robotic systems to adapt effectively and perform robustly under challenging conditions. In this study, we comparatively examine learning-based control strategies and biologically inspired gait design methods on a salamander-like robot.', 'abstract_zh': '在脊椎动物中，蝾螈通过其独特的在步行和游泳姿态间转换的能力，突显了脊柱运动在运动中的作用。灵活的脊柱通过沿脊柱的波状运动产生身体的波状摆动，有助于在不平地形和障碍物上导航。然而，环境不确定性，如表面不规则性和摩擦力的差异，可以显著破坏身体-肢体协调，导致数学模型预测与实际结果之间存在偏差。解决这一挑战需要发展出能够动态适应不确定性条件并保持高效运动的复杂控制策略。深度强化学习（DRL）为处理非确定性环境并使机器人系统在挑战性条件下有效地适应和稳健运行提供了有希望的框架。在本研究中，我们对基于学习的控制策略和受生物启发的步态设计方法在类似蝾螈的机器人上的效果进行了比较研究。', 'title_zh': '协调脊柱和 limb 动力学以增强 sprawling 机器人移动性'}
{'arxiv_id': 'arXiv:2504.14078', 'title': 'Infrared Vision Systems for Emergency Vehicle Driver Assistance in Low-Visibility Conditions', 'authors': 'M-Mahdi Naddaf-Sh, Andrew Lee, Kin Yen, Eemon Amini, Iman Soltani', 'link': 'https://arxiv.org/abs/2504.14078', 'abstract': 'This study investigates the potential of infrared (IR) camera technology to enhance driver safety for emergency vehicles operating in low-visibility conditions, particularly at night and in dense fog. Such environments significantly increase the risk of collisions, especially for tow trucks and snowplows that must remain operational in challenging conditions. Conventional driver assistance systems often struggle under these conditions due to limited visibility. In contrast, IR cameras, which detect the thermal signatures of obstacles, offer a promising alternative. The evaluation combines controlled laboratory experiments, real-world field tests, and surveys of emergency vehicle operators. In addition to assessing detection performance, the study examines the feasibility of retrofitting existing Department of Transportation (DoT) fleets with cost-effective IR-based driver assistance systems. Results underscore the utility of IR technology in enhancing driver awareness and provide data-driven recommendations for scalable deployment across legacy emergency vehicle fleets.', 'abstract_zh': '本研究探讨红外（IR）相机技术在低能见度条件下，特别是夜间和大雾环境中，增强应急车辆驾驶员安全的潜力。此类环境显著增加了碰撞风险，尤其是对于必须在恶劣条件下保持运行的拖车和除雪车。传统驾驶辅助系统在这些条件下往往由于能见度有限而效果不佳。相比之下，红外相机通过检测障碍物的热特征，提供了一种有前景的替代方案。评估结合了受控实验室实验、实地测试以及对应急车辆操作员的调查。除了评估检测性能外，该研究还检查了将成本效益高的红外基驾驶辅助系统安装到现有交通部（DoT）车队中的可行性。研究结果强调了红外技术在增强驾驶员意识方面的实用性，并提供了针对现有应急车辆车队的可扩展部署的数据驱动建议。', 'title_zh': '低能见度条件下应急车辆驾驶员辅助的红外 vision 系统'}
{'arxiv_id': 'arXiv:2504.14007', 'title': 'Knitting Robots: A Deep Learning Approach for Reverse-Engineering Fabric Patterns', 'authors': 'Haoliang Sheng, Songpu Cai, Xingyu Zheng, Meng Cheng Lau', 'link': 'https://arxiv.org/abs/2504.14007', 'abstract': 'Knitting, a cornerstone of textile manufacturing, is uniquely challenging to automate, particularly in terms of converting fabric designs into precise, machine-readable instructions. This research bridges the gap between textile production and robotic automation by proposing a novel deep learning-based pipeline for reverse knitting to integrate vision-based robotic systems into textile manufacturing. The pipeline employs a two-stage architecture, enabling robots to first identify front labels before inferring complete labels, ensuring accurate, scalable pattern generation. By incorporating diverse yarn structures, including single-yarn (sj) and multi-yarn (mj) patterns, this study demonstrates how our system can adapt to varying material complexities. Critical challenges in robotic textile manipulation, such as label imbalance, underrepresented stitch types, and the need for fine-grained control, are addressed by leveraging specialized deep-learning architectures. This work establishes a foundation for fully automated robotic knitting systems, enabling customizable, flexible production processes that integrate perception, planning, and actuation, thereby advancing textile manufacturing through intelligent robotic automation.', 'abstract_zh': '针织，纺织制造的基石，特别在将织物设计转化为精确的机器可读指令方面极具挑战性。本研究通过提出一种基于深度学习的创新管道，弥补了纺织生产和机器人自动化之间的差距，旨在将基于视觉的机器人系统集成到纺织制造中。该管道采用两阶段架构，使机器人首先识别正面标签，然后推断完整标签，确保准确的、可扩展的图案生成。通过纳入包括单纱 (sj) 和多纱 (mj) 模式在内的各种纱线结构，本研究展示了系统如何适应不同的材料复杂性。通过利用专门的深度学习架构，本文解决了机器人纺织操作中的关键挑战，如标签不平衡、代表性不足的针法类型以及细粒度控制的需求。这项工作为全自动机器人针织系统奠定了基础，使其能够实现可定制的、灵活的生产过程，整合感知、规划和执行，从而通过智能机器人自动化推动纺织制造的发展。', 'title_zh': '织布机器人：一种用于逆向工程织物图案的深度学习方法'}
{'arxiv_id': 'arXiv:2504.15278', 'title': 'DRAWER: Digital Reconstruction and Articulation With Environment Realism', 'authors': 'Hongchi Xia, Entong Su, Marius Memmel, Arhan Jain, Raymond Yu, Numfor Mbiziwo-Tiapo, Ali Farhadi, Abhishek Gupta, Shenlong Wang, Wei-Chiu Ma', 'link': 'https://arxiv.org/abs/2504.15278', 'abstract': 'Creating virtual digital replicas from real-world data unlocks significant potential across domains like gaming and robotics. In this paper, we present DRAWER, a novel framework that converts a video of a static indoor scene into a photorealistic and interactive digital environment. Our approach centers on two main contributions: (i) a reconstruction module based on a dual scene representation that reconstructs the scene with fine-grained geometric details, and (ii) an articulation module that identifies articulation types and hinge positions, reconstructs simulatable shapes and appearances and integrates them into the scene. The resulting virtual environment is photorealistic, interactive, and runs in real time, with compatibility for game engines and robotic simulation platforms. We demonstrate the potential of DRAWER by using it to automatically create an interactive game in Unreal Engine and to enable real-to-sim-to-real transfer for robotics applications.', 'abstract_zh': '从现实世界数据创建虚拟数字复制品在游戏和机器人等领域展现出巨大潜力。本文提出DRAWER框架，该框架能够将静态室内场景视频转换为照片级真实且可交互的数字环境。我们的方法主要贡献包括：（i）基于双场景表示的重建模块，能够精细重建几何细节；（ii）关节模块，用于识别关节类型和绞点位置，重构可模拟的形状和外观，并将其整合到场景中。所生成的虚拟环境具有照片级真实感、交互性，并可实时运行，兼容游戏引擎和机器人仿真平台。我们通过在Unreal Engine中自动生成互动游戏以及支持从真实到模拟再到真实的机器人应用转移，展示了DRAWER的潜力。', 'title_zh': 'DRAWER: 数字重建与环境真实感articulation'}
{'arxiv_id': 'arXiv:2504.14805', 'title': 'Dynamic Contrastive Skill Learning with State-Transition Based Skill Clustering and Dynamic Length Adjustment', 'authors': 'Jinwoo Choi, Seung-Woo Seo', 'link': 'https://arxiv.org/abs/2504.14805', 'abstract': 'Reinforcement learning (RL) has made significant progress in various domains, but scaling it to long-horizon tasks with complex decision-making remains challenging. Skill learning attempts to address this by abstracting actions into higher-level behaviors. However, current approaches often fail to recognize semantically similar behaviors as the same skill and use fixed skill lengths, limiting flexibility and generalization. To address this, we propose Dynamic Contrastive Skill Learning (DCSL), a novel framework that redefines skill representation and learning. DCSL introduces three key ideas: state-transition based skill representation, skill similarity function learning, and dynamic skill length adjustment. By focusing on state transitions and leveraging contrastive learning, DCSL effectively captures the semantic context of behaviors and adapts skill lengths to match the appropriate temporal extent of behaviors. Our approach enables more flexible and adaptive skill extraction, particularly in complex or noisy datasets, and demonstrates competitive performance compared to existing methods in task completion and efficiency.', 'abstract_zh': '动态对比技能学习（DCSL）：一种新的技能表示和学习框架', 'title_zh': '基于状态转换的技能聚类与动态长度调整的动态对比技能学习'}
{'arxiv_id': 'arXiv:2504.14562', 'title': 'Going Down the Abstraction Stream with Augmented Reality and Tangible Robots: the Case of Vector Instruction', 'authors': 'Sergei Volodin, Hala Khodr, Pierre Dillenbourg, Wafa Johal', 'link': 'https://arxiv.org/abs/2504.14562', 'abstract': 'Despite being used in many engineering and scientific areas such as physics and mathematics and often taught in high school, graphical vector addition turns out to be a topic prone to misconceptions in understanding even at university-level physics classes. To improve the learning experience and the resulting understanding of vectors, we propose to investigate how concreteness fading implemented with the use of augmented reality and tangible robots could help learners to build a strong representation of vector addition.\nWe design a gamified learning environment consisting of three concreteness fading stages and conduct an experiment with 30 participants. Our results shows a positive learning gain. We analyze extensively the behavior of the participants to understand the usage of the technological tools -- augmented reality and tangible robots -- during the learning scenario. Finally, we discuss how the combination of these tools shows real advantages in implementing the concreteness fading paradigm. Our work provides empirical insights into how users utilize concrete visualizations conveyed by a haptic-enabled robot and augmented reality in a learning scenario.', 'abstract_zh': '尽管图形向量加法在物理和数学等领域及高中课程中被广泛应用，但在大学物理课程中仍容易引起误解。为了提高学习体验和对向量的理解，我们提出了一种基于增强现实和实体机器人实现的具体性淡入方法，以帮助学习者建立坚实的向量加法表征。\n\n我们设计了一种包含三个具体性淡入阶段的游戏化学习环境，并进行了30名参与者的实验。结果显示正向学习收益。我们对参与者的行为进行了详细分析，以了解在学习情境中使用增强现实和实体机器人的技术工具的使用情况。最后，我们讨论了这些工具组合如何在实现具体性淡入范式方面展现出真正的优势。我们的研究提供了一种基于触觉机器人和增强现实的具体视觉化应用的用户使用情况的经验性见解。', 'title_zh': '沿着抽象化的溪流前行：基于增强现实和可感知机器人的情感指令案例研究'}
{'arxiv_id': 'arXiv:2504.14556', 'title': 'LLM-Enabled In-Context Learning for Data Collection Scheduling in UAV-assisted Sensor Networks', 'authors': 'Yousef Emami, Hao Gao, SeyedSina Nabavirazani, Luis Almeida', 'link': 'https://arxiv.org/abs/2504.14556', 'abstract': 'Unmanned Aerial Vehicles (UAVs) are increasingly being used in various private and commercial applications, e.g. traffic control, package delivery, and Search and Rescue (SAR) operations. Machine Learning (ML) methods used in UAV-assisted Sensor Networks (UASNETs) and especially in Deep Reinforcement Learning (DRL) face challenges such as complex and lengthy model training, gaps between simulation and reality, and low sample efficiency, which conflict with the urgency of emergencies such as SAR operations. This paper proposes In-Context Learning (ICL)-based Data Collection Scheduling (ICLDC) scheme, as an alternative to DRL in emergencies. The UAV collects and transmits logged sensory data, to an LLM, to generate a task description in natural language, from which it obtains a data collection schedule to be executed by the UAV. The system continuously adapts by adding feedback to task descriptions and utilizing feedback for future decisions. This method is tested against jailbreaking attacks, where task description is manipulated to undermine network performance, highlighting the vulnerability of LLMs to such attacks. The proposed ICLDC outperforms the Maximum Channel Gain by reducing cumulative packet loss by approximately 56\\%. ICLDC presents a promising direction for intelligent scheduling and control in UAV-assisted data collection.', 'abstract_zh': '无人驾驶飞行器（UAVs）在各种私人和商业应用中越来越广泛使用，例如交通管理、包裹配送和搜救（SAR）操作。辅助传感器网络（UASNETs）及特别是深度强化学习（DRL）中使用的机器学习（ML）方法面临着模型训练复杂且耗时、仿真与现实之间的差距以及样本效率低等挑战，这些挑战与紧急情况如搜救操作的紧迫性相冲突。本文提出了一种基于上下文学习（ICL）的数据收集调度（ICLDC）方案，作为紧急情况下的DRL的替代方案。UAV收集和传输记录的传感器数据到LLM，生成自然语言的任务描述，从中获得由UAV执行的数据收集调度。系统通过不断添加反馈更新任务描述，并利用反馈进行未来的决策。该方法在针对恶意破解攻击进行了测试，攻击通过操纵任务描述来破坏网络性能，突显了LLMs对这种攻击的脆弱性。所提出的ICLDC通过将累积数据包丢失减少了大约56%而超过最大信道增益，ICLDC为UAV辅助数据收集中的智能调度和控制提供了有前景的方向。', 'title_zh': '基于LLM的上下文学习在UAV辅助传感器网络中的数据采集调度'}
{'arxiv_id': 'arXiv:2504.14330', 'title': 'DLW-CI: A Dynamic Likelihood-Weighted Cooperative Infotaxis Approach for Multi-Source Search in Urban Environments Using Consumer Drone Networks', 'authors': 'Xiaoran Zhang, Yatai Ji, Yong Zhao, Chuan Ai, Bin Chen, Zhengqiu Zhu', 'link': 'https://arxiv.org/abs/2504.14330', 'abstract': 'Consumer-grade drones equipped with low-cost sensors have emerged as a cornerstone of Autonomous Intelligent Systems (AISs) for environmental monitoring and hazardous substance detection in urban environments. However, existing research primarily addresses single-source search problems, overlooking the complexities of real-world urban scenarios where both the location and quantity of hazardous sources remain unknown. To address this issue, we propose the Dynamic Likelihood-Weighted Cooperative Infotaxis (DLW-CI) approach for consumer drone networks. Our approach enhances multi-drone collaboration in AISs by combining infotaxis (a cognitive search strategy) with optimized source term estimation and an innovative cooperative mechanism. Specifically, we introduce a novel source term estimation method that utilizes multiple parallel particle filters, with each filter dedicated to estimating the parameters of a potentially unknown source within the search scene. Furthermore, we develop a cooperative mechanism based on dynamic likelihood weights to prevent multiple drones from simultaneously estimating and searching for the same source, thus optimizing the energy efficiency and search coverage of the consumer AIS. Experimental results demonstrate that the DLW-CI approach significantly outperforms baseline methods regarding success rate, accuracy, and root mean square error, particularly in scenarios with relatively few sources, regardless of the presence of obstacles. Also, the effectiveness of the proposed approach is verified in a diffusion scenario generated by the computational fluid dynamics (CFD) model. Research findings indicate that our approach could improve source estimation accuracy and search efficiency by consumer drone-based AISs, making a valuable contribution to environmental safety monitoring applications within smart city infrastructure.', 'abstract_zh': '消费者级无人机装备低成本传感器已成为自主智能系统（AISs）在城市环境中的环境监测和危险物质检测的基础。然而，现有研究主要针对单源搜索问题，忽视了真实城市场景中危险源位置和数量未知的复杂性。为了解决这一问题，我们提出了一种动态概率加权合作感知策略（DLW-CI）方法，用于消费者无人机网络。该方法通过结合感知策略（一种认知搜索策略）、优化的目标项估计和创新的合作机制，增强了多无人机在AISs中的合作。具体来说，我们引入了一种新的目标项估计方法，利用多个并行粒子滤波器，每个滤波器专门用于估计搜索场景中潜在未知目标的参数。此外，我们开发了一种基于动态概率加权的合作机制，以防止多架无人机同时估计和搜索相同的源，从而优化消费者AIS的能量效率和搜索覆盖范围。实验结果表明，DLW-CI方法在成功率、准确性和均方根误差方面显著优于基准方法，特别是在危险源较少的场景中，无论是否存在障碍物。此外，通过计算流体动力学（CFD）模型生成的扩散场景验证了所提出方法的有效性。研究结果表明，我们的方法可以提高基于消费者无人机的AIS对源的估计精度和搜索效率，为智能城市基础设施中的环境安全监测应用做出重要贡献。', 'title_zh': 'DLW-CI：一种基于动态似然加权合作信息趋化策略的多源城市环境搜索方法用于消费者无人机网络'}
{'arxiv_id': 'arXiv:2504.14241', 'title': 'A Knowledge-Informed Deep Learning Paradigm for Generalizable and Stability-Optimized Car-Following Models', 'authors': 'Chengming Wang, Dongyao Jia, Wei Wang, Dong Ngoduy, Bei Peng, Jianping Wang', 'link': 'https://arxiv.org/abs/2504.14241', 'abstract': "Car-following models (CFMs) are fundamental to traffic flow analysis and autonomous driving. Although calibrated physics-based and trained data-driven CFMs can replicate human driving behavior, their reliance on specific datasets limits generalization across diverse scenarios and reduces reliability in real-world deployment. Moreover, these models typically focus on behavioral fidelity and do not support the explicit optimization of local and string stability, which are increasingly important for the safe and efficient operation of autonomous vehicles (AVs). To address these limitations, we propose a Knowledge-Informed Deep Learning (KIDL) paradigm that distills the generalization capabilities of pre-trained Large Language Models (LLMs) into a lightweight and stability-aware neural architecture. LLMs are used to extract fundamental car-following knowledge beyond dataset-specific patterns, and this knowledge is transferred to a reliable, tractable, and computationally efficient model through knowledge distillation. KIDL also incorporates stability constraints directly into its training objective, ensuring that the resulting model not only emulates human-like behavior but also satisfies the local and string stability requirements essential for real-world AV deployment. We evaluate KIDL on the real-world NGSIM and HighD datasets, comparing its performance with representative physics-based, data-driven, and hybrid CFMs. Both empirical and theoretical results consistently demonstrate KIDL's superior behavioral generalization and traffic flow stability, offering a robust and scalable solution for next-generation traffic systems.", 'abstract_zh': '基于知识告知的深度学习（KIDL）框架：提高自动驾驶车辆的跟车行为泛化与交通流稳定性', 'title_zh': '基于知识导向的深度学习范式用于可泛化和稳定性优化的跟随车模型'}
{'arxiv_id': 'arXiv:2504.14151', 'title': 'Locate 3D: Real-World Object Localization via Self-Supervised Learning in 3D', 'authors': 'Sergio Arnaud, Paul McVay, Ada Martin, Arjun Majumdar, Krishna Murthy Jatavallabhula, Phillip Thomas, Ruslan Partsey, Daniel Dugas, Abha Gejji, Alexander Sax, Vincent-Pierre Berges, Mikael Henaff, Ayush Jain, Ang Cao, Ishita Prasad, Mrinal Kalakrishnan, Michael Rabbat, Nicolas Ballas, Mido Assran, Oleksandr Maksymets, Aravind Rajeswaran, Franziska Meier', 'link': 'https://arxiv.org/abs/2504.14151', 'abstract': 'We present LOCATE 3D, a model for localizing objects in 3D scenes from referring expressions like "the small coffee table between the sofa and the lamp." LOCATE 3D sets a new state-of-the-art on standard referential grounding benchmarks and showcases robust generalization capabilities. Notably, LOCATE 3D operates directly on sensor observation streams (posed RGB-D frames), enabling real-world deployment on robots and AR devices. Key to our approach is 3D-JEPA, a novel self-supervised learning (SSL) algorithm applicable to sensor point clouds. It takes as input a 3D pointcloud featurized using 2D foundation models (CLIP, DINO). Subsequently, masked prediction in latent space is employed as a pretext task to aid the self-supervised learning of contextualized pointcloud features. Once trained, the 3D-JEPA encoder is finetuned alongside a language-conditioned decoder to jointly predict 3D masks and bounding boxes. Additionally, we introduce LOCATE 3D DATASET, a new dataset for 3D referential grounding, spanning multiple capture setups with over 130K annotations. This enables a systematic study of generalization capabilities as well as a stronger model.', 'abstract_zh': 'LOCATE 3D：从引用表达式在3D场景中定位物体的模型及其最新进展和应用', 'title_zh': '位于3D：通过三维自我监督学习进行真实世界对象定位'}
{'arxiv_id': 'arXiv:2504.13964', 'title': 'Designing Empathetic Companions: Exploring Personality, Emotion, and Trust in Social Robots', 'authors': 'Alice Nardelli, Antonio Sgorbissa, Carmine Tommaso Recchiuto', 'link': 'https://arxiv.org/abs/2504.13964', 'abstract': 'How should a companion robot behave? In this research, we present a cognitive architecture based on a tailored personality model to investigate the impact of robotic personalities on the perception of companion robots. Drawing from existing literature, we identified empathy, trust, and enjoyability as key factors in building companionship with social robots. Based on these insights, we implemented a personality-dependent, emotion-aware generator, recognizing the crucial role of robot emotions in shaping these elements. We then conducted a user study involving 84 dyadic conversation sessions with the emotional robot Navel, which exhibited different personalities. Results were derived from a multimodal analysis, including questionnaires, open-ended responses, and behavioral observations. This approach allowed us to validate the developed emotion generator and explore the relationship between the personality traits of Agreeableness, Extraversion, Conscientiousness, and Empathy. Furthermore, we drew robust conclusions on how these traits influence relational trust, capability trust, enjoyability, and sociability.', 'abstract_zh': '同伴机器人应该如何行为？本研究基于定制的人格模型提出一种认知架构，以探究机器人人格对其同伴机器人感知的影响。借鉴现有文献，我们确定了共情、信任和愉悦性是建立与社会机器人同伴关系的关键因素。基于这些见解，我们实现了一个依赖于人格、具有情绪意识的生成器，认识到机器人情绪在塑造这些因素方面的重要性。随后，我们进行了用户研究，涉及84场双人对话会话，其中情感机器人Navel表现出不同的个性。结果通过多模态分析得出，包括问卷调查、开放式回答和行为观察。该方法使我们能够验证开发的情绪生成器，并探索性情特质（如随和性、外向性、尽责性和共情）与关系信任、能力信任、愉悦性和社交性之间的关系。此外，我们得出了关于这些特质如何影响关系信任、能力信任、愉悦性和社交性的稳健结论。', 'title_zh': '设计共情伴侣机器人：探索社交机器人的个性、情感与信任'}
{'arxiv_id': 'arXiv:2504.13916', 'title': 'Task Matters: Investigating Human Questioning Behavior in Different Household Service for Learning by Asking Robots', 'authors': 'Yuanda Hu, Hou Jiani, Zhang Junyu, Yate Ge, Xiaohua Sun, Weiwei Guo', 'link': 'https://arxiv.org/abs/2504.13916', 'abstract': 'Learning by Asking (LBA) enables robots to identify knowledge gaps during task execution and acquire the missing information by asking targeted questions. However, different tasks often require different types of questions, and how to adapt questioning strategies accordingly remains underexplored. This paper investigates human questioning behavior in two representative household service tasks: a Goal-Oriented task (refrigerator organization) and a Process-Oriented task (cocktail mixing). Through a human-human study involving 28 participants, we analyze the questions asked using a structured framework that encodes each question along three dimensions: acquired knowledge, cognitive process, and question form. Our results reveal that participants adapt both question types and their temporal ordering based on task structure. Goal-Oriented tasks elicited early inquiries about user preferences, while Process-Oriented tasks led to ongoing, parallel questioning of procedural steps and preferences. These findings offer actionable insights for developing task-sensitive questioning strategies in LBA-enabled robots for more effective and personalized human-robot collaboration.', 'abstract_zh': '学习提问（LBA）使机器人能够在执行任务时识别知识缺口，并通过提出针对性的问题来获取缺失的信息。然而，不同任务往往需要不同类型的问题，如何相应地调整提问策略仍待探索。本文在两个代表性家庭服务任务中研究了人类的提问行为：目标导向任务（冰箱整理）和过程导向任务（调制鸡尾酒）。通过涉及28名参与者的实验研究，我们使用结构化的框架来分析每个问题在三个维度上的编码：获取的知识、认知过程和问题形式。研究结果表明，参与者根据任务结构调整了提问类型及其时间顺序。目标导向任务引发了关于用户偏好的早期询问，而过程导向任务则导致了关于程序步骤和偏好的持续并行提问。这些发现为在LBA使能的机器人中开发更有效和个性化的任务敏感提问策略提供了可操作的见解。', 'title_zh': '任务不同，提问行为有异：探究不同家庭服务任务中机器人学习中的提问行为'}
{'arxiv_id': 'arXiv:2504.13906', 'title': 'V2P Collision Warnings for Distracted Pedestrians: A Comparative Study with Traditional Auditory Alerts', 'authors': 'Novel Certad, Enrico Del Re, Joshua Varughese, Cristina Olaverri-Monreal', 'link': 'https://arxiv.org/abs/2504.13906', 'abstract': 'This study assesses a Vehicle-to-Pedestrian (V2P) collision warning system compared to conventional vehicle-issued auditory alerts in a real-world scenario simulating a vehicle on a fixed track, characterized by limited maneuverability and the need for timely pedestrian response. The results from analyzing speed variations show that V2P warnings are particularly effective for pedestrians distracted by phone use (gaming or listening to music), highlighting the limitations of auditory alerts in noisy environments. The findings suggest that V2P technology offers a promising approach to improving pedestrian safety in urban areas', 'abstract_zh': '本研究评估了一种Vehicle-to-Pedestrian（V2P）碰撞预警系统在实际场景中的效果，该场景模拟了车辆在固定轨道上行驶的情况，具有有限的机动性和及时行人响应的需求。分析速度变化的结果表明，V2P警告特别适用于分散了注意力的手机使用者（如玩游戏或听音乐），突显了噪音环境中听觉警报的局限性。研究发现，V2P技术为改善城市区域的行人安全提供了有前景的方法。', 'title_zh': '面向分心行人的V2P碰撞警告：与传统听觉警报的比较研究'}
{'arxiv_id': 'arXiv:2504.13881', 'title': 'Exploring the Use of Social Robots to Prepare Children for Radiological Procedures: A Focus Group Study', 'authors': 'Massimiliano Nigro, Andrea Righini, Micol Spitale', 'link': 'https://arxiv.org/abs/2504.13881', 'abstract': "When children are anxious or scared, it can be hard for them to stay still or follow instructions during medical procedures, making the process more challenging and affecting procedure results. This is particularly true for radiological procedures, where long scan times, confined spaces, and loud noises can cause children to move, significantly impacting scan quality. To this end, sometimes children are sedated, but doctors are constantly seeking alternative non-pharmacological solutions. This work aims to explore how social robots could assist in preparing children for radiological procedures. We have conducted a focus group discussion with five hospital stakeholders, namely radiographers, paediatricians, and clinical engineers, to explore (i) the context regarding children's preparation for radiological procedures, hence their needs and how children are currently prepared, and (ii) the potential role of social robots in this process. The discussion was transcribed and analysed using thematic analysis. Among our findings, we identified three potential roles for a social robot in this preparation process: offering infotainment in the waiting room, acting as a guide within the hospital, and assisting radiographers in preparing children for the procedure. We hope that insights from this study will inform the design of social robots for pediatric healthcare.", 'abstract_zh': '当儿童焦虑或害怕时，在医疗程序中保持静止或遵循指示会变得困难，这会使得过程更加具有挑战性，并影响程序的结果。特别是在放射学程序中，长时间的扫描、狭小的空间以及嘈杂的声音会促使儿童移动，显著影响扫描质量。为此，有时会使用镇静剂，但医生们一直在寻求非药物的替代解决方案。本研究旨在探索社会机器人如何帮助儿童为放射学程序做准备。我们与五名医疗机构的利益相关者——放射技师、儿科医生和临床工程师——进行了焦点小组讨论，探讨了（i）有关儿童准备放射学程序的背景，包括他们的需求以及目前的准备方式；（ii）社会机器人在这一过程中的潜在作用。讨论内容被转录并使用主题分析方法进行了分析。我们的研究发现中，我们确定了社会机器人在这一准备过程中的三种潜在角色：在候诊室提供娱乐资讯，充当医院内的引导者，以及协助放射技师为儿童准备程序。我们希望通过本研究获得的见解来指导社会机器人在儿科医疗中的设计。', 'title_zh': '探索社交机器人在准备儿童进行放射学检查中的应用：一组焦点小组研究'}
{'arxiv_id': 'arXiv:2504.13872', 'title': 'Manifesting Architectural Subspaces with Two Mobile Robotic Partitions to Facilitate Spontaneous Office Meetings', 'authors': 'Ozan Balci, Stien Poncelet, Alex Binh Vinh Duc Nguyen, Andrew Vande Moere', 'link': 'https://arxiv.org/abs/2504.13872', 'abstract': "Although intended to foster spontaneous interactions among workers, a typical open-plan office layout cannot mitigate visual, acoustic, or privacy-related distractions that originate from unplanned meetings. As office workers often refrain from tackling these issues by manually demarcating or physically relocating to a more suitable subspace that is enclosed by movable partitions, we hypothesise that these subspaces could instead be robotically manifested. This study therefore evaluated the perceived impact of two mobile robotic partitions that were wizarded to jointly manifest an enclosed subspace, to: 1) either `mitigate' or `intervene' in the distractions caused by spontaneous face-to-face or remote meetings; or 2) either `gesturally' or `spatially' nudge a distraction-causing worker to relocate. Our findings suggest how robotic furniture should interact with office workers with and through transient space, and autonomously balance the distractions not only for each individual worker but also for multiple workers sharing the same workspace.", 'abstract_zh': "Although intended to foster spontaneous interactions among workers, a typical open-plan office layout cannot mitigate visual, acoustic, or privacy-related distractions that originate from unplanned meetings. As office workers often refrain from tackling these issues by manually demarcating or physically relocating to a more suitable subspace that is enclosed by movable partitions, we hypothesise that these subspaces could instead be robotically manifested. This study therefore evaluated the perceived impact of two mobile robotic partitions that were wizarded to jointly manifest an enclosed subspace, to: 1) either `mitigate' or `intervene' in the distractions caused by spontaneous face-to-face or remote meetings; or 2) either `gesturally' or `spatially' nudge a distraction-causing worker to relocate. Our findings suggest how robotic furniture should interact with office workers with and through transient space, and autonomously balance the distractions not only for each individual worker but also for multiple workers sharing the same workspace.\n\n一种典型开放式办公室布局原本旨在促进员工之间的自发互动，但却无法减轻由非计划会议引起的视觉、声学或隐私相关干扰。鉴于办公室员工通常不会通过手动划分或物理转移至由可移动隔板包围的更合适的子空间来解决这些问题，我们假设这些子空间可以通过机器人方式呈现。本研究因此评估了通过两名巫师引导的两个移动机器人隔板联合呈现封闭子空间所产生的感知影响：1）要么减轻，要么干预由自发面对面或远程会议引起的干扰；2）要么通过手势，要么通过空间引导引起干扰的员工重新定位。我们的发现表明，机器人家具应如何与办公员工及其暂时空间进行互动，并自主平衡不仅对每个个体员工，而且对共享同一工作空间的多个员工所造成的干扰。", 'title_zh': '使用两个移动机器人分区展现建筑子空间，以促进自发办公室会议'}
{'arxiv_id': 'arXiv:2504.13866', 'title': 'Skeleton-Based Transformer for Classification of Errors and Better Feedback in Low Back Pain Physical Rehabilitation Exercises', 'authors': 'Aleksa Marusic, Sao Mai Nguyen, Adriana Tapus', 'link': 'https://arxiv.org/abs/2504.13866', 'abstract': "Physical rehabilitation exercises suggested by healthcare professionals can help recovery from various musculoskeletal disorders and prevent re-injury. However, patients' engagement tends to decrease over time without direct supervision, which is why there is a need for an automated monitoring system. In recent years, there has been great progress in quality assessment of physical rehabilitation exercises. Most of them only provide a binary classification if the performance is correct or incorrect, and a few provide a continuous score. This information is not sufficient for patients to improve their performance. In this work, we propose an algorithm for error classification of rehabilitation exercises, thus making the first step toward more detailed feedback to patients. We focus on skeleton-based exercise assessment, which utilizes human pose estimation to evaluate motion. Inspired by recent algorithms for quality assessment during rehabilitation exercises, we propose a Transformer-based model for the described classification. Our model is inspired by the HyperFormer method for human action recognition, and adapted to our problem and dataset. The evaluation is done on the KERAAL dataset, as it is the only medical dataset with clear error labels for the exercises, and our model significantly surpasses state-of-the-art methods. Furthermore, we bridge the gap towards better feedback to the patients by presenting a way to calculate the importance of joints for each exercise.", 'abstract_zh': '由医疗专业人员建议的物理康复锻炼可以帮助各种肌骨紊乱的恢复并防止再次受伤。但是，在没有直接监督的情况下，患者参与度往往会随时间降低，因此需要一个自动监控系统。近年来，在物理康复锻炼的质量评估方面取得了很大的进步。大多数方法仅提供正确的或错误的二分类结果，少数提供连续评分。这些信息对于患者提高其表现来说并不足够。在这项工作中，我们提出了一个康复锻炼错误分类的算法，从而为患者提供更详细的反馈迈出了第一步。我们专注于基于骨架的动作评估，利用人体姿态估计来评估运动。受康复锻炼质量评估算法的启发，我们提出了一种基于Transformer的模型来进行所述分类。我们的模型借鉴了HyperFormer方法在人体动作识别中的应用，并适应我们的问题和数据集。我们在KERAAL数据集上进行了评估，因为它是唯一一个包含明确错误标签的医疗数据集，我们的模型显著超越了现有最好方法。此外，我们通过提出一种计算每个锻炼关节重要性的方法，朝着为患者提供更好的反馈迈出了关键一步。', 'title_zh': '基于骨架的变换器在低背部疼痛物理康复锻炼中错误分类与更优反馈的研究'}
{'arxiv_id': 'arXiv:2504.13856', 'title': 'Towards Balancing Preference and Performance through Adaptive Personalized Explainability', 'authors': 'Andrew Silva, Pradyumna Tambwekar, Mariah Schrum, Matthew Gombolay', 'link': 'https://arxiv.org/abs/2504.13856', 'abstract': "As robots and digital assistants are deployed in the real world, these agents must be able to communicate their decision-making criteria to build trust, improve human-robot teaming, and enable collaboration. While the field of explainable artificial intelligence (xAI) has made great strides to enable such communication, these advances often assume that one xAI approach is ideally suited to each problem (e.g., decision trees to explain how to triage patients in an emergency or feature-importance maps to explain radiology reports). This fails to recognize that users have diverse experiences or preferences for interaction modalities. In this work, we present two user-studies set in a simulated autonomous vehicle (AV) domain. We investigate (1) population-level preferences for xAI and (2) personalization strategies for providing robot explanations. We find significant differences between xAI modes (language explanations, feature-importance maps, and decision trees) in both preference (p < 0.01) and performance (p < 0.05). We also observe that a participant's preferences do not always align with their performance, motivating our development of an adaptive personalization strategy to balance the two. We show that this strategy yields significant performance gains (p < 0.05), and we conclude with a discussion of our findings and implications for xAI in human-robot interactions.", 'abstract_zh': '随着机器人和数字助手在真实世界中的部署，这些代理必须能够沟通其决策标准以建立信任、改善人机团队合作并实现协作。虽然可解释人工智能（xAI）领域在实现这种沟通方面取得了巨大进展，这些进步往往假定一种xAI方法最适合每个问题（例如，使用决策树解释紧急情况下如何分诊患者，或使用特征重要性地图解释放射学报告）。这未能认识到用户在交互模式上的多样经历或偏好。在本工作中，我们提出了两个用户研究，设置在一个模拟的自主车辆（AV）领域。我们探究了（1）群体层面的xAI偏好（2）提供机器人解释的个性化策略。我们发现，在偏好（p < 0.01）和性能（p < 0.05）方面，xAI模式（语言解释、特征重要性地图和决策树）之间存在显著差异。我们还观察到，参与者的偏好并不总是与其性能一致，这促使我们开发了一种自适应个性化策略来平衡这两方面。我们展示了这一策略在性能上带来了显著的提升（p < 0.05），并最后讨论了我们的发现及其对人机交互中xAI的含义。', 'title_zh': '通过自适应个性化解释实现偏好与性能的平衡'}
{'arxiv_id': 'arXiv:2504.13854', 'title': 'Stakeholder perspectives on designing socially acceptable social robots and robot avatars for Dubai and multicultural societies', 'authors': 'Laura Aymerich-Franch, Tarek Taha, Hiroshi Ishiguro, Takahiro Miyashita, Paolo Dario', 'link': 'https://arxiv.org/abs/2504.13854', 'abstract': "Robot avatars for customer service are gaining traction in Japan. However, their acceptance in other societal contexts remains underexplored, complicating efforts to design robot avatars suitable for diverse cultural environments. To address this, we interviewed key stakeholders in Dubai's service sector to gain insights into their experiences deploying social robots for customer service, as well as their opinions on the most useful tasks and design features that could maximize customer acceptance of robot avatars in Dubai. Providing information and guiding individuals to specific locations were identified as the most valued functions. Regarding appearance, robotic-looking, highly anthropomorphic designs were the most preferred. Ultra-realistic androids and cartoonish-looking robots elicited mixed reactions, while hybrid androids, low-anthropomorphic robotic designs, and animal-looking robots were considered less suitable or discouraged. Additionally, a psycho-sociological analysis revealed that interactions with robot avatars are influenced by their symbolic meaning, context, and affordances. These findings offer pioneering insights into culturally adaptive robot avatar design, addressing a significant research gap and providing actionable guidelines for deploying socially acceptable robots and avatars in multicultural contexts worldwide.", 'abstract_zh': '机器人化身在日本的客户服务中正逐渐普及，但在其他社会环境中接受程度仍待探索，这给设计适用于多元文化环境的机器人化身带来了挑战。为了应对这一挑战，我们对迪拜服务行业的关键利益相关者进行了访谈，以了解他们在部署社交机器人进行客户服务方面的经验，以及他们认为哪些最有用的任务和设计特征可以最大限度地提高迪拜机器人化身的客户接受度。结果显示，提供信息和引导个人前往特定地点是最受推崇的功能。在外观方面，高度拟人化的机器人设计最受欢迎，超逼真的机器人和卡通样式的机器人引起了混合反应，而混合机器人、低拟人化机器人设计和动物样式的机器人则被认为不太适合或不被鼓励。此外，心理社会分析表明，与机器人化身的互动受其象征意义、情境和功能的影响。这些发现为文化适应性的机器人化身设计提供了先驱性的洞察，填补了重要的研究空白，并为在全球多元文化环境中部署社会上可接受的机器人和化身提供了可操作的指导。', 'title_zh': '社交媒体接受的社会机器人及 avatar 在迪拜及多元文化社会的设计视角'}
