{'arxiv_id': 'arXiv:2510.08408', 'title': 'Validation of collision-free spheres of Stewart-Gough platforms for constant orientations using the Application Programming Interface of a CAD software', 'authors': 'Bibekananda Patra, Rajeevlochana G. Chittawadigi, Sandipan Bandyopadhyay', 'link': 'https://arxiv.org/abs/2510.08408', 'abstract': 'This paper presents a method of validation of the size of the largest collision-free sphere (CFS) of a 6-6 Stewart-Gough platform manipulator (SGPM) for a given orientation of its moving platform (MP) using the Application Programming Interface (API) of a CAD software. The position of the MP is updated via the API in an automated manner over a set of samples within a shell enclosing the surface of the CFS. For each pose of the manipulator, each pair of legs is investigated for mutual collisions. The CFS is considered safe or validated iff none of the points falling inside the CFS lead to a collision between any pair of legs. This approach can not only validate the safety of a precomputed CFS, but also estimate the same for any spatial parallel manipulator.', 'abstract_zh': '本文提出了一种使用CAD软件API验证给定导向平台 orientations 下的6-6 Stewart-Gough 平台 manipulator 最大无碰撞球体 (CFS) 尺寸的方法。通过API在包围 CFS 表面的壳体内自动更新导向平台的位置，对机器人的每个姿态，检查每对腿是否存在碰撞。CFS 被视为安全或验证通过，当且仅当 CFS 内部的任意点都不导致任何一对腿之间发生碰撞。此方法不仅可以验证预计算的 CFS 的安全性，还可以估计任何空间并联 manipulator 的 CFS。', 'title_zh': '使用CAD软件应用程序接口验证常定姿态下Stewart-Gough平台无碰撞球体的有效性'}
{'arxiv_id': 'arXiv:2510.08270', 'title': 'Evaluation of a Robust Control System in Real-World Cable-Driven Parallel Robots', 'authors': 'Damir Nurtdinov, Aliaksei Korshuk, Alexei Kornaev, Alexander Maloletov', 'link': 'https://arxiv.org/abs/2510.08270', 'abstract': "This study evaluates the performance of classical and modern control methods for real-world Cable-Driven Parallel Robots (CDPRs), focusing on underconstrained systems with limited time discretization. A comparative analysis is conducted between classical PID controllers and modern reinforcement learning algorithms, including Deep Deterministic Policy Gradient (DDPG), Proximal Policy Optimization (PPO), and Trust Region Policy Optimization (TRPO). The results demonstrate that TRPO outperforms other methods, achieving the lowest root mean square (RMS) errors across various trajectories and exhibiting robustness to larger time intervals between control updates. TRPO's ability to balance exploration and exploitation enables stable control in noisy, real-world environments, reducing reliance on high-frequency sensor feedback and computational demands. These findings highlight TRPO's potential as a robust solution for complex robotic control tasks, with implications for dynamic environments and future applications in sensor fusion or hybrid control strategies.", 'abstract_zh': '本研究评估了经典和现代控制方法在实际缆索驱动并联机器人（CDPR）中的性能，重点关注欠约束系统在有限时间离散化情况下的表现。通过经典PID控制器与现代强化学习算法（包括深度确定性策略梯度算法DDPG、近似的策略优化算法PPO和信任区域策略优化算法TRPO）进行对比分析。结果显示，TRPO在各种轨迹上的均方根（RMS）误差最低，并且在控制更新之间的时间间隔较大时表现出较好的稳健性。TRPO在平衡探索与利用方面的能力使其能够在嘈杂的实际环境中实现稳定的控制，减少对高频传感器反馈以及计算需求的依赖。这些发现强调了TRPO作为复杂机器人控制任务稳健解决方案的潜力，对其在动态环境以及未来传感器融合或混合控制策略中的应用具有重要意义。', 'title_zh': '实时电缆驱动并联机器人中稳健控制系统的评估'}
{'arxiv_id': 'arXiv:2510.07807', 'title': 'GM3: A General Physical Model for Micro-Mobility Vehicles', 'authors': 'Grace Cai, Nithin Parepally, Laura Zheng, Ming C. Lin', 'link': 'https://arxiv.org/abs/2510.07807', 'abstract': 'Modeling the dynamics of micro-mobility vehicles (MMV) is becoming increasingly important for training autonomous vehicle systems and building urban traffic simulations. However, mainstream tools rely on variants of the Kinematic Bicycle Model (KBM) or mode-specific physics that miss tire slip, load transfer, and rider/vehicle lean. To our knowledge, no unified, physics-based model captures these dynamics across the full range of common MMVs and wheel layouts. We propose the "Generalized Micro-mobility Model" (GM3), a tire-level formulation based on the tire brush representation that supports arbitrary wheel configurations, including single/double track and multi-wheel platforms. We introduce an interactive model-agnostic simulation framework that decouples vehicle/layout specification from dynamics to compare the GM3 with the KBM and other models, consisting of fixed step RK4 integration, human-in-the-loop and scripted control, real-time trajectory traces and logging for analysis. We also empirically validate the GM3 on the Stanford Drone Dataset\'s deathCircle (roundabout) scene for biker, skater, and cart classes.', 'abstract_zh': '微移动车辆动力学建模对于训练自主车辆系统和构建城市交通模拟越来越重要。然而，主流工具主要依赖于动力学自行车模型（KBM）的变体或特定模式的物理模型，这些模型未能捕捉车胎滑移、载荷转移和骑手/车辆倾斜的动力学。据我们所知，没有统一的基于物理的动力学模型能够覆盖常见微移动车辆和轮配置的全范围动力学。我们提出了一种“通用微移动模型”（GM3），这是一种基于车胎刷表示的轮胎级公式，支持任意轮配置，包括单轨/双轨和多轮平台。我们引入了一个交互式的模型无关仿真框架，将车辆/布局定义与动力学分离，以比较GM3与KBM和其他模型，该框架包括固定步长RK4积分、人工闭环控制和脚本控制、实时轨迹追踪和日志记录以供分析。我们还在斯坦福无人机数据集中deathCircle（环岛）场景上对GM3进行了经验验证，针对骑手、滑板手和小车类别进行了验证。', 'title_zh': 'GM3: 一种通用的微移动车辆物理模型'}
{'arxiv_id': 'arXiv:2510.07514', 'title': 'HJCD-IK: GPU-Accelerated Inverse Kinematics through Batched Hybrid Jacobian Coordinate Descent', 'authors': 'Cael Yasutake, Zachary Kingston, Brian Plancher', 'link': 'https://arxiv.org/abs/2510.07514', 'abstract': 'Inverse Kinematics (IK) is a core problem in robotics, in which joint configurations are found to achieve a desired end-effector pose. Although analytical solvers are fast and efficient, they are limited to systems with low degrees-of-freedom and specific topological structures. Numerical optimization-based approaches are more general, but suffer from high computational costs and frequent convergence to spurious local minima. Recent efforts have explored the use of GPUs to combine sampling and optimization to enhance both the accuracy and speed of IK solvers. We build on this recent literature and introduce HJCD-IK, a GPU-accelerated, sampling-based hybrid solver that combines an orientation-aware greedy coordinate descent initialization scheme with a Jacobian-based polishing routine. This design enables our solver to improve both convergence speed and overall accuracy as compared to the state-of-the-art, consistently finding solutions along the accuracy-latency Pareto frontier and often achieving order-of-magnitude gains. In addition, our method produces a broad distribution of high-quality samples, yielding the lowest maximum mean discrepancy. We release our code open-source for the benefit of the community.', 'abstract_zh': '基于GPU的混合采样优化逆运动学求解器HJCD-IK', 'title_zh': 'HJCD-IK: GPU加速的批量混合雅可比坐标下降逆动力学'}
{'arxiv_id': 'arXiv:2510.07609', 'title': 'IGUANA: Immersive Guidance, Navigation, and Control for Consumer UAV', 'authors': 'Victor Victor, Tania Krisanty, Matthew McGinity, Stefan Gumhold, Uwe Aßmann', 'link': 'https://arxiv.org/abs/2510.07609', 'abstract': "As the markets for unmanned aerial vehicles (UAVs) and mixed reality (MR) headsets continue to grow, recent research has increasingly explored their integration, which enables more intuitive, immersive, and situationally aware control systems. We present IGUANA, an MR-based immersive guidance, navigation, and control system for consumer UAVs. IGUANA introduces three key elements beyond conventional control interfaces: (1) a 3D terrain map interface with draggable waypoint markers and live camera preview for high-level control, (2) a novel spatial control metaphor that uses a virtual ball as a physical analogy for low-level control, and (3) a spatial overlay that helps track the UAV when it is not visible with the naked eye or visual line of sight is interrupted. We conducted a user study to evaluate our design, both quantitatively and qualitatively, and found that (1) the 3D map interface is intuitive and easy to use, relieving users from manual control and suggesting improved accuracy and consistency with lower perceived workload relative to conventional dual-stick controller, (2) the virtual ball interface is intuitive but limited by the lack of physical feedback, and (3) the spatial overlay is very useful in enhancing the users' situational awareness.", 'abstract_zh': '随着无人驾驶航空车辆(UAVs)和混合现实(MR)头显市场的持续增长，近期的研究越来越多地探索它们的集成，这使得更直观、沉浸和情境感知的控制系统成为可能。我们提出了IGUANA，一种基于混合现实的沉浸式导航和控制系统，适用于消费级无人驾驶航空车辆。IGUANA引入了三种超越传统控制接口的关键元素：(1) 三维地形图界面，带有可拖动的航点标记和实时摄像头预览，用于高级控制；(2) 一种新颖的空间控制元喻，使用虚拟球体作为物理类比，用于低级控制；(3) 空间叠加，有助于当无人驾驶航空车辆不可见或视线中断时进行跟踪。我们进行了用户研究，从定量和定性两个方面评估了我们的设计，并发现(1) 三维地图界面直观易用，减轻了用户的手动控制负担，与传统的双摇杆控制器相比，提高了准确性和一致性，并减少了感知工作负荷；(2) 虚拟球体界面直观但受限于缺乏物理反馈；(3) 空间叠加对增强用户的情境感知非常有用。', 'title_zh': 'IGUANA: 浸没式指导、导航与控制 for 消费级无人机'}
{'arxiv_id': 'arXiv:2510.07348', 'title': 'Bioinspired Tapered-Spring Turbulence Sensor for Underwater Flow Detection', 'authors': 'Xiao Jin, Zhenhua Yu, Thrishantha Nanayakkara', 'link': 'https://arxiv.org/abs/2510.07348', 'abstract': 'This paper presents a bio-inspired underwater whisker sensor for robust hydrodynamic disturbance detection and efficient signal analysis based on Physical Reservoir Computing (PRC). The design uses a tapered nylon spring with embedded accelerometers to achieve spatially distributed vibration sensing and frequency separation along the whisker. Towing-tank experiments and computational fluid dynamics simulations confirmed that the whisker effectively distinguishes vortex regimes across different fin angles and maintains Strouhal scaling with flow velocity, where higher speeds increase vibration intensity without affecting the dominant frequencies. Frequency-domain analysis, Shannon entropy, and machine learning further validated the sensing performance: vortex shedding frequencies were identified with less than 10\\% error, entropy captured the transition from coherent vortex streets to turbulence, and logistic regression achieved 86.0\\% classification accuracy with millisecond-level inference. These results demonstrate that structurally encoded whisker sensing provides a scalable and real-time solution for underwater perception, wake tracking, and turbulence-aware navigation in autonomous marine robots.', 'abstract_zh': '基于物理 reservoir 计算的受生物启发的水下触须传感器及其在流体力学扰动检测与高效信号分析中的应用', 'title_zh': '生物启发的锥形弹簧湍流传感器用于水下流场检测'}
