{'arxiv_id': 'arXiv:2505.09119', 'title': 'Model Identification Adaptive Control with $ρ$-POMDP Planning', 'authors': 'Michelle Ho, Arec Jamgochian, Mykel J. Kochenderfer', 'link': 'https://arxiv.org/abs/2505.09119', 'abstract': 'Accurate system modeling is crucial for safe, effective control, as misidentification can lead to accumulated errors, especially under partial observability. We address this problem by formulating informative input design (IID) and model identification adaptive control (MIAC) as belief space planning problems, modeled as partially observable Markov decision processes with belief-dependent rewards ($\\rho$-POMDPs). We treat system parameters as hidden state variables that must be localized while simultaneously controlling the system. We solve this problem with an adapted belief-space iterative Linear Quadratic Regulator (BiLQR). We demonstrate it on fully and partially observable tasks for cart-pole and steady aircraft flight domains. Our method outperforms baselines such as regression, filtering, and local optimal control methods, even under instantaneous disturbances to system parameters.', 'abstract_zh': '精确的系统建模对于安全、有效的控制至关重要，因为误识别会导致累积误差，尤其是在部分可观测情况下。我们通过将信息性输入设计（IID）和模型识别自适应控制（MIAC）形式化为信念空间规划问题来解决这一问题，将其建模为具有信念依赖奖励的部分可观测马尔可夫决策过程（$\\rho$-POMDP）。我们将系统参数视为必须定位的隐藏状态变量，同时控制系统。我们使用改进的信念空间迭代线性二次调节器（BiLQR）来解决这一问题。我们在全可观测和部分可观测的cart-pole和稳定飞机飞行域任务中进行了演示。该方法在系统参数瞬时扰动下优于回归、滤波和局部最优控制等基线方法。', 'title_zh': '基于ρ-POMDP规划的模型识别自适应控制'}
{'arxiv_id': 'arXiv:2505.09020', 'title': 'JcvPCA and JsvCRP : a set of metrics to evaluate changes in joint coordination strategies', 'authors': 'Océane Dubois, Agnès Roby-Brami, Ross Parry, Nathanaël Jarrassé', 'link': 'https://arxiv.org/abs/2505.09020', 'abstract': "Characterizing changes in inter-joint coordination presents significant challenges, as it necessitates the examination of relationships between multiple degrees of freedom during movements and their temporal evolution. Existing metrics are inadequate in providing physiologically coherent results that document both the temporal and spatial aspects of inter-joint coordination. In this article, we introduce two novel metrics to enhance the analysis of inter-joint coordination. The first metric, Joint Contribution Variation based on Principal Component Analysis (JcvPCA), evaluates the variation in each joint's contribution during series of movements. The second metric, Joint Synchronization Variation based on Continuous Relative Phase (JsvCRP), measures the variation in temporal synchronization among joints between two movement datasets. We begin by presenting each metric and explaining their derivation. We then demonstrate the application of these metrics using simulated and experimental datasets involving identical movement tasks performed with distinct coordination strategies. The results show that these metrics can successfully differentiate between unique coordination strategies, providing meaningful insights into joint collaboration during movement. These metrics hold significant potential for fields such as ergonomics and clinical rehabilitation, where a precise understanding of the evolution of inter-joint coordination strategies is crucial. Potential applications include evaluating the effects of upper limb exoskeletons in industrial settings or monitoring the progress of patients undergoing neurological rehabilitation.", 'abstract_zh': '基于主成分分析的关节贡献变异度（JcvPCA）和基于连续相对相位的关节同步变异度（JsvCRP）：增强关节协调分析的新方法及其应用', 'title_zh': 'JcvPCA和JsvCRP：一套评估关节协调策略变化的指标'}
{'arxiv_id': 'arXiv:2505.09472', 'title': 'Streaming Multi-agent Pathfinding', 'authors': 'Mingkai Tang, Lu Gan, Kaichen Zhang', 'link': 'https://arxiv.org/abs/2505.09472', 'abstract': 'The task of the multi-agent pathfinding (MAPF) problem is to navigate a team of agents from their start point to the goal points. However, this setup is unsuitable in the assembly line scenario, which is periodic with a long working hour. To address this issue, the study formalizes the streaming MAPF (S-MAPF) problem, which assumes that the agents in the same agent stream have a periodic start time and share the same action sequence. The proposed solution, Agent Stream Conflict-Based Search (ASCBS), is designed to tackle this problem by incorporating a cyclic vertex/edge constraint to handle conflicts. Additionally, this work explores the potential usage of the disjoint splitting strategy within ASCBS. Experimental results indicate that ASCBS surpasses traditional MAPF solvers in terms of runtime for scenarios with prolonged working hours.', 'abstract_zh': '基于流的多-agent路径规划问题（Streaming MAPF）及其解决策略（Agent Stream Conflict-Based Search, ASCBS）研究', 'title_zh': '流式多代理路径规划'}
{'arxiv_id': 'arXiv:2505.09224', 'title': 'Ethical Aspects of the Use of Social Robots in Elderly Care -- A Systematic Qualitative Review', 'authors': 'Marianne Leineweber, Clara Victoria Keusgen, Marc Bubeck, Joschka Haltaufderheide, Robert Ranisch, Corinna Klingler', 'link': 'https://arxiv.org/abs/2505.09224', 'abstract': 'Background: The use of social robotics in elderly care is increasingly discussed as one way of meeting emerging care needs due to scarce resources. While many potential benefits are associated with robotic care technologies, there is a variety of ethical challenges. To support steps towards a responsible implementation and use, this review develops an overview on ethical aspects of the use of social robots in elderly care from a decision-makers\' perspective.\nMethods: Electronic databases were queried using a comprehensive search strategy based on the key concepts of "ethical aspects", "social robotics" and "elderly care". Abstract and title screening was conducted by two authors independently. Full-text screening was conducted by one author following a joint consolidation phase. Data was extracted using MAXQDA24 by one author, based on a consolidated coding framework. Analysis was performed through modified qualitative content analysis.\nResults: A total of 1,518 publications were screened, and 248 publications were included. We have organized our analysis in a scheme of ethical hazards, ethical opportunities and unsettled questions, identifying at least 60 broad ethical aspects affecting three different stakeholder groups. While some ethical issues are well-known and broadly discussed our analysis shows a plethora of potentially relevant aspects, often only marginally recognized, that are worthy of consideration from a practical perspective.\nDiscussion: The findings highlight the need for a contextual and detailed evaluation of implementation scenarios. To make use of the vast knowledge of the ethical discourse, we hypothesize that decision-makers need to understand the specific nature of this discourse to be able to engage in careful ethical deliberation.', 'abstract_zh': '背景：随着资源稀缺，将社会机器人应用于老年人护理以应对不断变化的护理需求而受到越来越多的关注。尽管机器人护理技术有许多潜在益处，但也存在多种伦理挑战。为了支持伦理责任的实施和使用，本评论从决策者角度提出了社会机器人在老年人护理中应用的伦理方面的综述。', 'title_zh': '社交机器人在老年照护中使用方面的伦理问题——一项系统性定性综述'}
{'arxiv_id': 'arXiv:2505.09067', 'title': 'Solving Reach- and Stabilize-Avoid Problems Using Discounted Reachability', 'authors': 'Boyang Li, Zheng Gong, Sylvia Herbert', 'link': 'https://arxiv.org/abs/2505.09067', 'abstract': 'In this article, we consider the infinite-horizon reach-avoid (RA) and stabilize-avoid (SA) zero-sum game problems for general nonlinear continuous-time systems, where the goal is to find the set of states that can be controlled to reach or stabilize to a target set, without violating constraints even under the worst-case disturbance. Based on the Hamilton-Jacobi reachability method, we address the RA problem by designing a new Lipschitz continuous RA value function, whose zero sublevel set exactly characterizes the RA set. We establish that the associated Bellman backup operator is contractive and that the RA value function is the unique viscosity solution of a Hamilton-Jacobi variational inequality. Finally, we develop a two-step framework for the SA problem by integrating our RA strategies with a recently proposed Robust Control Lyapunov-Value Function, thereby ensuring both target reachability and long-term stability. We numerically verify our RA and SA frameworks on a 3D Dubins car system to demonstrate the efficacy of the proposed approach.', 'abstract_zh': '本文考虑了一般非线性连续系统在无限 horizon 下的reach-avoid (RA) 和 stabilize-avoid (SA) 零和博弈问题，目标是在最坏扰动情况下，找到可以控制到达或稳定在目标集的状态集，而不违反约束条件。基于哈密尔敦-雅可比可达性方法，我们通过设计一个新的Lipschitz连续RA值函数，解决RA问题，该值函数的零次亚水平集精确地表征了RA集。我们证明了相应的贝尔曼备份算子收敛，并且RA值函数是哈密尔敦-雅可比变分不等式的唯一拟解。最后，我们通过整合提出的RA策略和最近提出的鲁棒控制Lyapunov-值函数，开发了SA问题的两步框架，从而确保目标可达性和长期稳定性。我们通过一个3D Dubins车系统数值验证了RA和SA框架的有效性。', 'title_zh': '使用折扣可达性求解可达和稳定避免问题'}
{'arxiv_id': 'arXiv:2505.09518', 'title': '\\textsc{rfPG}: Robust Finite-Memory Policy Gradients for Hidden-Model POMDPs', 'authors': 'Maris F. L. Galesloot, Roman Andriushchenko, Milan Češka, Sebastian Junges, Nils Jansen', 'link': 'https://arxiv.org/abs/2505.09518', 'abstract': 'Partially observable Markov decision processes (POMDPs) model specific environments in sequential decision-making under uncertainty. Critically, optimal policies for POMDPs may not be robust against perturbations in the environment. Hidden-model POMDPs (HM-POMDPs) capture sets of different environment models, that is, POMDPs with a shared action and observation space. The intuition is that the true model is hidden among a set of potential models, and it is unknown which model will be the environment at execution time. A policy is robust for a given HM-POMDP if it achieves sufficient performance for each of its POMDPs. We compute such robust policies by combining two orthogonal techniques: (1) a deductive formal verification technique that supports tractable robust policy evaluation by computing a worst-case POMDP within the HM-POMDP and (2) subgradient ascent to optimize the candidate policy for a worst-case POMDP. The empirical evaluation shows that, compared to various baselines, our approach (1) produces policies that are more robust and generalize better to unseen POMDPs and (2) scales to HM-POMDPs that consist of over a hundred thousand environments.', 'abstract_zh': '部分可观测马尔可夫决策过程（POMDPs）模型在不确定性下的序列决策中建模特定环境。关键的是，POMDPs的最佳策略可能对环境扰动不够稳健。隐蔽模型POMDPs（HM-POMDPs）捕捉一组不同的环境模型，即具有共享动作和观测空间的POMDPs。直觉上，真实模型隐藏在一组潜在模型中，在执行时不知道哪个模型将是环境。针对给定HM-POMDP的一个策略是稳健的，如果它能够为HM-POMDP中的每个POMDP实现足够性能。我们通过结合两种正交技术来计算此类稳健策略：（1）支持通过计算HM-POMDP内的最坏情况POMDP来实现可管理的稳健策略评估的演绎形式化验证技术；（2）子梯度上升来优化候选策略针对最坏情况POMDP的性能。实证评估表明，与各种基线相比，我们的方法（1）生成的策略更加稳健，并且能够更好地泛化到未见过的POMDPs；（2）能够扩展到包含超过十万种环境的HM-POMDPs。', 'title_zh': 'RFPG: 隐模型部分可观测马尔可夫决策过程的稳健有限记忆策略梯度'}
{'arxiv_id': 'arXiv:2505.09412', 'title': 'Counterfactual Strategies for Markov Decision Processes', 'authors': 'Paul Kobialka, Lina Gerlach, Francesco Leofante, Erika Ábrahám, Silvia Lizeth Tapia Tarifa, Einar Broch Johnsen', 'link': 'https://arxiv.org/abs/2505.09412', 'abstract': "Counterfactuals are widely used in AI to explain how minimal changes to a model's input can lead to a different output. However, established methods for computing counterfactuals typically focus on one-step decision-making, and are not directly applicable to sequential decision-making tasks. This paper fills this gap by introducing counterfactual strategies for Markov Decision Processes (MDPs). During MDP execution, a strategy decides which of the enabled actions (with known probabilistic effects) to execute next. Given an initial strategy that reaches an undesired outcome with a probability above some limit, we identify minimal changes to the initial strategy to reduce that probability below the limit. We encode such counterfactual strategies as solutions to non-linear optimization problems, and further extend our encoding to synthesize diverse counterfactual strategies. We evaluate our approach on four real-world datasets and demonstrate its practical viability in sophisticated sequential decision-making tasks.", 'abstract_zh': 'Markov决策过程中的反事实策略：在Seqential决策任务中的应用', 'title_zh': '马尔可夫决策过程的反事实策略'}
{'arxiv_id': 'arXiv:2505.09341', 'title': 'Access Controls Will Solve the Dual-Use Dilemma', 'authors': 'Evžen Wybitul', 'link': 'https://arxiv.org/abs/2505.09341', 'abstract': "AI safety systems face a dual-use dilemma. Since the same request can be either harmless or harmful depending on who made it and why, if the system makes decisions based solely on the request's content, it will refuse some legitimate queries and let pass harmful ones. To address this, we propose a conceptual access control framework, based on verified user credentials (such as institutional affiliation) and classifiers that assign model outputs to risk categories (such as advanced virology). The system permits responses only when the user's verified credentials match the category's requirements. For implementation of the model output classifiers, we introduce a theoretical approach utilizing small, gated expert modules integrated into the generator model, trained with gradient routing, that enable efficient risk detection without the capability gap problems of external monitors. While open questions remain about the verification mechanisms, risk categories, and the technical implementation, our framework makes the first step toward enabling granular governance of AI capabilities: verified users gain access to specialized knowledge without arbitrary restrictions, while adversaries are blocked from it. This contextual approach reconciles model utility with robust safety, addressing the dual-use dilemma.", 'abstract_zh': 'AI安全系统面临双重用途困境。为了应对这一挑战，我们提出一个基于验证用户凭据（如机构隶属关系）和分类器的风险类别框架。该框架将仅在用户验证凭据符合类别要求时才允许响应。在实现模型输出分类器时，我们引入了一种理论方法，利用集成于生成模型的小型门控专家模块，并通过梯度路由进行训练，这使得在避免外部监控能力缺口问题的同时，能够高效地进行风险检测。虽然关于验证机制、风险类别和技术实现仍有许多未解决的问题，但我们的框架迈出了走向细粒度治理AI能力的第一步：验证用户可以访问专业知识而不会受到任意限制，而对手则被阻止访问。这种上下文方法使模型 utility 与强健安全相一致，解决了双重用途困境。', 'title_zh': '访问控制将解决双重用途困境'}
{'arxiv_id': 'arXiv:2505.09114', 'title': 'Beyond the Known: Decision Making with Counterfactual Reasoning Decision Transformer', 'authors': 'Minh Hoang Nguyen, Linh Le Pham Van, Thommen George Karimpanal, Sunil Gupta, Hung Le', 'link': 'https://arxiv.org/abs/2505.09114', 'abstract': "Decision Transformers (DT) play a crucial role in modern reinforcement learning, leveraging offline datasets to achieve impressive results across various domains. However, DT requires high-quality, comprehensive data to perform optimally. In real-world applications, the lack of training data and the scarcity of optimal behaviours make training on offline datasets challenging, as suboptimal data can hinder performance. To address this, we propose the Counterfactual Reasoning Decision Transformer (CRDT), a novel framework inspired by counterfactual reasoning. CRDT enhances DT ability to reason beyond known data by generating and utilizing counterfactual experiences, enabling improved decision-making in unseen scenarios. Experiments across Atari and D4RL benchmarks, including scenarios with limited data and altered dynamics, demonstrate that CRDT outperforms conventional DT approaches. Additionally, reasoning counterfactually allows the DT agent to obtain stitching abilities, combining suboptimal trajectories, without architectural modifications. These results highlight the potential of counterfactual reasoning to enhance reinforcement learning agents' performance and generalization capabilities.", 'abstract_zh': '基于反事实推理的决策变换器（CRDT）在现代强化学习中扮演着重要角色，通过利用离线数据集在多个领域取得了显著成果。然而，CRDT需要高质量、全面的数据才能表现优异。在实际应用中，由于缺乏训练数据和最优行为的稀缺性，利用离线数据集进行训练极具挑战性，不理想的训练数据会阻碍性能提升。为解决这一问题，我们提出了基于反事实推理的决策变换器（CRDT），这是一种受到反事实推理启发的新框架。CRDT通过生成和利用反事实经验，增强了DT在未知场景中进行推理和决策的能力。实验结果表明，CRDT在Atari和D4RL基准测试中，特别是在数据有限和动态改变的情况下，表现优于传统DT方法。此外，通过反事实推理，DT代理可以获取拼接能力，无需对架构进行修改即可结合不理想的轨迹。这些结果突显了反事实推理在提高强化学习代理性能和泛化能力方面的潜在价值。', 'title_zh': '已知之外：基于反事实推理的决策制定 Decision Transformer'}
{'arxiv_id': 'arXiv:2505.09012', 'title': 'Deep Reinforcement Learning for Power Grid Multi-Stage Cascading Failure Mitigation', 'authors': 'Bo Meng, Chenghao Xu, Yongli Zhu', 'link': 'https://arxiv.org/abs/2505.09012', 'abstract': 'Cascading failures in power grids can lead to grid collapse, causing severe disruptions to social operations and economic activities. In certain cases, multi-stage cascading failures can occur. However, existing cascading-failure-mitigation strategies are usually single-stage-based, overlooking the complexity of the multi-stage scenario. This paper treats the multi-stage cascading failure problem as a reinforcement learning task and develops a simulation environment. The reinforcement learning agent is then trained via the deterministic policy gradient algorithm to achieve continuous actions. Finally, the effectiveness of the proposed approach is validated on the IEEE 14-bus and IEEE 118-bus systems.', 'abstract_zh': '电力网络中的级联故障可能导致电网崩溃，严重扰乱社会运营和经济活动。在某些情况下，可能会发生多阶段级联故障。然而，现有的级联故障缓解策略通常是单阶段的，忽视了多阶段情景的复杂性。本文将多阶段级联故障问题视为强化学习任务，并开发了一个仿真环境。随后，使用确定性策略梯度算法训练强化学习代理以实现连续动作。最后，所提出的方法在IEEE 14节点系统和IEEE 118节点系统上进行了有效性验证。', 'title_zh': '基于深度强化学习的电力系统多阶段雪崩故障 mitigation'}
{'arxiv_id': 'arXiv:2505.08995', 'title': 'Enhancing Aerial Combat Tactics through Hierarchical Multi-Agent Reinforcement Learning', 'authors': 'Ardian Selmonaj, Oleg Szehr, Giacomo Del Rio, Alessandro Antonucci, Adrian Schneider, Michael Rüegsegger', 'link': 'https://arxiv.org/abs/2505.08995', 'abstract': 'This work presents a Hierarchical Multi-Agent Reinforcement Learning framework for analyzing simulated air combat scenarios involving heterogeneous agents. The objective is to identify effective Courses of Action that lead to mission success within preset simulations, thereby enabling the exploration of real-world defense scenarios at low cost and in a safe-to-fail setting. Applying deep Reinforcement Learning in this context poses specific challenges, such as complex flight dynamics, the exponential size of the state and action spaces in multi-agent systems, and the capability to integrate real-time control of individual units with look-ahead planning. To address these challenges, the decision-making process is split into two levels of abstraction: low-level policies control individual units, while a high-level commander policy issues macro commands aligned with the overall mission targets. This hierarchical structure facilitates the training process by exploiting policy symmetries of individual agents and by separating control from command tasks. The low-level policies are trained for individual combat control in a curriculum of increasing complexity. The high-level commander is then trained on mission targets given pre-trained control policies. The empirical validation confirms the advantages of the proposed framework.', 'abstract_zh': '一种用于分析异构智能体模拟空战场景的分层多智能体强化学习框架', 'title_zh': '通过分层多智能体强化学习提升空战战术'}
{'arxiv_id': 'arXiv:2505.09565', 'title': 'Meta-learning Slice-to-Volume Reconstruction in Fetal Brain MRI using Implicit Neural Representations', 'authors': 'Maik Dannecker, Thomas Sanchez, Meritxell Bach Cuadra, Özgün Turgut, Anthony N. Price, Lucilio Cordero-Grande, Vanessa Kyriakopoulou, Joseph V. Hajnal, Daniel Rueckert', 'link': 'https://arxiv.org/abs/2505.09565', 'abstract': 'High-resolution slice-to-volume reconstruction (SVR) from multiple motion-corrupted low-resolution 2D slices constitutes a critical step in image-based diagnostics of moving subjects, such as fetal brain Magnetic Resonance Imaging (MRI). Existing solutions struggle with image artifacts and severe subject motion or require slice pre-alignment to achieve satisfying reconstruction performance. We propose a novel SVR method to enable fast and accurate MRI reconstruction even in cases of severe image and motion corruption. Our approach performs motion correction, outlier handling, and super-resolution reconstruction with all operations being entirely based on implicit neural representations. The model can be initialized with task-specific priors through fully self-supervised meta-learning on either simulated or real-world data. In extensive experiments including over 480 reconstructions of simulated and clinical MRI brain data from different centers, we prove the utility of our method in cases of severe subject motion and image artifacts. Our results demonstrate improvements in reconstruction quality, especially in the presence of severe motion, compared to state-of-the-art methods, and up to 50% reduction in reconstruction time.', 'abstract_zh': '高分辨率切片到体素重建（SVR）：从多个运动 corrupted 低分辨率 2D 切片构建移动 Subject 的成像诊断在胎儿脑 MRI 中的应用', 'title_zh': '基于隐式神经表示的胎儿脑部MRI切片到体素重建元学习'}
{'arxiv_id': 'arXiv:2505.09558', 'title': 'WavReward: Spoken Dialogue Models With Generalist Reward Evaluators', 'authors': 'Shengpeng Ji, Tianle Liang, Yangzhuo Li, Jialong Zuo, Minghui Fang, Jinzheng He, Yifu Chen, Zhengqing Liu, Ziyue Jiang, Xize Cheng, Siqi Zheng, Jin Xu, Junyang Lin, Zhou Zhao', 'link': 'https://arxiv.org/abs/2505.09558', 'abstract': "End-to-end spoken dialogue models such as GPT-4o-audio have recently garnered significant attention in the speech domain. However, the evaluation of spoken dialogue models' conversational performance has largely been overlooked. This is primarily due to the intelligent chatbots convey a wealth of non-textual information which cannot be easily measured using text-based language models like ChatGPT. To address this gap, we propose WavReward, a reward feedback model based on audio language models that can evaluate both the IQ and EQ of spoken dialogue systems with speech input. Specifically, 1) based on audio language models, WavReward incorporates the deep reasoning process and the nonlinear reward mechanism for post-training. By utilizing multi-sample feedback via the reinforcement learning algorithm, we construct a specialized evaluator tailored to spoken dialogue models. 2) We introduce ChatReward-30K, a preference dataset used to train WavReward. ChatReward-30K includes both comprehension and generation aspects of spoken dialogue models. These scenarios span various tasks, such as text-based chats, nine acoustic attributes of instruction chats, and implicit chats. WavReward outperforms previous state-of-the-art evaluation models across multiple spoken dialogue scenarios, achieving a substantial improvement about Qwen2.5-Omni in objective accuracy from 55.1$\\%$ to 91.5$\\%$. In subjective A/B testing, WavReward also leads by a margin of 83$\\%$. Comprehensive ablation studies confirm the necessity of each component of WavReward. All data and code will be publicly at this https URL after the paper is accepted.", 'abstract_zh': '面向语音的端到端对话模型如GPT-4o-audio recently garnered significant attention.然而，对这些对话模型对话性能的评估却 largely 被忽视。为此，我们提出 WavReward，一种基于音频语言模型的奖励反馈模型，可以评估具有语音输入的对话系统的智商和情商。具体而言，1）基于音频语言模型，WavReward 结合了深度推理过程和非线性奖励机制。通过利用强化学习算法的多样本反馈，我们构建了一个针对语音对话模型的专业评估器。2）我们引入了 ChatReward-30K，这是一个用于训练 WavReward 的偏好数据集，包含了对话模型的理解和生成方面。这些场景涵盖了多种任务，如基于文本的对话、九种指令对话的声学属性以及隐式对话。WavReward 在多个语音对话场景中性能优于此前最先进的评估模型，客观准确率从 55.1% 提高到 91.5%，并且在主观 A/B 测试中也以 83% 的优势领先。全面的消融研究证实了 WavReward 中每个组件的必要性。论文接受后，所有数据和代码将在以下地址公开：https://...', 'title_zh': 'WavReward: 通用奖励评估器的语音对话模型'}
{'arxiv_id': 'arXiv:2505.09486', 'title': 'Preserving Plasticity in Continual Learning with Adaptive Linearity Injection', 'authors': 'Seyed Roozbeh Razavi Rohani, Khashayar Khajavi, Wesley Chung, Mo Chen, Sharan Vaswani', 'link': 'https://arxiv.org/abs/2505.09486', 'abstract': "Loss of plasticity in deep neural networks is the gradual reduction in a model's capacity to incrementally learn and has been identified as a key obstacle to learning in non-stationary problem settings. Recent work has shown that deep linear networks tend to be resilient towards loss of plasticity. Motivated by this observation, we propose Adaptive Linearization (AdaLin), a general approach that dynamically adapts each neuron's activation function to mitigate plasticity loss. Unlike prior methods that rely on regularization or periodic resets, AdaLin equips every neuron with a learnable parameter and a gating mechanism that injects linearity into the activation function based on its gradient flow. This adaptive modulation ensures sufficient gradient signal and sustains continual learning without introducing additional hyperparameters or requiring explicit task boundaries. When used with conventional activation functions like ReLU, Tanh, and GeLU, we demonstrate that AdaLin can significantly improve performance on standard benchmarks, including Random Label and Permuted MNIST, Random Label and Shuffled CIFAR-10, and Class-Split CIFAR-100. Furthermore, its efficacy is shown in more complex scenarios, such as class-incremental learning on CIFAR-100 with a ResNet-18 backbone, and in mitigating plasticity loss in off-policy reinforcement learning agents. We perform a systematic set of ablations that show that neuron-level adaptation is crucial for good performance and analyze a number of metrics in the network that might be correlated to loss of plasticity.", 'abstract_zh': '深度神经网络中可塑性的丧失渐进减少模型逐步学习的能力，并被识别为非平稳问题设置中学习的关键障碍。最近的研究表明，深层线性网络倾向于对可塑性的丧失具有抗性。受这一观察的启发，我们提出了自适应线性化（AdaLin）方法，这是一种通用方法，能够动态地根据其梯度流为每个神经元的激活函数配备可学习参数和门控机制，注入线性。与依赖正则化或周期性重置的先前方法不同，AdaLin 不引入额外的超参数，也不需要显式的任务边界，即可确保梯度信号并持续学习。在使用如 ReLU、Tanh 和 GeLU 等标准激活函数时，我们证明了 AdaLin 可以在包括随机标签和 Permuted MNIST、随机标签和打乱的 CIFAR-10 以及类划分的 CIFAR-100 在内的标准基准测试中显著提高性能。此外，我们展示了其在更复杂场景中的有效性，如使用 ResNet-18 主干的 CIFAR-100 上的类增量学习，以及在异策略增强学习代理中缓解可塑性丧失。我们进行了系统性的消融实验，表明神经元级别的适应对于良好性能至关重要，并分析了网络中与可塑性丧失相关的若干指标。', 'title_zh': '适应性线性注入以保持连续学习中的可塑性'}
{'arxiv_id': 'arXiv:2505.09456', 'title': 'Quantum state-agnostic work extraction (almost) without dissipation', 'authors': 'Josep Lumbreras, Ruo Cheng Huang, Yanglin Hu, Mile Gu, Marco Tomamichel', 'link': 'https://arxiv.org/abs/2505.09456', 'abstract': 'We investigate work extraction protocols designed to transfer the maximum possible energy to a battery using sequential access to $N$ copies of an unknown pure qubit state. The core challenge is designing interactions to optimally balance two competing goals: charging of the battery optimally using the qubit in hand, and acquiring more information by qubit to improve energy harvesting in subsequent rounds. Here, we leverage exploration-exploitation trade-off in reinforcement learning to develop adaptive strategies achieving energy dissipation that scales only poly-logarithmically in $N$. This represents an exponential improvement over current protocols based on full state tomography.', 'abstract_zh': '我们研究了使用串行访问未知纯量子比特状态的拷贝来将尽可能多的能量转移到电池中的工作提取协议。核心挑战是设计交互以最优地平衡两个竞争目标：使用手中的量子比特最佳地给电池充电，以及通过量子比特获取更多信息以改进后续轮次的能量采集。在此，我们利用强化学习中的探索与利用权衡来开发出适应性策略，实现能耗仅按N的对数多项式尺度增长。这代表了当前基于完整态图论的协议的指数级改进。', 'title_zh': '无耗散几乎不依赖于量子态的工作提取'}
{'arxiv_id': 'arXiv:2505.09395', 'title': 'Quantum-Enhanced Parameter-Efficient Learning for Typhoon Trajectory Forecasting', 'authors': 'Chen-Yu Liu, Kuan-Cheng Chen, Yi-Chien Chen, Samuel Yen-Chi Chen, Wei-Hao Huang, Wei-Jia Huang, Yen-Jui Chang', 'link': 'https://arxiv.org/abs/2505.09395', 'abstract': "Typhoon trajectory forecasting is essential for disaster preparedness but remains computationally demanding due to the complexity of atmospheric dynamics and the resource requirements of deep learning models. Quantum-Train (QT), a hybrid quantum-classical framework that leverages quantum neural networks (QNNs) to generate trainable parameters exclusively during training, eliminating the need for quantum hardware at inference time. Building on QT's success across multiple domains, including image classification, reinforcement learning, flood prediction, and large language model (LLM) fine-tuning, we introduce Quantum Parameter Adaptation (QPA) for efficient typhoon forecasting model learning. Integrated with an Attention-based Multi-ConvGRU model, QPA enables parameter-efficient training while maintaining predictive accuracy. This work represents the first application of quantum machine learning (QML) to large-scale typhoon trajectory prediction, offering a scalable and energy-efficient approach to climate modeling. Our results demonstrate that QPA significantly reduces the number of trainable parameters while preserving performance, making high-performance forecasting more accessible and sustainable through hybrid quantum-classical learning.", 'abstract_zh': '量子参数调整（QPA）在注意力多卷积门循环单元模型中的高效台风轨迹预测', 'title_zh': '量子增强的参数高效学习应用于台风路径预测'}
{'arxiv_id': 'arXiv:2505.09393', 'title': 'UMotion: Uncertainty-driven Human Motion Estimation from Inertial and Ultra-wideband Units', 'authors': 'Huakun Liu, Hiroki Ota, Xin Wei, Yutaro Hirao, Monica Perusquia-Hernandez, Hideaki Uchiyama, Kiyoshi Kiyokawa', 'link': 'https://arxiv.org/abs/2505.09393', 'abstract': 'Sparse wearable inertial measurement units (IMUs) have gained popularity for estimating 3D human motion. However, challenges such as pose ambiguity, data drift, and limited adaptability to diverse bodies persist. To address these issues, we propose UMotion, an uncertainty-driven, online fusing-all state estimation framework for 3D human shape and pose estimation, supported by six integrated, body-worn ultra-wideband (UWB) distance sensors with IMUs. UWB sensors measure inter-node distances to infer spatial relationships, aiding in resolving pose ambiguities and body shape variations when combined with anthropometric data. Unfortunately, IMUs are prone to drift, and UWB sensors are affected by body occlusions. Consequently, we develop a tightly coupled Unscented Kalman Filter (UKF) framework that fuses uncertainties from sensor data and estimated human motion based on individual body shape. The UKF iteratively refines IMU and UWB measurements by aligning them with uncertain human motion constraints in real-time, producing optimal estimates for each. Experiments on both synthetic and real-world datasets demonstrate the effectiveness of UMotion in stabilizing sensor data and the improvement over state of the art in pose accuracy.', 'abstract_zh': '基于不确定性驱动的在线多状态融合估计算法的3D人体运动及形态估计', 'title_zh': 'UMotion: 基于不确定性的人体运动估计方法从惯性单元和超宽带单元'}
{'arxiv_id': 'arXiv:2505.09382', 'title': 'The Voice Timbre Attribute Detection 2025 Challenge Evaluation Plan', 'authors': 'Zhengyan Sheng, Jinghao He, Liping Chen, Kong Aik Lee, Zhen-Hua Ling', 'link': 'https://arxiv.org/abs/2505.09382', 'abstract': "Voice timbre refers to the unique quality or character of a person's voice that distinguishes it from others as perceived by human hearing. The Voice Timbre Attribute Detection (VtaD) 2025 challenge focuses on explaining the voice timbre attribute in a comparative manner. In this challenge, the human impression of voice timbre is verbalized with a set of sensory descriptors, including bright, coarse, soft, magnetic, and so on. The timbre is explained from the comparison between two voices in their intensity within a specific descriptor dimension. The VtaD 2025 challenge starts in May and culminates in a special proposal at the NCMMSC2025 conference in October 2025 in Zhenjiang, China.", 'abstract_zh': 'Voice Timbre 属性检测 (VtaD 2025) 挑战专注于比较性地解释声音色彩属性。在该挑战中，人类对声音色彩的印象通过一系列表征形容词，如明亮、粗糙、柔软、磁性等，予以口头化。声音色彩在特定描述维度内的强度对比来予以解释。VtaD 2025 挑战于5月启动，并将于2025年10月在中国镇江举行的NCMMSC2025会议上提交特别提案。', 'title_zh': '2025年度语音音色属性检测挑战赛评估计划'}
{'arxiv_id': 'arXiv:2505.09380', 'title': 'Examining Deployment and Refinement of the VIOLA-AI Intracranial Hemorrhage Model Using an Interactive NeoMedSys Platform', 'authors': 'Qinghui Liu, Jon Nesvold, Hanna Raaum, Elakkyen Murugesu, Martin Røvang, Bradley J Maclntosh, Atle Bjørnerud, Karoline Skogen', 'link': 'https://arxiv.org/abs/2505.09380', 'abstract': 'Background: There are many challenges and opportunities in the clinical deployment of AI tools in radiology. The current study describes a radiology software platform called NeoMedSys that can enable efficient deployment and refinements of AI models. We evaluated the feasibility and effectiveness of running NeoMedSys for three months in real-world clinical settings and focused on improvement performance of an in-house developed AI model (VIOLA-AI) designed for intracranial hemorrhage (ICH) detection.\nMethods: NeoMedSys integrates tools for deploying, testing, and optimizing AI models with a web-based medical image viewer, annotation system, and hospital-wide radiology information systems. A pragmatic investigation was deployed using clinical cases of patients presenting to the largest Emergency Department in Norway (site-1) with suspected traumatic brain injury (TBI) or patients with suspected stroke (site-2). We assessed ICH classification performance as VIOLA-AI encountered new data and underwent pre-planned model retraining. Performance metrics included sensitivity, specificity, accuracy, and the area under the receiver operating characteristic curve (AUC).\nResults: NeoMedSys facilitated iterative improvements in the AI model, significantly enhancing its diagnostic accuracy. Automated bleed detection and segmentation were reviewed in near real-time to facilitate re-training VIOLA-AI. The iterative refinement process yielded a marked improvement in classification sensitivity, rising to 90.3% (from 79.2%), and specificity that reached 89.3% (from 80.7%). The bleed detection ROC analysis for the entire sample demonstrated a high area-under-the-curve (AUC) of 0.949 (from 0.873). Model refinement stages were associated with notable gains, highlighting the value of real-time radiologist feedback.', 'abstract_zh': '背景：人工智能工具在放射学临床部署中面临着诸多挑战和机遇。本研究描述了一个名为NeoMedSys的放射学软件平台，该平台能够实现AI模型的高效部署和优化。我们评估了在挪威最大的紧急部门（站点-1）和疑似脑卒中患者（站点-2）的临床环境中运行NeoMedSys三个月的可行性和有效性，并重点关注了内部开发的针对颅内出血检测的AI模型（VIOLA-AI）的性能改进。', 'title_zh': '基于Interactive NeoMedSys平台的VIOLA-AI颅内出血模型的部署与精炼研究'}
{'arxiv_id': 'arXiv:2505.09371', 'title': 'TensorRL-QAS: Reinforcement learning with tensor networks for scalable quantum architecture search', 'authors': 'Akash Kundu, Stefano Mangini', 'link': 'https://arxiv.org/abs/2505.09371', 'abstract': 'Variational quantum algorithms hold the promise to address meaningful quantum problems already on noisy intermediate-scale quantum hardware, but they face the challenge of designing quantum circuits that both solve the target problem and comply with device limitations. Quantum architecture search (QAS) automates this design process, with reinforcement learning (RL) emerging as a promising approach. Yet, RL-based QAS methods encounter significant scalability issues, as computational and training costs grow rapidly with the number of qubits, circuit depth, and noise, severely impacting performance. To address these challenges, we introduce $\\textit{TensorRL-QAS}$, a scalable framework that combines tensor network (TN) methods with RL for designing quantum circuits. By warm-starting the architecture search with a matrix product state approximation of the target solution, TensorRL-QAS effectively narrows the search space to physically meaningful circuits, accelerating convergence to the desired solution. Tested on several quantum chemistry problems of up to 12-qubit, TensorRL-QAS achieves up to a 10-fold reduction in CNOT count and circuit depth compared to baseline methods, while maintaining or surpassing chemical accuracy. It reduces function evaluations by up to 100-fold, accelerates training episodes by up to $98\\%$, and achieves up to $50\\%$ success probability for 10-qubit systems-far exceeding the $<1\\%$ rates of baseline approaches. Robustness and versatility are demonstrated both in the noiseless and noisy scenarios, where we report a simulation of up to 8-qubit. These advancements establish TensorRL-QAS as a promising candidate for a scalable and efficient quantum circuit discovery protocol on near-term quantum hardware.', 'abstract_zh': 'TensorRL-QAS：一种用于近期内量子硬件的可扩展高效量子电路发现协议', 'title_zh': '张量RL-QAS: 基于张量网络的可扩展量子架构搜索 reinforcement learning方法'}
{'arxiv_id': 'arXiv:2505.09344', 'title': 'GreenFactory: Ensembling Zero-Cost Proxies to Estimate Performance of Neural Networks', 'authors': 'Gabriel Cortês, Nuno Lourenço, Paolo Romano, Penousal Machado', 'link': 'https://arxiv.org/abs/2505.09344', 'abstract': "Determining the performance of a Deep Neural Network during Neural Architecture Search processes is essential for identifying optimal architectures and hyperparameters. Traditionally, this process requires training and evaluation of each network, which is time-consuming and resource-intensive. Zero-cost proxies estimate performance without training, serving as an alternative to traditional training. However, recent proxies often lack generalization across diverse scenarios and provide only relative rankings rather than predicted accuracies. To address these limitations, we propose GreenFactory, an ensemble of zero-cost proxies that leverages a random forest regressor to combine multiple predictors' strengths and directly predict model test accuracy. We evaluate GreenFactory on NATS-Bench, achieving robust results across multiple datasets. Specifically, GreenFactory achieves high Kendall correlations on NATS-Bench-SSS, indicating substantial agreement between its predicted scores and actual performance: 0.907 for CIFAR-10, 0.945 for CIFAR-100, and 0.920 for ImageNet-16-120. Similarly, on NATS-Bench-TSS, we achieve correlations of 0.921 for CIFAR-10, 0.929 for CIFAR-100, and 0.908 for ImageNet-16-120, showcasing its reliability in both search spaces.", 'abstract_zh': '确定深度神经网络在神经架构搜索过程中的性能对于识别最优架构和超参数至关重要。传统方法需要对每个网络进行训练和评估，这一过程耗时且资源密集。零成本代理可以通过无需训练的方式估计性能，成为传统训练的替代方案。然而，最近的代理在不同场景下的泛化能力往往不足，只能提供相对排名而非预测准确率。为解决这些问题，我们提出GreenFactory，这是一种结合随机森林回归器的零成本代理ensemble，利用多种预测器的优势直接预测模型测试准确率。我们基于NATS-Bench评估GreenFactory，结果显示其在多个数据集上具有稳健的结果。具体而言，GreenFactory在NATS-Bench-SSS上实现了高Kendall相关性，表明其预测分数与实际性能有显著的一致性：CIFAR-10为0.907，CIFAR-100为0.945，ImageNet-16-120为0.920。同样，在NATS-Bench-TSS上，我们得到的CIFAR-10为0.921，CIFAR-100为0.929，ImageNet-16-120为0.908，展示了其在两个搜索空间中的可靠性。', 'title_zh': 'GreenFactory: 组合零开销代理以估计神经网络性能'}
{'arxiv_id': 'arXiv:2505.09342', 'title': 'Evaluating the Robustness of Adversarial Defenses in Malware Detection Systems', 'authors': 'Mostafa Jafari, Alireza Shameli-Sendi', 'link': 'https://arxiv.org/abs/2505.09342', 'abstract': 'Machine learning is a key tool for Android malware detection, effectively identifying malicious patterns in apps. However, ML-based detectors are vulnerable to evasion attacks, where small, crafted changes bypass detection. Despite progress in adversarial defenses, the lack of comprehensive evaluation frameworks in binary-constrained domains limits understanding of their robustness. We introduce two key contributions. First, Prioritized Binary Rounding, a technique to convert continuous perturbations into binary feature spaces while preserving high attack success and low perturbation size. Second, the sigma-binary attack, a novel adversarial method for binary domains, designed to achieve attack goals with minimal feature changes. Experiments on the Malscan dataset show that sigma-binary outperforms existing attacks and exposes key vulnerabilities in state-of-the-art defenses. Defenses equipped with adversary detectors, such as KDE, DLA, DNN+, and ICNN, exhibit significant brittleness, with attack success rates exceeding 90% using fewer than 10 feature modifications and reaching 100% with just 20. Adversarially trained defenses, including AT-rFGSM-k, AT-MaxMA, improves robustness under small budgets but remains vulnerable to unrestricted perturbations, with attack success rates of 99.45% and 96.62%, respectively. Although PAD-SMA demonstrates strong robustness against state-of-the-art gradient-based adversarial attacks by maintaining an attack success rate below 16.55%, the sigma-binary attack significantly outperforms these methods, achieving a 94.56% success rate under unrestricted perturbations. These findings highlight the critical need for precise method like sigma-binary to expose hidden vulnerabilities in existing defenses and support the development of more resilient malware detection systems.', 'abstract_zh': '机器学习是Android恶意软件检测的关键工具，有效识别应用中的恶意模式。然而，基于ML的检测器易受规避攻击的影响，即通过微小、精制的更改绕过检测。尽管在对抗性防御方面取得了进展，但在二进制受限领域缺乏全面的评估框架限制了对它们鲁棒性的理解。我们引入了两项关键技术贡献。首先，优先级二进制舍入技术，该技术能够在保持高攻击成功率和低扰动规模的同时，将连续扰动转换为二进制特征空间。其次，Sigma-Binary攻击，这是一种针对二进制领域的新型对抗性方法，旨在通过最小的特征变化实现攻击目标。实验表明，Sigma-Binary攻击优于现有攻击方法，并揭示了先进防御方法的关键漏洞。配备对抗性检测器的防御措施，如KDE、DLA、DNN+和ICNN，在不超过10个特征修改的情况下，攻击成功率超过90%，使用仅20个特征修改即可达到100%。对抗性训练的防御措施，包括AT-rFGSM-k和AT-MaxMA，在预算较小的情况下提高了鲁棒性，但仍对无限制扰动易受攻击，其攻击成功率分别为99.45%和96.62%。尽管PAD-SMA通过保持攻击成功率低于16.55%展示了对最先进的基于梯度的对抗性攻击的强鲁棒性，但Sigma-Binary攻击在无限制扰动下仍显著优于这些方法，攻击成功率达到94.56%。这些发现强调了迫切需要精确的方法如Sigma-Binary来揭示现有防御措施中的隐藏漏洞，并支持更坚resilient的恶意软件检测系统的开发。', 'title_zh': '评估恶意软件检测系统中对抗防御的 robustness'}
{'arxiv_id': 'arXiv:2505.09295', 'title': 'Toward Fair Federated Learning under Demographic Disparities and Data Imbalance', 'authors': 'Qiming Wu, Siqi Li, Doudou Zhou, Nan Liu', 'link': 'https://arxiv.org/abs/2505.09295', 'abstract': 'Ensuring fairness is critical when applying artificial intelligence to high-stakes domains such as healthcare, where predictive models trained on imbalanced and demographically skewed data risk exacerbating existing disparities. Federated learning (FL) enables privacy-preserving collaboration across institutions, but remains vulnerable to both algorithmic bias and subgroup imbalance - particularly when multiple sensitive attributes intersect. We propose FedIDA (Fed erated Learning for Imbalance and D isparity A wareness), a framework-agnostic method that combines fairness-aware regularization with group-conditional oversampling. FedIDA supports multiple sensitive attributes and heterogeneous data distributions without altering the convergence behavior of the underlying FL algorithm. We provide theoretical analysis establishing fairness improvement bounds using Lipschitz continuity and concentration inequalities, and show that FedIDA reduces the variance of fairness metrics across test sets. Empirical results on both benchmark and real-world clinical datasets confirm that FedIDA consistently improves fairness while maintaining competitive predictive performance, demonstrating its effectiveness for equitable and privacy-preserving modeling in healthcare. The source code is available on GitHub.', 'abstract_zh': '确保公平性是将人工智能应用于高 stakes 领域（如医疗保健）时的关键，这些领域中的预测模型若基于不平衡和人口结构偏差的数据进行训练，可能会加剧现有的不平等。联邦学习（FL）可在机构间实现隐私保护的合作，但仍易受算法偏见和子组不平衡的影响，特别是在多个敏感属性相交的情况下。我们提出了一种名为 FedIDA（联邦学习中的不平衡与不平等意识）的框架无损方法，该方法结合了公平性意识正则化与分组条件过采样。FedIDA 支持多个敏感属性和异质数据分布，而不改变基础 FL 算法的收敛行为。我们通过 Lipschitz 连续性和集中不等式提供了理论分析，确立了公平性改进的界限，并证明 FedIDA 降低了公平性度量在测试集上的方差。基准数据集和实际临床数据集上的实证结果确认，FedIDA 一致地提高了公平性同时保持了竞争力的预测性能，展示了其在医疗保健中实现公平性和隐私保护建模的有效性。源代码可在 GitHub 上获取。', 'title_zh': '面向人口统计差异和数据不平衡的公平联邦学习'}
{'arxiv_id': 'arXiv:2505.09263', 'title': 'Few-Shot Anomaly-Driven Generation for Anomaly Classification and Segmentation', 'authors': 'Guan Gui, Bin-Bin Gao, Jun Liu, Chengjie Wang, Yunsheng Wu', 'link': 'https://arxiv.org/abs/2505.09263', 'abstract': 'Anomaly detection is a practical and challenging task due to the scarcity of anomaly samples in industrial inspection. Some existing anomaly detection methods address this issue by synthesizing anomalies with noise or external data. However, there is always a large semantic gap between synthetic and real-world anomalies, resulting in weak performance in anomaly detection. To solve the problem, we propose a few-shot Anomaly-driven Generation (AnoGen) method, which guides the diffusion model to generate realistic and diverse anomalies with only a few real anomalies, thereby benefiting training anomaly detection models. Specifically, our work is divided into three stages. In the first stage, we learn the anomaly distribution based on a few given real anomalies and inject the learned knowledge into an embedding. In the second stage, we use the embedding and given bounding boxes to guide the diffusion model to generate realistic and diverse anomalies on specific objects (or textures). In the final stage, we propose a weakly-supervised anomaly detection method to train a more powerful model with generated anomalies. Our method builds upon DRAEM and DesTSeg as the foundation model and conducts experiments on the commonly used industrial anomaly detection dataset, MVTec. The experiments demonstrate that our generated anomalies effectively improve the model performance of both anomaly classification and segmentation tasks simultaneously, \\eg, DRAEM and DseTSeg achieved a 5.8\\% and 1.5\\% improvement in AU-PR metric on segmentation task, respectively. The code and generated anomalous data are available at this https URL.', 'abstract_zh': '基于少量真实异常样本的自驱动生成 Few-Shot Anomaly-Driven Generation (AnoGen) 方法研究', 'title_zh': '基于异常驱动的少样本生成方法用于异常分类和分割'}
{'arxiv_id': 'arXiv:2505.09262', 'title': 'EDBench: Large-Scale Electron Density Data for Molecular Modeling', 'authors': 'Hongxin Xiang, Ke Li, Mingquan Liu, Zhixiang Cheng, Bin Yao, Wenjie Du, Jun Xia, Li Zeng, Xin Jin, Xiangxiang Zeng', 'link': 'https://arxiv.org/abs/2505.09262', 'abstract': 'Existing molecular machine learning force fields (MLFFs) generally focus on the learning of atoms, molecules, and simple quantum chemical properties (such as energy and force), but ignore the importance of electron density (ED) $\\rho(r)$ in accurately understanding molecular force fields (MFFs). ED describes the probability of finding electrons at specific locations around atoms or molecules, which uniquely determines all ground state properties (such as energy, molecular structure, etc.) of interactive multi-particle systems according to the Hohenberg-Kohn theorem. However, the calculation of ED relies on the time-consuming first-principles density functional theory (DFT) which leads to the lack of large-scale ED data and limits its application in MLFFs. In this paper, we introduce EDBench, a large-scale, high-quality dataset of ED designed to advance learning-based research at the electronic scale. Built upon the PCQM4Mv2, EDBench provides accurate ED data, covering 3.3 million molecules. To comprehensively evaluate the ability of models to understand and utilize electronic information, we design a suite of ED-centric benchmark tasks spanning prediction, retrieval, and generation. Our evaluation on several state-of-the-art methods demonstrates that learning from EDBench is not only feasible but also achieves high accuracy. Moreover, we show that learning-based method can efficiently calculate ED with comparable precision while significantly reducing the computational cost relative to traditional DFT calculations. All data and benchmarks from EDBench will be freely available, laying a robust foundation for ED-driven drug discovery and materials science.', 'abstract_zh': '现有的分子机器学习力场（MLFF）通常集中于原子、分子以及简单量子化学性质（如能量和力）的学习，而忽视了电子密度（ED）$\\rho(r)$在准确理解分子力场（MFF）中的重要性。ED描述了在原子或分子周围特定位置找到电子的概率，根据霍恩贝格-考恩定理，ED唯一确定了相互作用多粒子系统的所有基态性质（如能量、分子结构等）。然而，ED的计算依赖于耗时的原始原理密度泛函理论（DFT），这导致了大规模ED数据的缺乏，限制了其在MLFF中的应用。本文介绍了EDBench，一个大规模、高质量的ED数据集，旨在推动电子尺度的学习研究。基于PCQM4Mv2构建，EDBench提供了330万分子的精确ED数据。为了全面评估模型理解并利用电子信息的能力，我们设计了一系列以ED为中心的基准任务，涵盖预测、检索和生成。在几种前沿方法的评估中，我们证明从EDBench学习不仅是可行的，而且具有很高的准确性。此外，我们还展示了基于学习的方法可以高效地计算ED，精度与传统DFT计算相当，同时显著降低了计算成本。EDBench的所有数据和基准将免费提供，为基于ED的药物发现和材料科学奠定坚实的基础。', 'title_zh': 'EDBench: 大规模电子密度数据集用于分子建模'}
{'arxiv_id': 'arXiv:2505.09246', 'title': 'Focus, Merge, Rank: Improved Question Answering Based on Semi-structured Knowledge Bases', 'authors': 'Derian Boer, Stephen Roth, Stefan Kramer', 'link': 'https://arxiv.org/abs/2505.09246', 'abstract': 'In many real-world settings, machine learning models and interactive systems have access to both structured knowledge, e.g., knowledge graphs or tables, and unstructured content, e.g., natural language documents. However, most rely on either. Semi-Structured Knowledge Bases (SKBs) bridge this gap by linking unstructured content to nodes within structured data, thereby enabling new strategies for knowledge access and use. In this work, we present FocusedRetriever, a modular SKB-based framework for multi-hop question answering. It integrates components (VSS-based entity search, LLM-based generation of Cypher queries and pairwise re-ranking) in a way that enables it to outperform state-of-the-art methods across all three STaRK benchmark test sets, covering diverse domains and multiple performance metrics. The average first-hit rate exceeds that of the second-best method by 25.7%. FocusedRetriever leverages (1) the capacity of Large Language Models (LLMs) to extract relational facts and entity attributes from unstructured text, (2) node set joins to filter answer candidates based on these extracted triplets and constraints, (3) vector similarity search to retrieve and rank relevant unstructured content, and (4) the contextual capabilities of LLMs to finally rank the top-k answers. For generality, we only incorporate base LLMs in FocusedRetriever in our evaluation. However, our analysis of intermediate results highlights several opportunities for further upgrades including finetuning. The source code is publicly available at this https URL .', 'abstract_zh': '半结构化知识库中的多跳问答框架：FocusRetriever', 'title_zh': '聚焦、合并、排序：基于半结构化知识库的改进问答系统'}
{'arxiv_id': 'arXiv:2505.09208', 'title': 'Educational impacts of generative artificial intelligence on learning and performance of engineering students in China', 'authors': 'Lei Fan, Kunyang Deng, Fangxue Liu', 'link': 'https://arxiv.org/abs/2505.09208', 'abstract': "With the rapid advancement of generative artificial intelligence(AI), its potential applications in higher education have attracted significant attention. This study investigated how 148 students from diverse engineering disciplines and regions across China used generative AI, focusing on its impact on their learning experience and the opportunities and challenges it poses in engineering education. Based on the surveyed data, we explored four key areas: the frequency and application scenarios of AI use among engineering students, its impact on students' learning and performance, commonly encountered challenges in using generative AI, and future prospects for its adoption in engineering education. The results showed that more than half of the participants reported a positive impact of generative AI on their learning efficiency, initiative, and creativity, with nearly half believing it also enhanced their independent thinking. However, despite acknowledging improved study efficiency, many felt their actual academic performance remained largely unchanged and expressed concerns about the accuracy and domain-specific reliability of generative AI. Our findings provide a first-hand insight into the current benefits and challenges generative AI brings to students, particularly Chinese engineering students, while offering several recommendations, especially from the students' perspective, for effectively integrating generative AI into engineering education.", 'abstract_zh': '随着生成式人工智能的迅速发展，其在高等教育中的潜在应用引起了广泛关注。本研究调查了来自中国不同工程学科和地区共148名学生的生成式人工智能使用情况，重点关注其对学生学习体验的影响以及在工程教育中带来的机遇和挑战。基于调查数据，我们探讨了四个关键领域：工程学生使用人工智能的频率和应用场景、其对学生学习和表现的影响、使用生成式人工智能时遇到的常见挑战以及该技术在未来工程教育中的应用前景。研究结果显示，超过一半的参与者报告称生成式人工智能对其学习效率、积极性和创造性产生了积极影响，近半数学生认为它还增强了他们的独立思考能力。尽管许多学生认可了学习效率的提升，但仍有学生担心生成式人工智能的准确性和学科特定的可靠性并没有显著变化。我们的研究提供了关于生成式人工智能当前对学生，特别是中国工程学生带来的益处和挑战的第一手见解，并从学生视角提出了几条关于如何有效将生成式人工智能融入工程教育的建议。', 'title_zh': '生成式人工智能对中国工程学生学习与performance影响的研究'}
{'arxiv_id': 'arXiv:2505.09203', 'title': 'InvDesFlow-AL: Active Learning-based Workflow for Inverse Design of Functional Materials', 'authors': 'Xiao-Qi Han, Peng-Jie Guo, Ze-Feng Gao, Hao Sun, Zhong-Yi Lu', 'link': 'https://arxiv.org/abs/2505.09203', 'abstract': 'Developing inverse design methods for functional materials with specific properties is critical to advancing fields like renewable energy, catalysis, energy storage, and carbon capture. Generative models based on diffusion principles can directly produce new materials that meet performance constraints, thereby significantly accelerating the material design process. However, existing methods for generating and predicting crystal structures often remain limited by low success rates. In this work, we propose a novel inverse material design generative framework called InvDesFlow-AL, which is based on active learning strategies. This framework can iteratively optimize the material generation process to gradually guide it towards desired performance characteristics. In terms of crystal structure prediction, the InvDesFlow-AL model achieves an RMSE of 0.0423 Å, representing an 32.96% improvement in performance compared to exsisting generative models. Additionally, InvDesFlow-AL has been successfully validated in the design of low-formation-energy and low-Ehull materials. It can systematically generate materials with progressively lower formation energies while continuously expanding the exploration across diverse chemical spaces. These results fully demonstrate the effectiveness of the proposed active learning-driven generative model in accelerating material discovery and inverse design. To further prove the effectiveness of this method, we took the search for BCS superconductors under ambient pressure as an example explored by InvDesFlow-AL. As a result, we successfully identified Li\\(_2\\)AuH\\(_6\\) as a conventional BCS superconductor with an ultra-high transition temperature of 140 K. This discovery provides strong empirical support for the application of inverse design in materials science.', 'abstract_zh': '开发具有特定性能功能材料的逆向设计方法对于推动可再生能源、催化、能量存储和碳捕获等领域的发展至关重要。基于扩散原理的生成模型可以直接生成满足性能约束的新材料，从而显著加速材料设计过程。然而，现有结构生成和预测方法往往受限于较低的成功率。在这项工作中，我们提出了一种基于主动学习策略的新型逆向材料设计生成框架InvDesFlow-AL。该框架可以迭代优化材料生成过程，逐步引导其向所需的性能特性发展。在晶体结构预测方面，InvDesFlow-AL模型实现了0.0423 Å的RMSE，相比于现有生成模型，性能提高了32.96%。此外，InvDesFlow-AL已在低形成能和低Ehull材料的设计中成功验证。它可以系统地生成形成能逐步降低的材料，同时不断扩展对不同化学空间的探索。这些结果充分证明了所提出的主动学习驱动生成模型在加速材料发现和逆向设计方面的有效性。为了进一步证明该方法的有效性，我们通过InvDesFlow-AL探索了在常压下寻找BCS超导体的例子，成功识别出Li<sub>2</sub>AuH<sub>6</sub>作为具有超高温跃迁温度140 K的常规BCS超导体。这一发现为逆向设计在材料科学中的应用提供了强有力的实证支持。\n\n开发具有特定性能的功能材料的逆向设计方法对推动可再生能源、催化、能源存储和碳捕捉等领域的发展至关重要。基于扩散原理的生成模型可以直接生成满足性能约束的新材料，从而显著加速材料设计过程。然而，现有方法在生成和预测晶体结构方面的成功率往往受限。本文提出了一种基于主动学习策略的新型逆向材料设计生成框架InvDesFlow-AL。该框架能够迭代优化材料生成过程，逐步引导其朝向所需性能特征。在晶体结构预测方面，InvDesFlow-AL模型的RMSE达到0.0423 Å，相比现有生成模型提高了32.96%。此外，InvDesFlow-AL已成功应用于低形成能和低Ehull材料的设计中。它能够系统地生成形成能逐步降低的材料，同时不断扩大对多样化化学空间的探索。这些结果充分展示了所提出的主动学习驱动生成模型在加速材料发现和逆向设计方面的有效性。为证明该方法的有效性，我们通过InvDesFlow-AL探索了常压下寻找BCS超导体的例子，成功识别出Li<sub>2</sub>AuH<sub>6</sub>作为具有超高温跃迁温度140 K的常规BCS超导体。这一发现为逆向设计在材料科学中的应用提供了强有力的实证支持。', 'title_zh': '基于主动学习的功能材料逆向设计工作流：InvDesFlow-AL'}
{'arxiv_id': 'arXiv:2505.09166', 'title': 'An Initial Exploration of Default Images in Text-to-Image Generation', 'authors': 'Hannu Simonen, Atte Kiviniemi, Jonas Oppenlaender', 'link': 'https://arxiv.org/abs/2505.09166', 'abstract': 'In the creative practice of text-to-image generation (TTI), images are generated from text prompts. However, TTI models are trained to always yield an output, even if the prompt contains unknown terms. In this case, the model may generate what we call "default images": images that closely resemble each other across many unrelated prompts. We argue studying default images is valuable for designing better solutions for TTI and prompt engineering. In this paper, we provide the first investigation into default images on Midjourney, a popular image generator. We describe our systematic approach to create input prompts triggering default images, and present the results of our initial experiments and several small-scale ablation studies. We also report on a survey study investigating how default images affect user satisfaction. Our work lays the foundation for understanding default images in TTI and highlights challenges and future research directions.', 'abstract_zh': '在文本生成图像的创作实践中，图像根据文本提示生成。然而，TTI模型在提示中包含未知术语时仍会被训练产出输出，这可能导致生成我们称之为“默认图像”的相似图像。我们主张研究默认图像对于设计更好的TTI解决方案和提示工程具有重要意义。在本文中，我们首次针对Midjourney这一流行的图像生成器进行默认图像的研究。我们描述了一种系统的方法以触发默认图像的输入提示，并展示了初步实验及若干小型消融研究的结果。我们还报告了一项关于默认图像如何影响用户满意度的调查研究。我们的工作为理解TTI中的默认图像奠定了基础，并指出了挑战和未来的研究方向。', 'title_zh': '文本生成图像中默认图片的初步探索'}
{'arxiv_id': 'arXiv:2505.09160', 'title': 'A Multi-Task Foundation Model for Wireless Channel Representation Using Contrastive and Masked Autoencoder Learning', 'authors': 'Berkay Guler, Giovanni Geraci, Hamid Jafarkhani', 'link': 'https://arxiv.org/abs/2505.09160', 'abstract': 'Current applications of self-supervised learning to wireless channel representation often borrow paradigms developed for text and image processing, without fully addressing the unique characteristics and constraints of wireless communications. Aiming to fill this gap, we first propose WiMAE (Wireless Masked Autoencoder), a transformer-based encoder-decoder foundation model pretrained on a realistic open-source multi-antenna wireless channel dataset. Building upon this foundation, we develop ContraWiMAE, which enhances WiMAE by incorporating a contrastive learning objective alongside the reconstruction task in a unified multi-task framework. By warm-starting from pretrained WiMAE weights and generating positive pairs via noise injection, the contrastive component enables the model to capture both structural and discriminative features, enhancing representation quality beyond what reconstruction alone can achieve. Through extensive evaluation on unseen scenarios, we demonstrate the effectiveness of both approaches across multiple downstream tasks, with ContraWiMAE showing further improvements in linear separability and adaptability in diverse wireless environments. Comparative evaluations against a state-of-the-art wireless channel foundation model confirm the superior performance and data efficiency of our models, highlighting their potential as powerful baselines for future research in self-supervised wireless channel representation learning.', 'abstract_zh': '当前自监督学习在无线信道表示中的应用往往借鉴了文本和图像处理领域的 paradigms，而未能充分考虑无线通信的独特特性和约束。为了填补这一空白，我们首先提出了 WiMAE（无线掩码自编码器），这是一种基于变换器的编码器-解码器基础模型，预训练于一个现实的开源多天线无线信道数据集中。在此基础上，我们开发了 ContraWiMAE，通过在其统一的多任务框架中结合对比学习目标和重构任务来增强 WiMAE。基于预训练的 WiMAE 权重并通过噪声注入生成正样本对，对比学习组件使模型能够捕获结构化和区分性的特征，从而超越单纯重构所能实现的表示质量。通过在未见场景中的广泛评估，我们展示了这两种方法在多个下游任务中的有效性，ContraWiMAE 在线性可分性和多种无线环境下的适应性上进一步表现出改进。与最先进的无线信道基础模型的对比评估证实了我们模型的优越性能和高效性，突显了它们作为未来自监督无线信道表示学习研究中强大基线的潜力。', 'title_zh': '基于对比学习和掩蔽自编码器的多任务基础模型无线信道表示'}
{'arxiv_id': 'arXiv:2505.09131', 'title': 'Fair Clustering via Alignment', 'authors': 'Kunwoong Kim, Jihu Lee, Sangchul Park, Yongdai Kim', 'link': 'https://arxiv.org/abs/2505.09131', 'abstract': 'Algorithmic fairness in clustering aims to balance the proportions of instances assigned to each cluster with respect to a given sensitive attribute. While recently developed fair clustering algorithms optimize clustering objectives under specific fairness constraints, their inherent complexity or approximation often results in suboptimal clustering utility or numerical instability in practice. To resolve these limitations, we propose a new fair clustering algorithm based on a novel decomposition of the fair K-means clustering objective function. The proposed algorithm, called Fair Clustering via Alignment (FCA), operates by alternately (i) finding a joint probability distribution to align the data from different protected groups, and (ii) optimizing cluster centers in the aligned space. A key advantage of FCA is that it theoretically guarantees approximately optimal clustering utility for any given fairness level without complex constraints, thereby enabling high-utility fair clustering in practice. Experiments show that FCA outperforms existing methods by (i) attaining a superior trade-off between fairness level and clustering utility, and (ii) achieving near-perfect fairness without numerical instability.', 'abstract_zh': '聚类中的算法公平性旨在根据给定的敏感属性平衡分配给每个簇的实例比例。虽然最近开发的公平聚类算法在特定公平性约束下优化聚类目标，但其固有的复杂性或近似性往往导致实际中的聚类效果不佳或数值不稳定。为了解决这些局限性，我们提出了一种基于公平K均值聚类目标函数新型分解的新公平聚类算法。该算法称为对齐导向公平聚类（FCA），通过交替进行（i）找到一个联合概率分布以对齐不同受保护群组的数据，以及（ii）在对齐空间中优化簇中心，来进行操作。FCA的一个关键优势是，它理论上能够在任何给定的公平水平下保证近似最优的聚类效果，从而在实践中实现高效益的公平聚类。实验结果表明，FCA在（i）公平水平与聚类效果之间的权衡表现更优，以及（ii）实现接近完美的公平性同时避免数值不稳定方面优于现有方法。', 'title_zh': '公平聚类Via对齐'}
{'arxiv_id': 'arXiv:2505.09129', 'title': 'WSCIF: A Weakly-Supervised Color Intelligence Framework for Tactical Anomaly Detection in Surveillance Keyframes', 'authors': 'Wei Meng', 'link': 'https://arxiv.org/abs/2505.09129', 'abstract': 'The deployment of traditional deep learning models in high-risk security tasks in an unlabeled, data-non-exploitable video intelligence environment faces significant challenges. In this paper, we propose a lightweight anomaly detection framework based on color features for surveillance video clips in a high sensitivity tactical mission, aiming to quickly identify and interpret potential threat events under resource-constrained and data-sensitive conditions. The method fuses unsupervised KMeans clustering with RGB channel histogram modeling to achieve composite detection of structural anomalies and color mutation signals in key frames. The experiment takes an operation surveillance video occurring in an African country as a research sample, and successfully identifies multiple highly anomalous frames related to high-energy light sources, target presence, and reflective interference under the condition of no access to the original data. The results show that this method can be effectively used for tactical assassination warning, suspicious object screening and environmental drastic change monitoring with strong deployability and tactical interpretation value. The study emphasizes the importance of color features as low semantic battlefield signal carriers, and its battlefield intelligent perception capability will be further extended by combining graph neural networks and temporal modeling in the future.', 'abstract_zh': '传统的深度学习模型在无标签、数据不可利用的高风险安全任务视频智能环境中部署面临显著挑战。本文提出了一种基于颜色特征的轻量级异常检测框架，旨在在资源受限和数据敏感条件下，快速识别和解释关键帧中的潜在威胁事件。该方法将无监督KMeans聚类与RGB通道直方图建模融合，以实现结构异常和颜色突变信号的综合检测。实验以非洲某国的作战 surveillance 视频作为研究样本，在无法访问原始数据的情况下，成功识别了多个与高能光源、目标存在及反射干扰高度异常的帧。结果表明，该方法在战术暗杀预警、可疑目标筛查和环境急剧变化监控方面具有较强的部署能力和战术解释价值。研究强调了颜色特征作为低语义战场信号载体的重要性，并指出未来将通过结合图神经网络和时序建模进一步扩展其战场智能感知能力。', 'title_zh': 'WSCIF：一种弱监督颜色智能框架用于 surveillance 关键帧中的战术异常检测'}
{'arxiv_id': 'arXiv:2505.09115', 'title': 'PreCare: Designing AI Assistants for Advance Care Planning (ACP) to Enhance Personal Value Exploration, Patient Knowledge, and Decisional Confidence', 'authors': 'Yu Lun Hsu, Yun-Rung Chou, Chiao-Ju Chang, Yu-Cheng Chang, Zer-Wei Lee, Rokas Gipiškis, Rachel Li, Chih-Yuan Shih, Jen-Kuei Peng, Hsien-Liang Huang, Jaw-Shiun Tsai, Mike Y. Chen', 'link': 'https://arxiv.org/abs/2505.09115', 'abstract': "Advance Care Planning (ACP) allows individuals to specify their preferred end-of-life life-sustaining treatments before they become incapacitated by injury or terminal illness (e.g., coma, cancer, dementia). While online ACP offers high accessibility, it lacks key benefits of clinical consultations, including personalized value exploration, immediate clarification of decision consequences. To bridge this gap, we conducted two formative studies: 1) shadowed and interviewed 3 ACP teams consisting of physicians, nurses, and social workers (18 patients total), and 2) interviewed 14 users of ACP websites. Building on these insights, we designed PreCare in collaboration with 6 ACP professionals. PreCare is a website with 3 AI-driven assistants designed to guide users through exploring personal values, gaining ACP knowledge, and supporting informed decision-making. A usability study (n=12) showed that PreCare achieved a System Usability Scale (SUS) rating of excellent. A comparative evaluation (n=12) showed that PreCare's AI assistants significantly improved exploration of personal values, knowledge, and decisional confidence, and was preferred by 92% of participants.", 'abstract_zh': 'Advance Care Planning (ACP) 允许个体在因伤或末期疾病（如昏迷、癌症、痴呆）而无法行动之前，指定其所需的終末期生命维持治疗。虽然在线 ACP 提供了高 accesibility，但它缺乏临床咨询的关键优势，包括个性化价值探索和即时澄清决策后果。为了弥补这一差距，我们进行了两项形式研究：1）跟踪并采访了 3 支由医生、护士和社会工作者组成的 ACP 团队（总共 18 名患者）；2）采访了使用 ACP 网站的 14 名用户。基于这些见解，我们与 6 名 ACP 专业人士合作设计了 PreCare。PreCare 是一个网站，包含 3 个 AI 驱动的助手，旨在引导用户探索个人价值观、获取 ACP 知识，并支持基于信息的决策。可用性研究（n=12）显示，PreCare 达到了优秀系统可用性量表 (SUS) 评分。对比评估（n=12）显示，PreCare 的 AI 助手显著提高了个人价值观探索、知识获取和决策信心，并且 92% 的参与者更偏向于 PreCare。', 'title_zh': 'PreCare: 设计AI辅助工具促进前期护理规划、提升个人价值观探索、患者知识及决策自信'}
{'arxiv_id': 'arXiv:2505.09091', 'title': 'DPN-GAN: Inducing Periodic Activations in Generative Adversarial Networks for High-Fidelity Audio Synthesis', 'authors': 'Zeeshan Ahmad, Shudi Bao, Meng Chen', 'link': 'https://arxiv.org/abs/2505.09091', 'abstract': "In recent years, generative adversarial networks (GANs) have made significant progress in generating audio sequences. However, these models typically rely on bandwidth-limited mel-spectrograms, which constrain the resolution of generated audio sequences, and lead to mode collapse during conditional generation. To address this issue, we propose Deformable Periodic Network based GAN (DPN-GAN), a novel GAN architecture that incorporates a kernel-based periodic ReLU activation function to induce periodic bias in audio generation. This innovative approach enhances the model's ability to capture and reproduce intricate audio patterns. In particular, our proposed model features a DPN module for multi-resolution generation utilizing deformable convolution operations, allowing for adaptive receptive fields that improve the quality and fidelity of the synthetic audio. Additionally, we enhance the discriminator network using deformable convolution to better distinguish between real and generated samples, further refining the audio quality. We trained two versions of the model: DPN-GAN small (38.67M parameters) and DPN-GAN large (124M parameters). For evaluation, we use five different datasets, covering both speech synthesis and music generation tasks, to demonstrate the efficiency of the DPN-GAN. The experimental results demonstrate that DPN-GAN delivers superior performance on both out-of-distribution and noisy data, showcasing its robustness and adaptability. Trained across various datasets, DPN-GAN outperforms state-of-the-art GAN architectures on standard evaluation metrics, and exhibits increased robustness in synthesized audio.", 'abstract_zh': '基于可变形周期网络的生成对抗网络（DPN-GAN）', 'title_zh': 'DPN-GAN：在生成对抗网络中诱导周期激活以实现高保真音频合成'}
{'arxiv_id': 'arXiv:2505.09021', 'title': 'AI-Mediated Code Comment Improvement', 'authors': 'Maria Dhakal, Chia-Yi Su, Robert Wallace, Chris Fakhimi, Aakash Bansal, Toby Li, Yu Huang, Collin McMillan', 'link': 'https://arxiv.org/abs/2505.09021', 'abstract': 'This paper describes an approach to improve code comments along different quality axes by rewriting those comments with customized Artificial Intelligence (AI)-based tools. We conduct an empirical study followed by grounded theory qualitative analysis to determine the quality axes to improve. Then we propose a procedure using a Large Language Model (LLM) to rewrite existing code comments along the quality axes. We implement our procedure using GPT-4o, then distil the results into a smaller model capable of being run in-house, so users can maintain data custody. We evaluate both our approach using GPT-4o and the distilled model versions. We show in an evaluation how our procedure improves code comments along the quality axes. We release all data and source code in an online repository for reproducibility.', 'abstract_zh': '本文描述了一种利用定制化人工智能工具重写代码注释以提高其在不同质量维度上的方法。我们通过实证研究结合扎根理论的定性分析确定了需提高的质量维度，然后提出了一种使用大规模语言模型（LLM）重写现有代码注释的程序。我们利用GPT-4o实现该程序，然后将其精简为可在内部运行的小型模型，以便用户保持数据控制权。我们分别评估了使用GPT-4o实现的方法及其精简模型版本。我们在评估中展示了该程序如何在不同质量维度上改进代码注释。我们将在一个在线仓库中发布所有数据和源代码，以实现可重复性。', 'title_zh': 'AI介导的代码注释改进'}
{'arxiv_id': 'arXiv:2505.08964', 'title': 'GPML: Graph Processing for Machine Learning', 'authors': 'Majed Jaber, Julien Michel, Nicolas Boutry, Pierre Parrend', 'link': 'https://arxiv.org/abs/2505.08964', 'abstract': 'The dramatic increase of complex, multi-step, and rapidly evolving attacks in dynamic networks involves advanced cyber-threat detectors. The GPML (Graph Processing for Machine Learning) library addresses this need by transforming raw network traffic traces into graph representations, enabling advanced insights into network behaviors. The library provides tools to detect anomalies in interaction and community shifts in dynamic networks. GPML supports community and spectral metrics extraction, enhancing both real-time detection and historical forensics analysis. This library supports modern cybersecurity challenges with a robust, graph-based approach.', 'abstract_zh': '动态网络中复杂、多步且快速演变的攻击激增 necessitates 高级网络威胁检测器。GPML（基于图的机器学习处理库）通过将原始网络流量轨迹转换为图表示，以应对这一需求，从而提供对网络行为的高级洞察。该库提供了检测动态网络中交互异常和社区转移的工具。GPML 支持社区和谱度量的提取，增强实时检测和历史取证分析能力。该库采用稳健的图基方法应对现代网络安全挑战。', 'title_zh': 'GPML: 图处理在机器学习中的应用'}
{'arxiv_id': 'arXiv:2505.08939', 'title': "Tracing the Invisible: Understanding Students' Judgment in AI-Supported Design Work", 'authors': 'Suchismita Naik, Prakash Shukla, Ike Obi, Jessica Backus, Nancy Rasche, Paul Parsons', 'link': 'https://arxiv.org/abs/2505.08939', 'abstract': 'As generative AI tools become integrated into design workflows, students increasingly engage with these tools not just as aids, but as collaborators. This study analyzes reflections from 33 student teams in an HCI design course to examine the kinds of judgments students make when using AI tools. We found both established forms of design judgment (e.g., instrumental, appreciative, quality) and emergent types: agency-distribution judgment and reliability judgment. These new forms capture how students negotiate creative responsibility with AI and assess the trustworthiness of its outputs. Our findings suggest that generative AI introduces new layers of complexity into design reasoning, prompting students to reflect not only on what AI produces, but also on how and when to rely on it. By foregrounding these judgments, we offer a conceptual lens for understanding how students engage in co-creative sensemaking with AI in design contexts.', 'abstract_zh': '随着生成式AI工具融入设计工作流程，学生越来越多地将这些工具视为合作伙伴而非仅仅是辅助工具。本研究分析了人机交互设计课程中33个学生团队的反思，以探讨学生在使用AI工具时所做的各种判断。我们发现了既有形式的设计判断（如工具性判断、欣赏性判断、质量判断）以及新兴类型：代理权分配判断和可靠性判断。这些新形式捕捉了学生与AI协商创意责任以及评估其输出可信度的方式。我们的研究结果表明，生成式AI为设计推理引入了新的复杂层面，促使学生不仅要反思AI产生什么，还要思考何时以及如何依赖它。通过突出这些判断，我们提供了一个概念框架，帮助理解学生在设计情境中如何与AI进行共创的意义建构。', 'title_zh': '追踪无形之物：理解学生在AI支持设计工作中 的判断'}
{'arxiv_id': 'arXiv:2505.08918', 'title': 'When repeats drive the vocabulary: a Byte-Pair Encoding analysis of T2T primate genomes', 'authors': 'Marina Popova, Iaroslav Chelombitko, Aleksey Komissarov', 'link': 'https://arxiv.org/abs/2505.08918', 'abstract': 'The emergence of telomere-to-telomere (T2T) genome assemblies has opened new avenues for comparative genomics, yet effective tokenization strategies for genomic sequences remain underexplored. In this pilot study, we apply Byte Pair Encoding (BPE) to nine T2T primate genomes including three human assemblies by training independent BPE tokenizers with a fixed vocabulary of 512,000 tokens using our custom tool, dnaBPE. Our analysis reveals that only 11,569 tokens are shared across all assemblies, while nearly 991,854 tokens are unique to a single genome, indicating a rapid decline in shared vocabulary with increasing assembly comparisons. Moreover, phylogenetic trees derived from token overlap failed to recapitulate established primate relationships, a discrepancy attributed to the disproportionate influence of species-specific high-copy repetitive elements. These findings underscore the dual nature of BPE tokenization: while it effectively compresses repetitive sequences, its sensitivity to high-copy elements limits its utility as a universal tool for comparative genomics. We discuss potential hybrid strategies and repeat-masking approaches to refine genomic tokenization, emphasizing the need for domain-specific adaptations in the development of large-scale genomic language models. The dnaBPE tool used in this study is open-source and available at this https URL.', 'abstract_zh': 'telomere-to-telomere (T2T) 基因组组装的出现为 comparative genomics 开辟了新途径，但基因组序列的有效细分策略尚未得到充分探索。在本试点研究中，我们使用自定义工具 dnaBPE 以及固定词汇量 512,000 的独立 BPE 分词器对九个 T2T 灵长类基因组，包括三个人类组装进行了 Byte Pair Encoding (BPE) 应用。分析结果显示，仅有 11,569 个分词被所有组装共享，而几乎 991,854 个分词仅局限于单一基因组，表明随着组装比较的增加，共享词汇量迅速下降。此外，由分词重叠推导出的系统发生树未能重现已建立的灵长类关系，这种分歧归因于物种特异性高拷贝重复元素的影响。这些发现强调了 BPE 分词的双重性质：虽然它有效压缩了重复序列，但其对高拷贝元素的敏感性限制了其在 comparative genomics 中作为通用工具的适用性。我们讨论了潜在的混合策略和重复掩蔽方法以改进基因组分词，强调在开发大规模基因组语言模型时需要特定领域的适应性。本研究使用的 dnaBPE 工具是开源的，可在以下网址获取。', 'title_zh': '当重复序列驱动词汇：T2T灵长类基因组的字对编码分析'}
{'arxiv_id': 'arXiv:2505.08916', 'title': 'A New Tractable Description Logic under Categorical Semantics', 'authors': 'Chan Le Duc, Ludovic Brieulle', 'link': 'https://arxiv.org/abs/2505.08916', 'abstract': 'Biomedical ontologies contain numerous concept or role names involving negative knowledge such as lacks_part, absence_of. Such a representation with labels rather than logical constructors would not allow a reasoner to interpret lacks_part as a kind of negation of has_part. It is known that adding negation to the tractable Description Logic (DL) EL allowing for conjunction, existential restriction and concept inclusion makes it intractable since the obtained logic includes implicitly disjunction and universal restriction which interact with other constructors. In this paper, we propose a new extension of EL with a weakened negation allowing to represent negative knowledge while retaining tractability. To this end, we introduce categorical semantics of all logical constructors of the DL SH including EL with disjunction, negation, universal restriction, role inclusion and transitive roles. The categorical semantics of a logical constructor is usually described as a set of categorical properties referring to several objects without using set membership. To restore tractability, we have to weaken semantics of disjunction and universal restriction by identifying \\emph{independent} categorical properties that are responsible for intractability, and dropping them from the set of categorical properties. We show that the logic resulting from weakening semantics is more expressive than EL with the bottom concept, transitive roles and role inclusion.', 'abstract_zh': 'biomedical本体包含涉及负知识的概念或角色名称，如lacks_part、absence_of。这样的表示使用标签而非逻辑构造子，不会让推理器将lacks_part解释为has_part的否定。已知将否定加入到可处理的描述逻辑EL中，允许合取、存在限制和概念包含，使其变得不可处理，因为所得逻辑隐式地包括了析取和普遍限制，这些与其它构造子相互作用。在本文中，我们提出了一种新的EL扩展，引入了减弱的否定，以保留可处理性同时表示负知识。为此，我们引入了描述逻辑SH（包括EL中的析取、否定、普遍限制、角色包含和传递角色）的所有逻辑构造子的范畴语义。范畴语义通常描述为一组范畴属性，不使用集合成员身份来参考多个对象。为了恢复可处理性，我们必须通过识别导致不可处理的独立范畴属性并将其从范畴属性集合中删除来减弱析取和普遍限制的语义。我们展示了减弱语义得到的逻辑比包含底部概念、传递角色和角色包含的EL更具表达力。', 'title_zh': '一种基于范畴语义的新可处理描述逻辑'}
{'arxiv_id': 'arXiv:2505.08904', 'title': 'FareShare: A Tool for Labor Organizers to Estimate Lost Wages and Contest Arbitrary AI and Algorithmic Deactivations', 'authors': 'Varun Nagaraj Rao, Samantha Dalal, Andrew Schwartz, Amna Liaqat, Dana Calacci, Andrés Monroy-Hernández', 'link': 'https://arxiv.org/abs/2505.08904', 'abstract': "What happens when a rideshare driver is suddenly locked out of the platform connecting them to riders, wages, and daily work? Deactivation-the abrupt removal of gig workers' platform access-typically occurs through arbitrary AI and algorithmic decisions with little explanation or recourse. This represents one of the most severe forms of algorithmic control and often devastates workers' financial stability. Recent U.S. state policies now mandate appeals processes and recovering compensation during the period of wrongful deactivation based on past earnings. Yet, labor organizers still lack effective tools to support these complex, error-prone workflows. We designed FareShare, a computational tool automating lost wage estimation for deactivated drivers, through a 6 month partnership with the State of Washington's largest rideshare labor union. Over the following 3 months, our field deployment of FareShare registered 178 account signups. We observed that the tool could reduce lost wage calculation time by over 95%, eliminate manual data entry errors, and enable legal teams to generate arbitration-ready reports more efficiently. Beyond these gains, the deployment also surfaced important socio-technical challenges around trust, consent, and tool adoption in high-stakes labor contexts.", 'abstract_zh': '当网约车司机突然被平台锁定，无法接单、领取工资和开展日常工作时会发生什么？账户撤销—— gig工人平台访问的突然中断——通常通过随意的AI和算法决策进行，缺乏解释和申诉渠道。这代表了最严重的算法控制形式之一，往往严重损害工人的经济稳定。近期，美国各州政策现已要求在过往收入基础上为被无理撤销账户的工人提供申诉程序和恢复补偿。然而，劳工组织者仍缺乏有效工具来支持这些复杂且多有误的操作流程。我们与华盛顿州最大网约车劳动工会合作六个月，设计了FareShare，一种自动估算被撤销账户司机损失工资的计算工具。在随后的三个月中，FareShare的实际部署注册了178个账号。我们观察到，该工具能够将损失工资计算时间减少超过95%，消除手动数据输入错误，并使法律团队能更高效地生成仲裁准备报告。除此之外，该部署还揭示了高风险劳动环境中关于信任、同意和工具采用的重要社会技术挑战。', 'title_zh': 'FareShare: 一个用于劳动组织者估算损失工资并挑战任意AI和算法停用的工具'}
{'arxiv_id': 'arXiv:2505.08847', 'title': 'On the interplay of Explainability, Privacy and Predictive Performance with Explanation-assisted Model Extraction', 'authors': 'Fatima Ezzeddine, Rinad Akel, Ihab Sbeity, Silvia Giordano, Marc Langheinrich, Omran Ayoub', 'link': 'https://arxiv.org/abs/2505.08847', 'abstract': 'Machine Learning as a Service (MLaaS) has gained important attraction as a means for deploying powerful predictive models, offering ease of use that enables organizations to leverage advanced analytics without substantial investments in specialized infrastructure or expertise. However, MLaaS platforms must be safeguarded against security and privacy attacks, such as model extraction (MEA) attacks. The increasing integration of explainable AI (XAI) within MLaaS has introduced an additional privacy challenge, as attackers can exploit model explanations particularly counterfactual explanations (CFs) to facilitate MEA. In this paper, we investigate the trade offs among model performance, privacy, and explainability when employing Differential Privacy (DP), a promising technique for mitigating CF facilitated MEA. We evaluate two distinct DP strategies: implemented during the classification model training and at the explainer during CF generation.', 'abstract_zh': '作为一种服务的机器学习（MLaaS）因其部署强大预测模型的能力而受到重要关注，提供了一种简便的方式，使组织能够利用高级分析而不必在专门的基础设施或专业知识上进行重大投资。然而，MLaaS平台必须受到安全和隐私攻击的防范，如模型提取（MEA）攻击。解释性人工智能（XAI）在MLaaS中的日益集成引入了额外的隐私挑战，攻击者可以利用模型解释，尤其是反事实解释（CFs），以促进MEA。在本文中，我们研究了在使用差分隐私（DP）时模型性能、隐私和解释性的权衡，DP是一种有前景的技术，用于缓解由CF促进的MEA。我们评估了两种不同的DP策略：实施在分类模型训练期间和实施在生成CF时的解释器期间。', 'title_zh': '解释性、隐私和预测性能之间的相互作用：基于解释辅助模型提取'}
{'arxiv_id': 'arXiv:2505.08846', 'title': 'Evaluating Simplification Algorithms for Interpretability of Time Series Classification', 'authors': 'Felix Marti-Perez, Brigt Håvardstun, Cèsar Ferri, Carlos Monserrat, Jan Arne Telle', 'link': 'https://arxiv.org/abs/2505.08846', 'abstract': 'In this work, we introduce metrics to evaluate the use of simplified time series in the context of interpretability of a TSC - a Time Series Classifier. Such simplifications are important because time series data, in contrast to text and image data, are not intuitively understandable to humans. These metrics are related to the complexity of the simplifications - how many segments they contain - and to their loyalty - how likely they are to maintain the classification of the original time series. We employ these metrics to evaluate four distinct simplification algorithms, across several TSC algorithms and across datasets of varying characteristics, from seasonal or stationary to short or long. Our findings suggest that using simplifications for interpretability of TSC is much better than using the original time series, particularly when the time series are seasonal, non-stationary and/or with low entropy.', 'abstract_zh': '本研究引入了评估时间序列简化在时间序列分类器可解释性中的使用情况的指标，这些指标涉及简化的时间序列的复杂性和忠诚度，并在不同类型的时间序列分类器和不同特征的数据集上评估了四种不同的简化算法。研究表明，使用简化的时间序列比使用原始时间序列更好地提高时间序列分类器的可解释性，尤其是在时间序列具有季节性、非平稳性和/或低熵的情况下。', 'title_zh': '评估时间序列分类解释性的简化算法'}
{'arxiv_id': 'arXiv:2505.08845', 'title': 'Validation of Conformal Prediction in Cervical Atypia Classification', 'authors': 'Misgina Tsighe Hagos, Antti Suutala, Dmitrii Bychkov, Hakan Kücükel, Joar von Bahr, Milda Poceviciute, Johan Lundin, Nina Linder, Claes Lundström', 'link': 'https://arxiv.org/abs/2505.08845', 'abstract': 'Deep learning based cervical cancer classification can potentially increase access to screening in low-resource regions. However, deep learning models are often overconfident and do not reliably reflect diagnostic uncertainty. Moreover, they are typically optimized to generate maximum-likelihood predictions, which fail to convey uncertainty or ambiguity in their results. Such challenges can be addressed using conformal prediction, a model-agnostic framework for generating prediction sets that contain likely classes for trained deep-learning models. The size of these prediction sets indicates model uncertainty, contracting as model confidence increases. However, existing conformal prediction evaluation primarily focuses on whether the prediction set includes or covers the true class, often overlooking the presence of extraneous classes. We argue that prediction sets should be truthful and valuable to end users, ensuring that the listed likely classes align with human expectations rather than being overly relaxed and including false positives or unlikely classes. In this study, we comprehensively validate conformal prediction sets using expert annotation sets collected from multiple annotators. We evaluate three conformal prediction approaches applied to three deep-learning models trained for cervical atypia classification. Our expert annotation-based analysis reveals that conventional coverage-based evaluations overestimate performance and that current conformal prediction methods often produce prediction sets that are not well aligned with human labels. Additionally, we explore the capabilities of the conformal prediction methods in identifying ambiguous and out-of-distribution data.', 'abstract_zh': '基于深度学习的宫颈癌分类有可能增加低资源地区筛查的 accessibility。然而，深度学习模型往往过于自信，不能可靠地反映诊断不确定性。此外，它们通常被优化以生成最大似然预测，这些预测未能传达结果中的不确定性或模糊性。此类挑战可以通过使用校准预测来解决，校准预测是一种适用于生成包含训练深度学习模型可能类别的预测集的模型agnostic框架。这些预测集的大小表示模型不确定性，在模型信心增加时收缩。然而，现有的校准预测评估主要关注预测集是否包含或覆盖真实类别，往往忽视了多余类别的存在。我们认为预测集应真实且对最终用户有价值，确保列出的可能类别符合人类预期，而不是过于宽松并包括假阳性或不太可能的类别。在本研究中，我们使用来自多名注释者收集的专家注释集全面验证校准预测集。我们评估了应用于三种用于宫颈异常分类的深度学习模型的三种校准预测方法。我们的基于专家注释的分析表明，传统的覆盖率评估高估了性能，当前的校准预测方法通常会产生与人类标签不完全一致的预测集。此外，我们探索了校准预测方法在识别模糊和分布外数据方面的能力。', 'title_zh': '宫颈不典型病变分类中齐性预测的验证'}
{'arxiv_id': 'arXiv:2505.08841', 'title': 'Will AI Take My Job? Evolving Perceptions of Automation and Labor Risk in Latin America', 'authors': 'Andrea Cremaschi, Dae-Jin Lee, Manuele Leonelli', 'link': 'https://arxiv.org/abs/2505.08841', 'abstract': 'As artificial intelligence and robotics increasingly reshape the global labor market, understanding public perceptions of these technologies becomes critical. We examine how these perceptions have evolved across Latin America, using survey data from the 2017, 2018, 2020, and 2023 waves of the Latinobarómetro. Drawing on responses from over 48,000 individuals across 16 countries, we analyze fear of job loss due to artificial intelligence and robotics. Using statistical modeling and latent class analysis, we identify key structural and ideological predictors of concern, with education level and political orientation emerging as the most consistent drivers. Our findings reveal substantial temporal and cross-country variation, with a notable peak in fear during 2018 and distinct attitudinal profiles emerging from latent segmentation. These results offer new insights into the social and structural dimensions of AI anxiety in emerging economies and contribute to a broader understanding of public attitudes toward automation beyond the Global North.', 'abstract_zh': '随着人工智能和机器人技术 increasingly 重塑全球劳动力市场，理解公众对这些技术的看法变得至关重要。我们使用 2017、2018、2020 和 2023 年拉丁obarómetro 波特调查的数据，探讨这些看法在拉丁美洲的演变情况。基于来自 16 个国家超过 48,000 名个体的回应，我们分析对由于人工智能和机器人技术导致的失业恐惧。通过统计建模和潜在类别分析，我们识别出关键的结构性和意识形态预测因素，教育水平和政治倾向是最具一致性的驱动因素。我们的发现显示了显著的时间性和跨国家差异，尤其是 2018 年恐惧情绪达到峰值，并且从潜在细分中 emerged 出不同的态度模式。这些结果提供了对新兴经济体中 AI 焦虑的社会和结构性维度的新见解，并为对自动化持公共卫生态度的更广泛理解做出了贡献，超越了全球经济北方。', 'title_zh': 'AI会取代我的工作吗？拉丁美洲自动化与劳动风险 perception 的演变'}
{'arxiv_id': 'arXiv:2505.08835', 'title': 'Robustness Analysis against Adversarial Patch Attacks in Fully Unmanned Stores', 'authors': 'Hyunsik Na, Wonho Lee, Seungdeok Roh, Sohee Park, Daeseon Choi', 'link': 'https://arxiv.org/abs/2505.08835', 'abstract': 'The advent of convenient and efficient fully unmanned stores equipped with artificial intelligence-based automated checkout systems marks a new era in retail. However, these systems have inherent artificial intelligence security vulnerabilities, which are exploited via adversarial patch attacks, particularly in physical environments. This study demonstrated that adversarial patches can severely disrupt object detection models used in unmanned stores, leading to issues such as theft, inventory discrepancies, and interference. We investigated three types of adversarial patch attacks -- Hiding, Creating, and Altering attacks -- and highlighted their effectiveness. We also introduce the novel color histogram similarity loss function by leveraging attacker knowledge of the color information of a target class object. Besides the traditional confusion-matrix-based attack success rate, we introduce a new bounding-boxes-based metric to analyze the practical impact of these attacks. Starting with attacks on object detection models trained on snack and fruit datasets in a digital environment, we evaluated the effectiveness of adversarial patches in a physical testbed that mimicked a real unmanned store with RGB cameras and realistic conditions. Furthermore, we assessed the robustness of these attacks in black-box scenarios, demonstrating that shadow attacks can enhance success rates of attacks even without direct access to model parameters. Our study underscores the necessity for robust defense strategies to protect unmanned stores from adversarial threats. Highlighting the limitations of the current defense mechanisms in real-time detection systems and discussing various proactive measures, we provide insights into improving the robustness of object detection models and fortifying unmanned retail environments against these attacks.', 'abstract_zh': '基于人工智能自动化结账系统的便捷无人商店的出现标志着零售新时代的到来。然而，这些系统内固有人工智能安全漏洞通过对抗性补丁攻击在物理环境中被利用。本研究证明了对抗性补丁会严重干扰无人商店中使用的物体检测模型，导致盗窃、库存差异和干扰等问题。我们探讨了三种类型的对抗性补丁攻击——隐藏攻击、创造攻击和修改攻击，并强调了它们的有效性。此外，我们通过利用攻击者关于目标类别物体颜色信息的知识，引入了新颖的颜色直方图相似性损失函数。除了传统的混淆矩阵基于的攻击成功率，我们还引入了一种基于边界框的新度量来分析这些攻击的实际影响。从数字环境中对零食和水果数据集训练的物体检测模型发起攻击开始，我们在一个模拟真实无人商店的物理测试床中评估了对抗性补丁的效果，该测试床使用RGB摄像头并具有现实条件。此外，我们在黑盒场景中评估了这些攻击的鲁棒性，证明即使没有直接访问模型参数，阴影攻击也能增强攻击成功率。本研究强调了为从对抗性威胁中保护无人商店而制定稳健防御策略的必要性。我们指出现有实时检测系统防御机制的局限性，并讨论了各种主动措施，提供改善物体检测模型鲁棒性和增强无人零售环境防御能力的见解。', 'title_zh': '全无人商店中对抗性patches攻击的鲁棒性分析'}
{'arxiv_id': 'arXiv:2505.08829', 'title': 'Aggregating Concepts of Fairness and Accuracy in Predictive Systems', 'authors': 'David Kinney', 'link': 'https://arxiv.org/abs/2505.08829', 'abstract': 'An algorithm that outputs predictions about the state of the world will almost always be designed with the implicit or explicit goal of outputting accurate predictions (i.e., predictions that are likely to be true). In addition, the rise of increasingly powerful predictive algorithms brought about by the recent revolution in artificial intelligence has led to an emphasis on building predictive algorithms that are fair, in the sense that their predictions do not systematically evince bias or bring about harm to certain individuals or groups. This state of affairs presents two conceptual challenges. First, the goals of accuracy and fairness can sometimes be in tension, and there are no obvious normative guidelines for managing the trade-offs between these two desiderata when they arise. Second, there are many distinct ways of measuring both the accuracy and fairness of a predictive algorithm; here too, there are no obvious guidelines on how to aggregate our preferences for predictive algorithms that satisfy disparate measures of fairness and accuracy to various extents. The goal of this paper is to address these challenges by arguing that there are good reasons for using a linear combination of accuracy and fairness metrics to measure the all-things-considered value of a predictive algorithm for agents who care about both accuracy and fairness. My argument depends crucially on a classic result in the preference aggregation literature due to Harsanyi. After making this formal argument, I apply my result to an analysis of accuracy-fairness trade-offs using the COMPAS dataset compiled by Angwin et al.', 'abstract_zh': '一种关于世界状态的预测算法几乎总是旨在输出准确的预测（即，有可能真实的预测）。此外，最近人工智能革命导致的预测算法能力不断增强，使得人们更加重视构建公平的预测算法，即其预测不应系统地表现出偏见或对某些个人或群体造成伤害。这种状态提出了两个概念上的挑战。首先，准确性和公平性的目标有时是矛盾的，当两者发生冲突时，没有明显的规范性指导原则来管理这两项要求之间的权衡。其次，衡量预测算法的准确性和公平性有多种不同的方法；同样，也没有明显的指导原则来综合不同程度满足各种公平性和准确性的预测算法的偏好。本文旨在通过论证使用准确性和公平性指标的线性组合来衡量关心准确性和公平性的代理人的综合价值是合理的，来解决这些挑战。我的论证关键依赖于Harsanyi在偏好聚合文献中的经典成果。在进行了这一形式化的论证后，我将我的结果应用于Angwin等人编制的COMPAS数据集的准确性和公平性权衡分析中。', 'title_zh': '聚集预测系统中公平性和准确性的概念'}
{'arxiv_id': 'arXiv:2505.08828', 'title': 'Human-AI Collaboration or Academic Misconduct? Measuring AI Use in Student Writing Through Stylometric Evidence', 'authors': 'Eduardo Araujo Oliveira, Madhavi Mohoni, Sonsoles López-Pernas, Mohammed Saqr', 'link': 'https://arxiv.org/abs/2505.08828', 'abstract': "As human-AI collaboration becomes increasingly prevalent in educational contexts, understanding and measuring the extent and nature of such interactions pose significant challenges. This research investigates the use of authorship verification (AV) techniques not as a punitive measure, but as a means to quantify AI assistance in academic writing, with a focus on promoting transparency, interpretability, and student development. Building on prior work, we structured our investigation into three stages: dataset selection and expansion, AV method development, and systematic evaluation. Using three datasets - including a public dataset (PAN-14) and two from University of Melbourne students from various courses - we expanded the data to include LLM-generated texts, totalling 1,889 documents and 540 authorship problems from 506 students. We developed an adapted Feature Vector Difference AV methodology to construct robust academic writing profiles for students, designed to capture meaningful, individual characteristics of their writing. The method's effectiveness was evaluated across multiple scenarios, including distinguishing between student-authored and LLM-generated texts and testing resilience against LLMs' attempts to mimic student writing styles. Results demonstrate the enhanced AV classifier's ability to identify stylometric discrepancies and measure human-AI collaboration at word and sentence levels while providing educators with a transparent tool to support academic integrity investigations. This work advances AV technology, offering actionable insights into the dynamics of academic writing in an AI-driven era.", 'abstract_zh': '随着人机协作在教育领域中越来越普遍，理解并衡量这类互动的程度与性质提出了重大挑战。本研究探讨了将作者ship验证（AV）技术作为非惩罚性手段，用于量化学术写作中的AI协助，重点关注提高透明度、可解释性和学生发展。基于前期工作，我们将研究分为三个阶段：数据集选择与扩展、AV方法开发以及系统评估。使用三个数据集——包括一个公开数据集（PAN-14）和两个来自墨尔本大学不同课程学生的数据集——我们扩展了数据集，共包含1,889份文档和540个作者ship问题，涉及506名学生。我们开发了一种适应性的特征向量差异AV方法，旨在构建能够捕捉学生写作有意义、个性化特征的学术写作档案。方法的有效性在多种场景下进行了评估，包括区分学生作者和LLM生成的文本以及测试抵抗LLM模仿学生写作风格的能力。结果表明，改进的AV分类器能够识别风格学差异，并在单词和句子层面衡量人机协作，为教育者提供一个透明的工具，支持学术诚信调查。本工作推动了AV技术的发展，提供了有关AI驱动时代学术写作动态的实际洞察。', 'title_zh': '人类与AI的合作还是学术不端？通过风格计量证据测量学生写作中AI的使用'}
{'arxiv_id': 'arXiv:2505.08821', 'title': 'A Comparative Study of Transformer-Based Models for Multi-Horizon Blood Glucose Prediction', 'authors': 'Meryem Altin Karagoz, Marc D. Breton, Anas El Fathi', 'link': 'https://arxiv.org/abs/2505.08821', 'abstract': 'Accurate blood glucose prediction can enable novel interventions for type 1 diabetes treatment, including personalized insulin and dietary adjustments. Although recent advances in transformer-based architectures have demonstrated the power of attention mechanisms in complex multivariate time series prediction, their potential for blood glucose (BG) prediction remains underexplored. We present a comparative analysis of transformer models for multi-horizon BG prediction, examining forecasts up to 4 hours and input history up to 1 week. The publicly available DCLP3 dataset (n=112) was split (80%-10%-10%) for training, validation, and testing, and the OhioT1DM dataset (n=12) served as an external test set. We trained networks with point-wise, patch-wise, series-wise, and hybrid embeddings, using CGM, insulin, and meal data. For short-term blood glucose prediction, Crossformer, a patch-wise transformer architecture, achieved a superior 30-minute prediction of RMSE (15.6 mg / dL on OhioT1DM). For longer-term predictions (1h, 2h, and 4h), PatchTST, another path-wise transformer, prevailed with the lowest RMSE (24.6 mg/dL, 36.1 mg/dL, and 46.5 mg/dL on OhioT1DM). In general, models that used tokenization through patches demonstrated improved accuracy with larger input sizes, with the best results obtained with a one-week history. These findings highlight the promise of transformer-based architectures for BG prediction by capturing and leveraging seasonal patterns in multivariate time-series data to improve accuracy.', 'abstract_zh': '准确的血糖预测可以实现对1型糖尿病治疗的新型干预措施，包括个性化胰岛素和饮食调整。尽管基于变换器的架构在复杂多变量时间序列预测中展示了注意力机制的强大能力，但其在血糖（BG）预测中的潜力尚未得到充分探索。我们对变换器模型进行了多 horizons 血糖预测的比较分析，检查了4小时内的预测和1周内的输入历史。公开可用的DCLP3数据集（n=112）按80%-10%-10%的比例分为训练集、验证集和测试集，而OhioT1DM数据集（n=12）作为外部测试集。我们使用持续葡萄糖监测（CGM）、胰岛素和餐食数据，训练了使用点式、块式、序列式和混合式嵌入的网络。对于短期血糖预测，块式变换器架构Crossformer实现了30分钟预测的最佳RMSE（OhioT1DM上的15.6 mg/dL）。对于长期预测（1小时、2小时和4小时），另一块式变换器PatchTST表现最佳，分别达到24.6 mg/dL、36.1 mg/dL和46.5 mg/dL的最低RMSE（OhioT1DM上的）。总体而言，通过块进行标记化并具有较大输入大小的模型显示出更好的准确性，最佳结果来自一周的历史数据。这些发现突显了基于变换器的架构在血糖预测中的潜力，通过捕捉和利用多变量时间序列数据中的季节性模式来提高准确性。', 'title_zh': '基于变压器模型的多 horizon 葡萄糖水平预测对比研究'}
{'arxiv_id': 'arXiv:2505.08818', 'title': 'Position: Restructuring of Categories and Implementation of Guidelines Essential for VLM Adoption in Healthcare', 'authors': 'Amara Tariq, Rimita Lahiri, Charles Kahn, Imon Banerjee', 'link': 'https://arxiv.org/abs/2505.08818', 'abstract': 'The intricate and multifaceted nature of vision language model (VLM) development, adaptation, and application necessitates the establishment of clear and standardized reporting protocols, particularly within the high-stakes context of healthcare. Defining these reporting standards is inherently challenging due to the diverse nature of studies involving VLMs, which vary significantly from the development of all new VLMs or finetuning for domain alignment to off-the-shelf use of VLM for targeted diagnosis and prediction tasks. In this position paper, we argue that traditional machine learning reporting standards and evaluation guidelines must be restructured to accommodate multiphase VLM studies; it also has to be organized for intuitive understanding of developers while maintaining rigorous standards for reproducibility. To facilitate community adoption, we propose a categorization framework for VLM studies and outline corresponding reporting standards that comprehensively address performance evaluation, data reporting protocols, and recommendations for manuscript composition. These guidelines are organized according to the proposed categorization scheme. Lastly, we present a checklist that consolidates reporting standards, offering a standardized tool to ensure consistency and quality in the publication of VLM-related research.', 'abstract_zh': '视觉语言模型（VLM）开发、适应与应用的复杂性和多面性 necessitates the 建立清晰和标准化的报告规范，尤其是在医疗保健这种高风险的背景下。在涉及VLM的研究多样性基础上，定义这些报告标准本身具有挑战性，这些研究从新VLM的开发到特定领域的微调不等。在这篇立场论文中，我们argue that 认为传统的机器学习报告标准和评估指南必须重新结构化以适应多阶段的VLM研究；同时需要组织成易于开发者理解的形式，同时保持严格的标准以确保可重复性。为了促进社区采用，我们提出了一种VLM研究分类框架，并概述了相应的报告标准，这些标准全面涵盖了性能评估、数据报告规范和手稿编制建议。这些指南根据提出的分类方案组织。最后，我们提供了一个检查表，汇总了报告标准，提供了一个标准化工具以确保VLM相关研究出版的一致性和质量。', 'title_zh': '位置：结构重构与指南实施对于推动医疗健康领域VLM应用至关重要'}
{'arxiv_id': 'arXiv:2505.08814', 'title': 'Towards Understanding Deep Learning Model in Image Recognition via Coverage Test', 'authors': 'Wenkai Li, Xiaoqi Li, Yingjie Mao, Yishun Wang', 'link': 'https://arxiv.org/abs/2505.08814', 'abstract': 'Deep neural networks (DNNs) play a crucial role in the field of artificial intelligence, and their security-related testing has been a prominent research focus. By inputting test cases, the behavior of models is examined for anomalies, and coverage metrics are utilized to determine the extent of neurons covered by these test cases. With the widespread application and advancement of DNNs, different types of neural behaviors have garnered attention, leading to the emergence of various coverage metrics for neural networks. However, there is currently a lack of empirical research on these coverage metrics, specifically in analyzing the relationships and patterns between model depth, configuration information, and neural network coverage. This paper aims to investigate the relationships and patterns of four coverage metrics: primary functionality, boundary, hierarchy, and structural coverage. A series of empirical experiments were conducted, selecting LeNet, VGG, and ResNet as different DNN architectures, along with 10 models of varying depths ranging from 5 to 54 layers, to compare and study the relationships between different depths, configuration information, and various neural network coverage metrics. Additionally, an investigation was carried out on the relationships between modified decision/condition coverage and dataset size. Finally, three potential future directions are proposed to further contribute to the security testing of DNN Models.', 'abstract_zh': '深度神经网络（DNNs）在人工智能领域发挥着关键作用，其安全性测试已成为研究的热点。通过输入测试案例，检查模型的行为以检测异常，并使用覆盖度量来确定这些测试案例覆盖的神经元范围。随着DNNs的广泛应用和进步，不同类型的神经行为引起了关注，导致了各种神经网络覆盖度量的出现。然而，目前缺乏关于这些覆盖度量的实证研究，特别是关于模型深度、配置信息和神经网络覆盖之间的关系和模式的研究。本文旨在探讨四种覆盖度量——基本功能、边界、层次和结构覆盖之间的关系和模式。进行了一系列实证实验，选择了LeNet、VGG和ResNet等不同的DNN架构，以及从5到54层的10个不同深度的模型，以比较和研究不同深度、配置信息和各种神经网络覆盖度量之间的关系。此外，还研究了修改后的决策/条件覆盖与数据集大小之间的关系。最后，提出了三个潜在的未来方向，以进一步促进DNN模型的安全性测试。', 'title_zh': '基于覆盖率测试理解图像识别中的深度学习模型'}
{'arxiv_id': 'arXiv:2505.08810', 'title': 'Machine Learning-Based Detection of DDoS Attacks in VANETs for Emergency Vehicle Communication', 'authors': 'Bappa Muktar, Vincent Fono, Adama Nouboukpo', 'link': 'https://arxiv.org/abs/2505.08810', 'abstract': "Vehicular Ad Hoc Networks (VANETs) play a key role in Intelligent Transportation Systems (ITS), particularly in enabling real-time communication for emergency vehicles. However, Distributed Denial of Service (DDoS) attacks, which interfere with safety-critical communication channels, can severely impair their reliability. This study introduces a robust and scalable framework to detect DDoS attacks in highway-based VANET environments. A synthetic dataset was constructed using Network Simulator 3 (NS-3) in conjunction with the Simulation of Urban Mobility (SUMO) and further enriched with real-world mobility traces from Germany's A81 highway, extracted via OpenStreetMap (OSM). Three traffic categories were simulated: DDoS, VoIP, and TCP-based video streaming (VideoTCP). The data preprocessing pipeline included normalization, signal-to-noise ratio (SNR) feature engineering, missing value imputation, and class balancing using the Synthetic Minority Over-sampling Technique (SMOTE). Feature importance was assessed using SHapley Additive exPlanations (SHAP). Eleven classifiers were benchmarked, among them XGBoost (XGB), CatBoost (CB), AdaBoost (AB), GradientBoosting (GB), and an Artificial Neural Network (ANN). XGB and CB achieved the best performance, each attaining an F1-score of 96%. These results highlight the robustness of the proposed framework and its potential for real-time deployment in VANETs to secure critical emergency communications.", 'abstract_zh': '基于高速公路的VANET环境中的DDoS攻击检测鲁棒可扩展框架', 'title_zh': '基于机器学习的 VANET 中应急车辆通信中DDoS攻击检测'}
{'arxiv_id': 'arXiv:2505.08809', 'title': 'MixBridge: Heterogeneous Image-to-Image Backdoor Attack through Mixture of Schrödinger Bridges', 'authors': 'Shixi Qin, Zhiyong Yang, Shilong Bao, Shi Wang, Qianqian Xu, Qingming Huang', 'link': 'https://arxiv.org/abs/2505.08809', 'abstract': 'This paper focuses on implanting multiple heterogeneous backdoor triggers in bridge-based diffusion models designed for complex and arbitrary input distributions. Existing backdoor formulations mainly address single-attack scenarios and are limited to Gaussian noise input models. To fill this gap, we propose MixBridge, a novel diffusion Schrödinger bridge (DSB) framework to cater to arbitrary input distributions (taking I2I tasks as special cases). Beyond this trait, we demonstrate that backdoor triggers can be injected into MixBridge by directly training with poisoned image pairs. This eliminates the need for the cumbersome modifications to stochastic differential equations required in previous studies, providing a flexible tool to study backdoor behavior for bridge models. However, a key question arises: can a single DSB model train multiple backdoor triggers? Unfortunately, our theory shows that when attempting this, the model ends up following the geometric mean of benign and backdoored distributions, leading to performance conflict across backdoor tasks. To overcome this, we propose a Divide-and-Merge strategy to mix different bridges, where models are independently pre-trained for each specific objective (Divide) and then integrated into a unified model (Merge). In addition, a Weight Reallocation Scheme (WRS) is also designed to enhance the stealthiness of MixBridge. Empirical studies across diverse generation tasks speak to the efficacy of MixBridge.', 'abstract_zh': '基于桥梁扩散模型的混合异构后门触发机制研究', 'title_zh': 'MixBridge: 通过薛定谔橋混合进行的异构图像到图像后门攻击'}
{'arxiv_id': 'arXiv:2505.08808', 'title': 'SparseMeXT Unlocking the Potential of Sparse Representations for HD Map Construction', 'authors': 'Anqing Jiang, Jinhao Chai, Yu Gao, Yiru Wang, Yuwen Heng, Zhigang Sun, Hao Sun, Zezhong Zhao, Li Sun, Jian Zhou, Lijuan Zhu, Shugong Xu, Hao Zhao', 'link': 'https://arxiv.org/abs/2505.08808', 'abstract': "Recent advancements in high-definition \\emph{HD} map construction have demonstrated the effectiveness of dense representations, which heavily rely on computationally intensive bird's-eye view \\emph{BEV} features. While sparse representations offer a more efficient alternative by avoiding dense BEV processing, existing methods often lag behind due to the lack of tailored designs. These limitations have hindered the competitiveness of sparse representations in online HD map construction. In this work, we systematically revisit and enhance sparse representation techniques, identifying key architectural and algorithmic improvements that bridge the gap with--and ultimately surpass--dense approaches. We introduce a dedicated network architecture optimized for sparse map feature extraction, a sparse-dense segmentation auxiliary task to better leverage geometric and semantic cues, and a denoising module guided by physical priors to refine predictions. Through these enhancements, our method achieves state-of-the-art performance on the nuScenes dataset, significantly advancing HD map construction and centerline detection. Specifically, SparseMeXt-Tiny reaches a mean average precision \\emph{mAP} of 55.5% at 32 frames per second \\emph{fps}, while SparseMeXt-Base attains 65.2% mAP. Scaling the backbone and decoder further, SparseMeXt-Large achieves an mAP of 68.9% at over 20 fps, establishing a new benchmark for sparse representations in HD map construction. These results underscore the untapped potential of sparse methods, challenging the conventional reliance on dense representations and redefining efficiency-performance trade-offs in the field.", 'abstract_zh': 'Recent advancements in高分辨率地图构建：SparseMeXt系列方法的架构与算法优化及其实时高性能实现', 'title_zh': 'SparseMeXT 解锁稀疏表示在高清地图构建中的潜力'}
{'arxiv_id': 'arXiv:2505.08800', 'title': 'Graph-based Online Monitoring of Train Driver States via Facial and Skeletal Features', 'authors': 'Olivia Nocentini, Marta Lagomarsino, Gokhan Solak, Younggeol Cho, Qiyi Tong, Marta Lorenzini, Arash Ajoudani', 'link': 'https://arxiv.org/abs/2505.08800', 'abstract': "Driver fatigue poses a significant challenge to railway safety, with traditional systems like the dead-man switch offering limited and basic alertness checks. This study presents an online behavior-based monitoring system utilizing a customised Directed-Graph Neural Network (DGNN) to classify train driver's states into three categories: alert, not alert, and pathological. To optimize input representations for the model, an ablation study was performed, comparing three feature configurations: skeletal-only, facial-only, and a combination of both. Experimental results show that combining facial and skeletal features yields the highest accuracy (80.88%) in the three-class model, outperforming models using only facial or skeletal features. Furthermore, this combination achieves over 99% accuracy in the binary alertness classification. Additionally, we introduced a novel dataset that, for the first time, incorporates simulated pathological conditions into train driver monitoring, broadening the scope for assessing risks related to fatigue and health. This work represents a step forward in enhancing railway safety through advanced online monitoring using vision-based technologies.", 'abstract_zh': '基于定向图神经网络的在线行为监测系统：结合面部和骨骼特征分类列车司机状态以提升铁路安全', 'title_zh': '基于图的列车司机状态在线监测方法： Facial和Skeletal特征分析'}
{'arxiv_id': 'arXiv:2505.08795', 'title': 'The Geometry of Meaning: Perfect Spacetime Representations of Hierarchical Structures', 'authors': 'Andres Anabalon, Hugo Garces, Julio Oliva, Jose Cifuentes', 'link': 'https://arxiv.org/abs/2505.08795', 'abstract': 'We show that there is a fast algorithm that embeds hierarchical structures in three-dimensional Minkowski spacetime. The correlation of data ends up purely encoded in the causal structure. Our model relies solely on oriented token pairs -- local hierarchical signals -- with no access to global symbolic structure. We apply our method to the corpus of \\textit{WordNet}. We provide a perfect embedding of the mammal sub-tree including ambiguities (more than one hierarchy per node) in such a way that the hierarchical structures get completely codified in the geometry and exactly reproduce the ground-truth. We extend this to a perfect embedding of the maximal unambiguous subset of the \\textit{WordNet} with 82{,}115 noun tokens and a single hierarchy per token. We introduce a novel retrieval mechanism in which causality, not distance, governs hierarchical access. Our results seem to indicate that all discrete data has a perfect geometrical representation that is three-dimensional. The resulting embeddings are nearly conformally invariant, indicating deep connections with general relativity and field theory. These results suggest that concepts, categories, and their interrelations, namely hierarchical meaning itself, is geometric.', 'abstract_zh': '我们展示了如何在闵可斯基三维时空中标注层次结构的快速算法，数据的相关性最终完全编码在因果结构中。我们的模型仅依赖于定向令牌对——局部层次信号——无需访问全局符号结构。我们将该方法应用于WordNet语料库。我们提供了哺乳动物子树（包括每个节点有多个层次的情况）的完美嵌入，并且层次结构在几何中完全编码且精确地再现了真实情况。我们将其扩展到WordNet的最大无歧义子集的完美嵌入，该集合包含82,115个名词令牌且每个令牌只有一个层次。我们引入了一种新的检索机制，其中因果关系而非距离支配层次访问。结果显示所有离散数据可能都有一个完美的三维几何表示。生成的嵌入几乎共形不变，暗示了与广义相对论和场论的深刻联系。这些结果表明，概念、类别及其相互关系，即层次意义本身，是几何的。', 'title_zh': '意义的几何学：层级结构的完美时空表示'}
{'arxiv_id': 'arXiv:2412.15404', 'title': 'A Retrieval-Augmented Generation Framework for Academic Literature Navigation in Data Science', 'authors': 'Ahmet Yasin Aytar, Kemal Kilic, Kamer Kaya', 'link': 'https://arxiv.org/abs/2412.15404', 'abstract': "In the rapidly evolving field of data science, efficiently navigating the expansive body of academic literature is crucial for informed decision-making and innovation. This paper presents an enhanced Retrieval-Augmented Generation (RAG) application, an artificial intelligence (AI)-based system designed to assist data scientists in accessing precise and contextually relevant academic resources. The AI-powered application integrates advanced techniques, including the GeneRation Of BIbliographic Data (GROBID) technique for extracting bibliographic information, fine-tuned embedding models, semantic chunking, and an abstract-first retrieval method, to significantly improve the relevance and accuracy of the retrieved information. This implementation of AI specifically addresses the challenge of academic literature navigation. A comprehensive evaluation using the Retrieval-Augmented Generation Assessment System (RAGAS) framework demonstrates substantial improvements in key metrics, particularly Context Relevance, underscoring the system's effectiveness in reducing information overload and enhancing decision-making processes. Our findings highlight the potential of this enhanced Retrieval-Augmented Generation system to transform academic exploration within data science, ultimately advancing the workflow of research and innovation in the field.", 'abstract_zh': '在数据科学快速发展的领域，有效地导航庞大的学术文献对于做出明智决策和创新至关重要。本文介绍了一种增强的检索增强生成（RAG）应用，这是一种基于人工智能的系统，旨在帮助数据科学家访问精确且上下文相关的学术资源。该人工智能驱动的应用集成先进的技术，包括用于提取参考文献信息的GeneRation Of BIbliographic Data（GROBID）技术、微调嵌入模型、语义分块以及摘要优先检索方法，以显著提高检索信息的相关性和准确性。该人工智能实现特别解决了学术文献导航的挑战。使用检索增强生成评估系统（RAGAS）框架进行的全面评估表明，在关键指标方面取得了显著改进，特别是在上下文相关性方面，突显了该系统的有效性，能够减少信息过载并提升决策过程。我们的研究结果强调了这种增强的检索增强生成系统在数据科学中改变学术探究的潜力，最终推动了研究和创新工作的流程。', 'title_zh': '面向数据科学中的学术文献导航的检索增强生成框架'}
