{'arxiv_id': 'arXiv:2506.03982', 'title': 'A Bi-Level Optimization Method for Redundant Dual-Arm Minimum Time Problems', 'authors': 'Jonathan Fried, Santiago Paternain', 'link': 'https://arxiv.org/abs/2506.03982', 'abstract': 'In this work, we present a method for minimizing the time required for a redundant dual-arm robot to follow a desired relative Cartesian path at constant path speed by optimizing its joint trajectories, subject to position, velocity, and acceleration limits. The problem is reformulated as a bi-level optimization whose lower level is a convex, closed-form subproblem that maximizes path speed for a fixed trajectory, while the upper level updates the trajectory using a single-chain kinematic formulation and the subgradient of the lower-level value. Numerical results demonstrate the effectiveness of the proposed approach.', 'abstract_zh': '本研究提出了一种方法，通过优化关节轨迹，在满足位置、速度和加速度限制的情况下，最小化冗余双臂机器人跟随恒定路径速度的期望相对笛卡尔路径所需的时间。该问题被重新表述为一个两层优化问题，其中下层是一个凸的闭式子问题，该子问题在固定轨迹的情况下最大化路径速度，而上层则使用单链运动学公式和下层值的次梯度更新轨迹。数值结果表明所提出方法的有效性。', 'title_zh': '双臂冗余最小时间问题的双层优化方法'}
{'arxiv_id': 'arXiv:2506.03743', 'title': 'An Open-source Capping Machine Suitable for Confined Spaces', 'authors': 'Francisco Munguia-Galeano, Louis Longley, Satheeshkumar Veeramani, Zhengxue Zhou, Rob Clowes, Hatem Fakhruldeen, Andrew I. Cooper', 'link': 'https://arxiv.org/abs/2506.03743', 'abstract': "In the context of self-driving laboratories (SDLs), ensuring automated and error-free capping is crucial, as it is a ubiquitous step in sample preparation. Automated capping in SDLs can occur in both large and small workspaces (e.g., inside a fume hood). However, most commercial capping machines are designed primarily for large spaces and are often too bulky for confined environments. Moreover, many commercial products are closed-source, which can make their integration into fully autonomous workflows difficult. This paper introduces an open-source capping machine suitable for compact spaces, which also integrates a vision system that recognises capping failure. The capping and uncapping processes are repeated 100 times each to validate the machine's design and performance. As a result, the capping machine reached a 100 % success rate for capping and uncapping. Furthermore, the machine sealing capacities are evaluated by capping 12 vials filled with solvents of different vapour pressures: water, ethanol and acetone. The vials are then weighed every 3 hours for three days. The machine's performance is benchmarked against an industrial capping machine (a Chemspeed station) and manual capping. The vials capped with the prototype lost 0.54 % of their content weight on average per day, while the ones capped with the Chemspeed and manually lost 0.0078 % and 0.013 %, respectively. The results show that the capping machine is a reasonable alternative to industrial and manual capping, especially when space and budget are limitations in SDLs.", 'abstract_zh': '在自主驾驶实验室（SDLs）的背景下，确保自动化且无误的盖帽操作至关重要，因为这是样本准备中的一个普遍步骤。SDLs中的自动盖帽可以在大空间和小空间（例如，在通风柜内）中进行。然而，大多数商用盖帽机主要针对大空间设计，往往不适合受限环境。此外，许多商用产品是闭源的，这使得它们难以集成到完全自主的工作流程中。本文介绍了一种适用于紧凑空间的开源盖帽机，并集成了一个能够识别盖帽失败的视觉系统。盖帽和去盖帽过程各重复了100次以验证机器的设计和性能。结果表明，该机器在盖帽和去盖帽方面均达到了100%的成功率。此外，通过将12只装有不同的蒸气压溶剂（水、乙醇和醋酸）的试瓶进行盖帽，评估了该机器的密封性能。随后每隔3小时称量一次试瓶，持续三天。性能基准测试显示，该原型机每天平均损失0.54%的内容物重量，而使用Chemspeed设备和手动盖帽的试瓶分别损失0.0078%和0.013%。结果表明，在SDLs的空间和预算受限时，该盖帽机是工业和手动盖帽的合理替代方案。', 'title_zh': '适用于受限空间的开源加盖机器'}
{'arxiv_id': 'arXiv:2506.03663', 'title': 'An Improved Grey Wolf Optimizer Inspired by Advanced Cooperative Predation for UAV Shortest Path Planning', 'authors': 'Zuhao Teng, Qian Dong, Ze Zhang, Shuangyao Huang, Wenzhang Zhang, Jingchen Wang, Ji Li, Xi Chen', 'link': 'https://arxiv.org/abs/2506.03663', 'abstract': 'With the widespread application of Unmanned Aerial Vehicles (UAVs) in domains like military reconnaissance, emergency rescue, and logistics delivery, efficiently planning the shortest flight path has become a critical challenge. Traditional heuristic-based methods often suffer from the inability to escape from local optima, which limits their effectiveness in finding the shortest path. To address these issues, a novel Improved Grey Wolf Optimizer (IGWO) is presented in this study. The proposed IGWO incorporates an Advanced Cooperative Predation (ACP) and a Lens Opposition-based Learning Strategy (LOBL) in order to improve the optimization capability of the method. Simulation results show that IGWO ranks first in optimization performance on benchmark functions F1-F5, F7, and F9-F12, outperforming all other compared algorithms. Subsequently, IGWO is applied to UAV shortest path planning in various obstacle-laden environments. Simulation results show that the paths planned by IGWO are, on average, shorter than those planned by GWO, PSO, and WOA by 1.70m, 1.68m, and 2.00m, respectively, across four different maps.', 'abstract_zh': '基于改进灰狼优化算法的无人机最短路径规划', 'title_zh': '受高级协同捕食启发的改进灰狼优化算法在无人机最短路径规划中的应用'}
{'arxiv_id': 'arXiv:2506.03537', 'title': 'Robust Position Estimation by Rao-Blackwellized Particle Filter without Integer Ambiguity Resolution in Urban Environments', 'authors': 'Daiki Niimi, An Fujino, Taro Suzuki, Junichi Meguro', 'link': 'https://arxiv.org/abs/2506.03537', 'abstract': 'This study proposes a centimeter-accurate positioning method that utilizes a Rao-Blackwellized particle filter (RBPF) without requiring integer ambiguity resolution in global navigation satellite system (GNSS) carrier phase measurements. The conventional positioning method employing a particle filter (PF) eliminates the necessity for ambiguity resolution by calculating the likelihood from the residuals of the carrier phase based on the particle position. However, this method encounters challenges, particularly in urban environments characterized by non-line-of-sight (NLOS) multipath errors. In such scenarios, PF tracking may fail due to the degradation of velocity estimation accuracy used for state transitions, thereby complicating subsequent position estimation. To address this issue, we apply Rao-Blackwellization to the conventional PF framework, treating position and velocity as distinct states and employing the Kalman filter for velocity estimation. This approach enhances the accuracy of velocity estimation and, consequently, the precision of position estimation. Moreover, the proposed method rejects NLOS multipath signals based on the pseudorange residuals at each particle position during the velocity estimation step. This process not only enhances velocity accuracy, but also preserves particle diversity by allowing particles to transition to unique states with varying velocities. Consequently, particles are more likely to cluster around the true position, thereby enabling more accurate position estimation. Vehicular experiments in urban environments demonstrated the effectiveness of proposed method in achieving a higher positioning accuracy than conventional PF-based and conventional GNSS positioning methods.', 'abstract_zh': '一种无需整数模糊度解算的厘米级定位方法：利用 Rao-Blackwellized 颗粒滤波器在全球导航卫星系统载波相位测量中的应用', 'title_zh': '在城市环境中无需整数模糊校决议蔟粒子滤波的稳健位置估计'}
{'arxiv_id': 'arXiv:2506.03380', 'title': 'Design of Trimmed Helicoid Soft-Rigid Hybrid Robots', 'authors': 'Zach J. Patterson, Emily R. Sologuren, Daniela Rus', 'link': 'https://arxiv.org/abs/2506.03380', 'abstract': "As soft robot design matures, researchers have converged to sophisticated design paradigms to enable the development of more suitable platforms. Two such paradigms are soft-rigid hybrid robots, which utilize rigid structural materials in some aspect of the robot's design, and architectured materials, which deform based on geometric parameters as opposed to purely material ones. In this work, we combine the two design approaches, utilizing trimmed helicoid structures in series with rigid linkages. Additionally, we extend the literature on wave spring-inspired soft structures by deriving a mechanical model of the stiffness for arbitrary geometries. We present a novel manufacturing method for such structures utilizing an injection molding approach and we make available the design tool to generate 3D printed molds for arbitrary designs of this class. Finally, we produce a robot using the above methods and operate it in closed-loop demonstrations.", 'abstract_zh': '随着软体机器人设计的成熟，研究人员已经汇聚到了更加 sophisticated 的设计范式，以促进更适合的平台的发展。两种这样的范式是软-硬混合机器人，它们在机器人的设计中利用了刚性结构材料，以及基于几何参数而非单纯材料属性变形的架构材料。在此项工作中，我们结合了这两种设计方法，利用带有限制的螺旋面结构与刚性连杆相结合。此外，我们通过推导任意几何形状下的刚度机械模型，扩展了受到波弹簧启发的软结构的文献。我们提出了一种利用注塑成型方法制造此类结构的新颖制造方法，并提供了生成此类设计3D打印模具的工具。最后，我们使用上述方法制作了一个机器人，并在闭环演示中对其进行操作。', 'title_zh': '精裁螺旋软硬混合机器人设计'}
{'arxiv_id': 'arXiv:2506.03297', 'title': 'Dynamics and Control of Vision-Aided Multi-UAV-tethered Netted System Capturing Non-Cooperative Target', 'authors': 'Runhan Liu, Hui Ren, Wei Fan', 'link': 'https://arxiv.org/abs/2506.03297', 'abstract': 'As the number of Unmanned Aerial Vehicles (UAVs) operating in low-altitude airspace continues to increase, non-cooperative targets pose growing challenges to low-altitude operations. To address this issue, this paper proposes a multi-UAV-tethered netted system as a non-lethal solution for capturing non-cooperative targets. To validate the proposed system, we develop mySim, a multibody dynamics-based UAV simulation environment that integrates high-precision physics modeling, vision-based motion tracking, and reinforcement learning-driven control strategies. In mySim, the spring-damper model is employed to simulate the dynamic behavior of the tethered net, while the dynamics of the entire system is modeled using multibody dynamics (MBD) to achieve accurate representations of system interactions. The motion of the UAVs and the target are estimated using VINS-MONO and DETR, and the system autonomously executes the capture strategy through MAPPO. Simulation results demonstrate that mySim accurately simulates dynamics and control of the system, successfully enabling the multi-UAV-tethered netted system to capture both non-propelled and maneuvering non-cooperative targets. By providing a high-precision simulation platform that integrates dynamics modeling with perception and learning-based control, mySim enables efficient testing and optimization of UAV-based control policies before real-world deployment. This approach offers significant advantages for simulating complex UAVs coordination tasks and has the potential to be applied to the design of other UAV-based systems.', 'abstract_zh': '随着低空 airspace内无人驾驶航空器（UAVs）的数量持续增加，非配合目标对低空操作构成了日益严峻的挑战。为了解决这一问题，本文提出了一种多UAV联动网捕系统，作为捕获非配合目标的非致命解决方案。为了验证所提出系统的效果，我们开发了mySim，这是一种基于多体动力学的UAV仿真环境，结合了高精度物理建模、基于视觉的运动跟踪以及基于强化学习的控制策略。在mySim中，弹簧阻尼模型用于模拟联动网的动态行为，整个系统的动力学则通过多体动力学（MBD）建模以实现系统交互的精确表示。无人机和目标的运动分别通过VINS-MONO和DETR进行估计，系统自主执行捕获策略通过MAPPO实现。仿真结果表明，mySim准确模拟了系统的动力学和控制，成功使多UAV联动网捕系统能够捕获非推进的和机动的非配合目标。通过提供一种综合动力学建模与感知及学习驱动控制的高精度仿真平台，mySim能够在实际部署前高效地测试和优化基于UAV的控制策略。该方法对于模拟复杂的UAV协调任务具有显著优势，有望应用于其他基于UAV系统的研发设计中。', 'title_zh': '视觉辅助多无人机缆网系统捕获非合作目标的动力学与控制'}
{'arxiv_id': 'arXiv:2506.03400', 'title': 'Occlusion-Aware Ground Target Tracking by a Dubins Vehicle Using Visibility Volumes', 'authors': 'Collin Hague, Artur Wolek', 'link': 'https://arxiv.org/abs/2506.03400', 'abstract': "This paper considers the problem of tracking a point of interest (POI) moving along a known trajectory on the ground with an uncrewed aerial vehicle (UAV) modeled as a Dubins vehicle using a line-of-sight (LOS) sensor through an urban environment that may occlude the POI. A visibility volume (VV) encodes a time-varying, three-dimensional representation of the sensing constraints for a particular POI position. A constant-altitude, translating, and radially time-varying circular standoff orbit is then inscribed within the dynamically changing VV centered at the POI position. The time-varying VV is approximated by placing static VVs along the POI's trajectory using an adaptive metric that restricts the volume change of consecutive visibility volumes to below a specified rate. The time-varying circular standoff orbit is proven to be feasible for a Dubins vehicle and is approximated with a piecewise set of linearly interpolated circular orbits inside the static VVs. A steering controller is derived that drives the UAV to converge to the time-varying standoff orbit. Numerical simulations and a flight test illustrate the proposed approach.", 'abstract_zh': '基于视线传感器的城市环境遮挡下移动兴趣点跟踪的遮挡体积方法：Dubins无人机的动态径向变换单圆轨道控制', 'title_zh': '基于视见体积的幽靈车 occlusion 意识地面目标跟踪'}
