{'arxiv_id': 'arXiv:2508.03672', 'title': 'Inland-LOAM: Voxel-Based Structural Semantic Mapping for Inland Waterways', 'authors': 'Zhongbi Luo, Yunjia Wang, Jan Swevers, Peter Slaets, Herman Bruyninckx', 'link': 'https://arxiv.org/abs/2508.03672', 'abstract': 'Accurate geospatial information is crucial for safe, autonomous Inland Waterway Transport (IWT), as existing charts (IENC) lack real-time detail and conventional LiDAR SLAM fails in waterway environments. These challenges lead to vertical drift and non-semantic maps, hindering autonomous navigation.\nThis paper introduces Inland-LOAM, a LiDAR SLAM framework for waterways. It uses an improved feature extraction and a water surface planar constraint to mitigate vertical drift. A novel pipeline transforms 3D point clouds into structured 2D semantic maps using voxel-based geometric analysis, enabling real-time computation of navigational parameters like bridge clearances. An automated module extracts shorelines and exports them into a lightweight, IENC-compatible format.\nEvaluations on a real-world dataset show Inland-LOAM achieves superior localization accuracy over state-of-the-art methods. The generated semantic maps and shorelines align with real-world conditions, providing reliable data for enhanced situational awareness. The code and dataset will be publicly available', 'abstract_zh': '准确的地理空间信息对于安全、自主内河航运（IWT）至关重要，现有海图（IENC）缺乏实时细节，传统LiDAR SLAM在水道环境中失效。这些挑战导致了垂直漂移和非语义地图，阻碍了自主导航。\n\n本文介绍了Inland-LOAM，一种适用于水道的LiDAR SLAM框架。它使用改进的特征提取和水面平面约束来减轻垂直漂移。一种新型流水线将3D点云转换为结构化的2D语义地图，通过体素几何分析实现即时计算航行参数，如桥梁净空。一个自动化模块提取海岸线并以轻量级、兼容IENC的格式导出。\n\n对真实数据集的评估显示，Inland-LOAM在定位准确性上优于现有方法。生成的语义地图和海岸线与实际情况相符，提供了增强情况意识的可靠数据。代码和数据集将公开可用。', 'title_zh': '内陆-LOAM：基于体素的结构语义建图方法用于内陆水道'}
{'arxiv_id': 'arXiv:2508.03559', 'title': 'Online Learning for Vibration Suppression in Physical Robot Interaction using Power Tools', 'authors': 'Gokhan Solak, Arash Ajoudani', 'link': 'https://arxiv.org/abs/2508.03559', 'abstract': 'Vibration suppression is an important capability for collaborative robots deployed in challenging environments such as construction sites. We study the active suppression of vibration caused by external sources such as power tools. We adopt the band-limited multiple Fourier linear combiner (BMFLC) algorithm to learn the vibration online and counter it by feedforward force control. We propose the damped BMFLC method, extending BMFLC with a novel adaptive step-size approach that improves the convergence time and noise resistance. Our logistic function-based damping mechanism reduces the effect of noise and enables larger learning rates. We evaluate our method on extensive simulation experiments with realistic time-varying multi-frequency vibration and real-world physical interaction experiments. The simulation experiments show that our method improves the suppression rate in comparison to the original BMFLC and its recursive least squares and Kalman filter-based extensions. Furthermore, our method is far more efficient than the latter two. We further validate the effectiveness of our method in real-world polishing experiments. A supplementary video is available at this https URL.', 'abstract_zh': '协作机器人在具有挑战性的环境中（如建筑工地）的振动抑制是一项重要能力。我们研究了由外部源（如动力工具）引起的振动的主动抑制方法。我们采用带限多傅里叶线性组合器（BMFLC）算法在线学习振动，并通过前馈力控制来抵消振动。我们提出了阻尼BMFLC方法，通过一种新颖的自适应步长方法扩展BMFLC，从而提高收敛时间和抗噪性能。基于Logistic函数的阻尼机制减少了噪声的影响并允许更大的学习率。我们在包含现实时间变多频率振动的广泛仿真实验以及真实的物理交互实验中评估了我们的方法。仿真实验表明，与原始BMFLC及其基于递归最小二乘法和卡尔曼滤波器的扩展方法相比，我们的方法在抑制率方面有显著改进，且效率远高于后者。我们进一步在实际抛光实验中验证了该方法的有效性。更多信息请参见此链接：https://this-url。', 'title_zh': '使用动力工具进行物理机器人交互的振动抑制在线学习方法'}
{'arxiv_id': 'arXiv:2508.03526', 'title': 'CollaBot: Vision-Language Guided Simultaneous Collaborative Manipulation', 'authors': 'Kun Song, Shentao Ma, Gaoming Chen, Ninglong Jin, Guangbao Zhao, Mingyu Ding, Zhenhua Xiong, Jia Pan', 'link': 'https://arxiv.org/abs/2508.03526', 'abstract': 'A central research topic in robotics is how to use this system to interact with the physical world. Traditional manipulation tasks primarily focus on small objects. However, in factory or home environments, there is often a need for the movement of large objects, such as moving tables. These tasks typically require multi-robot systems to work collaboratively. Previous research lacks a framework that can scale to arbitrary sizes of robots and generalize to various kinds of tasks. In this work, we propose CollaBot, a generalist framework for simultaneous collaborative manipulation. First, we use SEEM for scene segmentation and point cloud extraction of the target object. Then, we propose a collaborative grasping framework, which decomposes the task into local grasp pose generation and global collaboration. Finally, we design a 2-stage planning module that can generate collision-free trajectories to achieve this task. Experiments show a success rate of 52% across different numbers of robots, objects, and tasks, indicating the effectiveness of the proposed framework.', 'abstract_zh': '机器人领域的核心研究主题是如何利用该系统与物理世界进行交互。传统操作任务主要集中在小型物体上。然而，在工厂或家庭环境中，往往需要移动大型物体，如移动桌子。这些任务通常需要多机器人系统协同工作。以往的研究缺乏能够扩展到任意大小机器人并应用于各种任务的框架。在这项工作中，我们提出CollaBot，一种通用的协同操作框架。首先，我们使用SEEM进行场景分割和目标物体的点云提取。然后，我们提出了一种协同抓取框架，将任务分解为局部抓取姿态生成和全局协同。最后，我们设计了一个2阶段规划模块，能够生成无碰撞轨迹以完成该任务。实验结果显示，在不同数量的机器人、物体和任务下，成功率高达52%，表明所提出框架的有效性。', 'title_zh': 'CollaBot: 视觉-语言引导的协作 manipulation'}
{'arxiv_id': 'arXiv:2508.03428', 'title': 'Residual Neural Terminal Constraint for MPC-based Collision Avoidance in Dynamic Environments', 'authors': 'Bojan Derajić, Mohamed-Khalil Bouzidi, Sebastian Bernhard, Wolfgang Hönig', 'link': 'https://arxiv.org/abs/2508.03428', 'abstract': 'In this paper, we propose a hybrid MPC local planner that uses a learning-based approximation of a time-varying safe set, derived from local observations and applied as the MPC terminal constraint. This set can be represented as a zero-superlevel set of the value function computed via Hamilton-Jacobi (HJ) reachability analysis, which is infeasible in real-time. We exploit the property that the HJ value function can be expressed as a difference of the corresponding signed distance function (SDF) and a non-negative residual function. The residual component is modeled as a neural network with non-negative output and subtracted from the computed SDF, resulting in a real-time value function estimate that is at least as safe as the SDF by design. Additionally, we parametrize the neural residual by a hypernetwork to improve real-time performance and generalization properties. The proposed method is compared with three state-of-the-art methods in simulations and hardware experiments, achieving up to 30\\% higher success rates compared to the best baseline while requiring a similar computational effort and producing high-quality (low travel-time) solutions.', 'abstract_zh': '本文提出了一种混合模型预测控制（MPC）局部规划器，该规划器利用基于学习的时间varying安全集近似，该集基于局部观测并作为MPC终端约束应用。该集可以表示为通过哈密尔顿-雅可比（HJ）可达性分析计算的价值函数的零超上水平集，在实时应用中是不可行的。我们利用HJ价值函数可以表示为相应符号距离函数（SDF）和非负残差函数差的性质。残差部分被建模为具有非负输出的神经网络，并从计算得到的SDF中减去，从而得到一个实时价值函数估计，该估计在设计上至少与SDF一样安全。此外，我们通过超网络参数化神经残差以提高实时性能和泛化特性。所提出的方法在仿真和硬件实验中与三种最新方法进行了比较，在相似的计算努力下，成功率最高可提高30%，同时生成高质量（低行程时间）的解决方案。', 'title_zh': '基于MPC的动态环境避碰中残差神经终端约束的研究'}
{'arxiv_id': 'arXiv:2508.03408', 'title': 'Opti-Acoustic Scene Reconstruction in Highly Turbid Underwater Environments', 'authors': 'Ivana Collado-Gonzalez, John McConnell, Paul Szenher, Brendan Englot', 'link': 'https://arxiv.org/abs/2508.03408', 'abstract': 'Scene reconstruction is an essential capability for underwater robots navigating in close proximity to structures. Monocular vision-based reconstruction methods are unreliable in turbid waters and lack depth scale information. Sonars are robust to turbid water and non-uniform lighting conditions, however, they have low resolution and elevation ambiguity. This work proposes a real-time opti-acoustic scene reconstruction method that is specially optimized to work in turbid water. Our strategy avoids having to identify point features in visual data and instead identifies regions of interest in the data. We then match relevant regions in the image to corresponding sonar data. A reconstruction is obtained by leveraging range data from the sonar and elevation data from the camera image. Experimental comparisons against other vision-based and sonar-based approaches at varying turbidity levels, and field tests conducted in marina environments, validate the effectiveness of the proposed approach. We have made our code open-source to facilitate reproducibility and encourage community engagement.', 'abstract_zh': '水下机器人在结构附近近距离导航时，场景重建是一项基本能力。单目视觉基场景重建方法在浑浊水域中 unreliable 并缺乏深度比例信息。声呐在浑浊水域和不均匀光照条件下具有 robust 性，但分辨率低且存在方位模糊。本文提出了一种特别优化的实时光学-声学场景重建方法，适用于浑浊水域。我们的策略避免在视觉数据中识别点特征，而是识别数据中的感兴趣区域。然后将图像中的相关区域与相应的声呐数据匹配。通过利用声呐的距离数据和相机图像的方位数据进行重建。实验结果表明，在不同浑浊程度下与基于视觉和其他基于声呐的方法相比，所提方法有效。我们在港口环境中进行了实地测试，验证了所提方法的有效性。我们已开源代码以促进可重复性并鼓励社区参与。', 'title_zh': '高浑浊度水下环境中的优化声学场景重建'}
{'arxiv_id': 'arXiv:2508.03043', 'title': 'Aerobatic maneuvers in insect-scale flapping-wing aerial robots via deep-learned robust tube model predictive control', 'authors': 'Yi-Hsuan Hsiao, Andrea Tagliabue, Owen Matteson, Suhan Kim, Tong Zhao, Jonathan P. How, YuFeng Chen', 'link': 'https://arxiv.org/abs/2508.03043', 'abstract': 'Aerial insects exhibit highly agile maneuvers such as sharp braking, saccades, and body flips under disturbance. In contrast, insect-scale aerial robots are limited to tracking non-aggressive trajectories with small body acceleration. This performance gap is contributed by a combination of low robot inertia, fast dynamics, uncertainty in flapping-wing aerodynamics, and high susceptibility to environmental disturbance. Executing highly dynamic maneuvers requires the generation of aggressive flight trajectories that push against the hardware limit and a high-rate feedback controller that accounts for model and environmental uncertainty. Here, through designing a deep-learned robust tube model predictive controller, we showcase insect-like flight agility and robustness in a 750-millgram flapping-wing robot. Our model predictive controller can track aggressive flight trajectories under disturbance. To achieve a high feedback rate in a compute-constrained real-time system, we design imitation learning methods to train a two-layer, fully connected neural network, which resembles insect flight control architecture consisting of central nervous system and motor neurons. Our robot demonstrates insect-like saccade movements with lateral speed and acceleration of 197 centimeters per second and 11.7 meters per second square, representing 447$\\%$ and 255$\\%$ improvement over prior results. The robot can also perform saccade maneuvers under 160 centimeters per second wind disturbance and large command-to-force mapping errors. Furthermore, it performs 10 consecutive body flips in 11 seconds - the most challenging maneuver among sub-gram flyers. These results represent a milestone in achieving insect-scale flight agility and inspire future investigations on sensing and compute autonomy.', 'abstract_zh': '基于深度学习的鲁棒管模型预测控制在750毫克拍翼机器人上的昆虫般飞行敏捷性和鲁棒性', 'title_zh': '昆虫尺度拍翼飞行机器人中的深度学习鲁棒管模型预测控制 aerial动态研究'}
{'arxiv_id': 'arXiv:2508.02953', 'title': 'Optimal Trajectory Planning in a Vertically Undulating Snake Locomotion using Contact-implicit Optimization', 'authors': 'Adarsh Salagame, Eric Sihite, Alireza Ramezani', 'link': 'https://arxiv.org/abs/2508.02953', 'abstract': "Contact-rich problems, such as snake robot locomotion, offer unexplored yet rich opportunities for optimization-based trajectory and acyclic contact planning. So far, a substantial body of control research has focused on emulating snake locomotion and replicating its distinctive movement patterns using shape functions that either ignore the complexity of interactions or focus on complex interactions with matter (e.g., burrowing movements). However, models and control frameworks that lie in between these two paradigms and are based on simple, fundamental rigid body dynamics, which alleviate the challenging contact and control allocation problems in snake locomotion, remain absent. This work makes meaningful contributions, substantiated by simulations and experiments, in the following directions: 1) introducing a reduced-order model based on Moreau's stepping-forward approach from differential inclusion mathematics, 2) verifying model accuracy, 3) experimental validation.", 'abstract_zh': '基于接触优化的游蛇机器人运动轨迹和非循环接触规划提供了未探究但丰富的机遇。现有控制研究主要致力于模拟游蛇运动并利用形状函数复制其独特的运动模式，这些形状函数要么忽略交互的复杂性，要么专注于与物质的复杂相互作用（如掘土运动）。然而，基于简单基本刚体动力学且能缓解游蛇运动中接触和控制分配难题的介于这两种范式之间的模型和控制框架仍不存在。本文通过仿真和实验验证，在以下几个方面做出了有意义的贡献：1）引入基于Moreau跳跃前进方法的降阶模型，2）验证模型准确性，3）实验验证。', 'title_zh': '垂直波动蛇形运动中具有接触显式优化的最优轨迹规划'}
{'arxiv_id': 'arXiv:2508.02952', 'title': 'A novel autonomous microplastics surveying robot for beach environments', 'authors': 'Hassan Iqbal, Kobiny Rex, Joseph Shirley, Carlos Baiz, Christian Claudel', 'link': 'https://arxiv.org/abs/2508.02952', 'abstract': "Microplastics, defined as plastic particles smaller than 5 millimeters, have become a pervasive environmental contaminant that accumulates on beaches due to wind patterns and tidal forcing. Detecting microplastics and mapping their concentration in the wild remains one of the primary challenges in addressing this environmental issue. This paper introduces a novel robotic platform that automatically detects and chemically analyzes microplastics on beach surfaces. This mobile manipulator system scans areas for microplastics using a camera mounted on the robotic arm's end effector. The system effectively segments candidate microplastic particles on sand surfaces even in the presence of organic matter such as leaves and clams. Once a candidate microplastic particle is detected, the system steers a near-infrared (NIR) spectroscopic sensor onto the particle using both NIR and visual feedback to chemically analyze it in real-time. Through experiments in lab and beach environments, the system is shown to achieve an excellent positional precision in manipulation control and high microplastic classification accuracy.", 'abstract_zh': '微塑料：一种定义为小于5毫米的塑料颗粒，已成为由于风Pattern和潮汐作用在海滩上普遍积累的环境污染物。在野外检测微塑料并绘制其浓度分布仍然是处理这一环境问题的主要挑战之一。本文介绍了一种新型机器人平台，该平台能够自动检测和化学分析海滩表面的微塑料。该便携式 manipulator 系统使用安装在机器人手臂末端执行器上的摄像头扫描区域以检测微塑料。即使存在有机物如树叶和蛤蜊，该系统也能有效对沙面上的候选微塑料颗粒进行分割。一旦检测到候选微塑料颗粒，该系统将使用近红外（NIR）光谱传感器及其视觉反馈实时对其化学分析。通过实验室和海滩环境中的实验，该系统在操作控制定位精度和微塑料分类准确性方面表现出色。', 'title_zh': '一种新型自主海滩微塑料探测机器人'}
{'arxiv_id': 'arXiv:2508.02873', 'title': 'Tunable Leg Stiffness in a Monopedal Hopper for Energy-Efficient Vertical Hopping Across Varying Ground Profiles', 'authors': 'Rongqian Chen, Jun Kwon, Kefan Wu, Wei-Hsi Chen', 'link': 'https://arxiv.org/abs/2508.02873', 'abstract': 'We present the design and implementation of HASTA (Hopper with Adjustable Stiffness for Terrain Adaptation), a vertical hopping robot with real-time tunable leg stiffness, aimed at optimizing energy efficiency across various ground profiles (a pair of ground stiffness and damping conditions). By adjusting leg stiffness, we aim to maximize apex hopping height, a key metric for energy-efficient vertical hopping. We hypothesize that softer legs perform better on soft, damped ground by minimizing penetration and energy loss, while stiffer legs excel on hard, less damped ground by reducing limb deformation and energy dissipation. Through experimental tests and simulations, we find the best leg stiffness within our selection for each combination of ground stiffness and damping, enabling the robot to achieve maximum steady-state hopping height with a constant energy input. These results support our hypothesis that tunable stiffness improves energy-efficient locomotion in controlled experimental conditions. In addition, the simulation provides insights that could aid in the future development of controllers for selecting leg stiffness.', 'abstract_zh': 'HASTA：一种具有可调韧性的垂直跳跃机器人及其设计与实现', 'title_zh': '单足跳跃器在不同地面条件下进行能量高效垂直跳跃的可调腿部刚度研究'}
{'arxiv_id': 'arXiv:2508.02870', 'title': 'Learning User Interaction Forces using Vision for a Soft Finger Exosuit', 'authors': 'Mohamed Irfan Refai, Abdulaziz Y. Alkayas, Anup Teejo Mathew, Federico Renda, Thomas George Thuruthel', 'link': 'https://arxiv.org/abs/2508.02870', 'abstract': 'Wearable assistive devices are increasingly becoming softer. Modelling their interface with human tissue is necessary to capture transmission of dynamic assistance. However, their nonlinear and compliant nature makes both physical modeling and embedded sensing challenging. In this paper, we develop a image-based, learning-based framework to estimate distributed contact forces for a finger-exosuit system. We used the SoRoSim toolbox to generate a diverse dataset of exosuit geometries and actuation scenarios for training. The method accurately estimated interaction forces across multiple contact locations from low-resolution grayscale images, was able to generalize to unseen shapes and actuation levels, and remained robust under visual noise and contrast variations. We integrated the model into a feedback controller, and found that the vision-based estimator functions as a surrogate force sensor for closed-loop control. This approach could be used as a non-intrusive alternative for real-time force estimation for exosuits.', 'abstract_zh': '可穿戴辅助设备越来越趋向柔软。建模其与人体组织的界面对于捕获动态辅助的传递是必要的。然而，它们的非线性和顺应性特性使得物理建模和嵌入式传感具有挑战性。在本文中，我们开发了一种基于图像、基于学习的框架来估计手指外骨骼系统的分布式接触力。我们使用SoRoSim工具箱生成了多样化的外骨骼几何形状和驱动场景数据集用于训练。该方法能够从低分辨率灰度图像中准确估计多个接触位置的交互力，并能泛化到未见过的形状和驱动水平，在视觉噪声和对比度变化下仍能保持鲁棒性。我们将该模型集成到反馈控制器中，并发现基于视觉的估算器可以作为闭环控制中的替代力传感器。该方法可以作为对外骨骼进行实时力估算的非侵入性替代方案。', 'title_zh': '基于视觉学习软手指外骨骼中的用户交互力'}
{'arxiv_id': 'arXiv:2508.03313', 'title': 'BaroPoser: Real-time Human Motion Tracking from IMUs and Barometers in Everyday Devices', 'authors': 'Libo Zhang, Xinyu Yi, Feng Xu', 'link': 'https://arxiv.org/abs/2508.03313', 'abstract': 'In recent years, tracking human motion using IMUs from everyday devices such as smartphones and smartwatches has gained increasing popularity. However, due to the sparsity of sensor measurements and the lack of datasets capturing human motion over uneven terrain, existing methods often struggle with pose estimation accuracy and are typically limited to recovering movements on flat terrain only. To this end, we present BaroPoser, the first method that combines IMU and barometric data recorded by a smartphone and a smartwatch to estimate human pose and global translation in real time. By leveraging barometric readings, we estimate sensor height changes, which provide valuable cues for both improving the accuracy of human pose estimation and predicting global translation on non-flat terrain. Furthermore, we propose a local thigh coordinate frame to disentangle local and global motion input for better pose representation learning. We evaluate our method on both public benchmark datasets and real-world recordings. Quantitative and qualitative results demonstrate that our approach outperforms the state-of-the-art (SOTA) methods that use IMUs only with the same hardware configuration.', 'abstract_zh': '近年来，，日常设备如智能手机和平板手表的IMU传感器用于跟踪人类运动获得了 Increasing人气。由于传感器测量数据稀疏以及缺乏在不平地形上捕捉人类运动的数据集，现有的方法通常在姿态估计精度上面临挑战，通常仅限于平坦地形上的运动恢复。为了解决这一问题，我们提出了BaronPoser，该方法结合了智能手机和平板手表记录的IMU和气压数据以实时估计姿态和全局平移。通过利用气压读数，我们提供了有助于提高人类姿态估计精度的有价值的 cues，并能够预测在不平地形上的全局运动。此外，我们提出了一种局部大腿坐标系以区分平移和全局运动对供姿态表示学习。我们在基准数据集和实时记录上进行了评估，定量和定质性结果表明在仅使用IMU硬件配置的情况下我们的方法优于现有最佳方法。', 'title_zh': 'BaroPoser: 实时人体运动追踪来自日常设备中的加速度计和气压计的实时人体运动追踪'}
{'arxiv_id': 'arXiv:2508.03070', 'title': 'Optimizing Bipedal Locomotion for The 100m Dash With Comparison to Human Running', 'authors': 'Devin Crowley, Jeremy Dao, Helei Duan, Kevin Green, Jonathan Hurst, Alan Fern', 'link': 'https://arxiv.org/abs/2508.03070', 'abstract': 'In this paper, we explore the space of running gaits for the bipedal robot Cassie. Our first contribution is to present an approach for optimizing gait efficiency across a spectrum of speeds with the aim of enabling extremely high-speed running on hardware. This raises the question of how the resulting gaits compare to human running mechanics, which are known to be highly efficient in comparison to quadrupeds. Our second contribution is to conduct this comparison based on established human biomechanical studies. We find that despite morphological differences between Cassie and humans, key properties of the gaits are highly similar across a wide range of speeds. Finally, our third contribution is to integrate the optimized running gaits into a full controller that satisfies the rules of the real-world task of the 100m dash, including starting and stopping from a standing position. We demonstrate this controller on hardware to establish the Guinness World Record for Fastest 100m by a Bipedal Robot.', 'abstract_zh': '本文探索了两足机器人Cassie的奔跑步态空间。首先，我们提出了一种在多种速度范围内优化步态效率的方法，旨在使硬件实现极高速奔跑。其次，基于现有的人类生物力学研究，我们对步态与人类奔跑力学进行了比较。尽管Cassie与人类在形态上有所不同，但在广泛的速度范围内，步态的关键属性具有高度相似性。最后，我们将优化后的奔跑步态整合到满足100米短跑真实任务规则的完整控制器中，包括站立起跑和停止。我们在硬件上实现了该控制器，确立了两足机器人100米最快的世界纪录。', 'title_zh': '优化百米赛跑的双足运动学与人类跑步的比较'}
{'arxiv_id': 'arXiv:2508.02801', 'title': 'Adaptive Knowledge Distillation for Device-Directed Speech Detection', 'authors': 'Hyung Gun Chi, Florian Pesce, Wonil Chang, Oggi Rudovic, Arturo Argueta, Stefan Braun, Vineet Garg, Ahmed Hussen Abdelaziz', 'link': 'https://arxiv.org/abs/2508.02801', 'abstract': "Device-directed speech detection (DDSD) is a binary classification task that separates the user's queries to a voice assistant (VA) from background speech or side conversations. This is important for achieving naturalistic user experience. To this end, we propose knowledge distillation (KD) to enhance DDSD accuracy while ensuring efficient deployment. Specifically, we introduce a novel adaptive KD method that transfers knowledge from general representations of an ASR large pre-trained acoustic encoder (teacher). We apply task-specific adapters, on top of the (frozen) teacher encoder, trained jointly with the student model on DDSD. We demonstrate that the proposed adaptive KD outperforms the student model without distillation in the keyword and keyword-free (follow-up) invocations, with an improvement of +26% and +19% in terms of Equal Error Rate, respectively. We also show that this approach generalizes across the transformer and conformer-based model architectures.", 'abstract_zh': '设备导向的语音检测（DDSD）是一种二元分类任务，旨在将用户对语音助手的查询与背景语音或侧聊区分开来。这对于实现自然交互体验至关重要。为此，我们提出知识蒸馏（KD）以提高DDSD的准确性并确保高效的部署。具体而言，我们引入了一种新颖的自适应KD方法，该方法从ASR大型预训练声学编码器（教师）的一般表示中转移知识。我们在冻结的教师编码器之上应用任务特定的适配器，并与学生模型联合训练以进行DDSD任务。我们证明，提出的自适应KD在关键词和无关键词（后续）唤醒中均优于无蒸馏的学生模型，分别在相等错误率上提高了26%和19%。此外，我们还展示了这种方法在基于变压器和构音器的模型架构中具有泛化能力。', 'title_zh': '设备导向的语音检测自适应知识蒸馏'}
