{'arxiv_id': 'arXiv:2504.03280', 'title': 'Dynamic Objective MPC for Motion Planning of Seamless Docking Maneuvers', 'authors': 'Oliver Schumann, Michael Buchholz, Klaus Dietmayer', 'link': 'https://arxiv.org/abs/2504.03280', 'abstract': "Automated vehicles and logistics robots must often position themselves in narrow environments with high precision in front of a specific target, such as a package or their charging station. Often, these docking scenarios are solved in two steps: path following and rough positioning followed by a high-precision motion planning algorithm. This can generate suboptimal trajectories caused by bad positioning in the first phase and, therefore, prolong the time it takes to reach the goal. In this work, we propose a unified approach, which is based on a Model Predictive Control (MPC) that unifies the advantages of Model Predictive Contouring Control (MPCC) with a Cartesian MPC to reach a specific goal pose. The paper's main contributions are the adaption of the dynamic weight allocation method to reach path ends and goal poses inside driving corridors, and the development of the so-called dynamic objective MPC. The latter is an improvement of the dynamic weight allocation method, which can inherently switch state-dependent from an MPCC to a Cartesian MPC to solve the path-following problem and the high-precision positioning tasks independently of the location of the goal pose seamlessly by one algorithm. This leads to foresighted, feasible, and safe motion plans, which can decrease the mission time and result in smoother trajectories.", 'abstract_zh': '自动驾驶车辆和物流机器人经常需要在狭窄环境中以高精度定位到特定目标前方，如包裹或充电站。通常，这些对接场景分为两个步骤：路径跟随和粗定位，随后是高精度运动规划算法。这一过程可能导致由于初始阶段定位不准确而产生的次优轨迹，从而延长达到目标所需时间。本文提出了一种统一方法，基于模型预测控制（MPC），结合了模型预测轮廓控制（MPCC）和笛卡尔MPC的优点，以达到特定的目标姿态。本文的主要贡献是将动态权重分配方法适应于在驾驶走廊内达到路径末端和目标姿态，并开发了所谓的动态目标MPC。后者是动态权重分配方法的改进，可以固有地根据状态从MPCC切换到笛卡尔MPC，独立地解决路径跟随问题和高精度定位任务，无需算法切换。这导致前瞻性的、可行的和安全的运动计划，可以减少任务时间并产生更平滑的轨迹。', 'title_zh': '无缝对接机动规划的动态目标模型预测控制'}
{'arxiv_id': 'arXiv:2504.03098', 'title': 'The Use of Gaze-Derived Confidence of Inferred Operator Intent in Adjusting Safety-Conscious Haptic Assistance', 'authors': 'Jeremy D. Webb, Michael Bowman, Songpo Li, Xiaoli Zhang', 'link': 'https://arxiv.org/abs/2504.03098', 'abstract': "Humans directly completing tasks in dangerous or hazardous conditions is not always possible where these tasks are increasingly be performed remotely by teleoperated robots. However, teleoperation is difficult since the operator feels a disconnect with the robot caused by missing feedback from several senses, including touch, and the lack of depth in the video feedback presented to the operator. To overcome this problem, the proposed system actively infers the operator's intent and provides assistance based on the predicted intent. Furthermore, a novel method of calculating confidence in the inferred intent modifies the human-in-the-loop control. The operator's gaze is employed to intuitively indicate the target before the manipulation with the robot begins. A potential field method is used to provide a guiding force towards the intended target, and a safety boundary reduces risk of damage. Modifying these assistances based on the confidence level in the operator's intent makes the control more natural, and gives the robot an intuitive understanding of its human master. Initial validation results show the ability of the system to improve accuracy, execution time, and reduce operator error.", 'abstract_zh': '人类无法在危险条件下直接完成任务，这些任务越来越多地由远程操控机器人完成。然而，远程操控因操作者缺乏触觉反馈等多感官反馈以及视频反馈的缺乏深度而难以实现。为此，所提系统主动推断操作者的意图，并根据预测的意图提供辅助。此外，一种新颖的计算推断意图置信度的方法修改了人机在环控制。操作者的凝视被用来直观指示目标，机器人操作开始前。使用势场方法提供一个引导力，使机器人趋向预期目标，并通过安全边界减少损伤风险。根据操作者意图的置信度水平调整这些辅助手段，使控制更加自然，并赋予机器人对人类主人的直观理解。初步验证结果表明，该系统能够提高精确度、缩短执行时间并降低操作员错误率。', 'title_zh': '基于凝视推断的操作员意图置信度在调整意识安全触觉辅助中的应用'}
{'arxiv_id': 'arXiv:2504.03067', 'title': 'Statics of continuum planar grasping', 'authors': 'Udit Halder', 'link': 'https://arxiv.org/abs/2504.03067', 'abstract': 'Continuum robotic grasping, inspired by biological appendages such as octopus arms and elephant trunks, provides a versatile and adaptive approach to object manipulation. Unlike conventional rigid-body grasping, continuum robots leverage distributed compliance and whole-body contact to achieve robust and dexterous grasping. This paper presents a control-theoretic framework for analyzing the statics of continuous contact with a planar object. The governing equations of static equilibrium of the object are formulated as a linear control system, where the distributed contact forces act as control inputs. To optimize the grasping performance, a constrained optimal control problem is posed to minimize contact forces required to achieve a static grasp, with solutions derived using the Pontryagin Maximum Principle. Furthermore, two optimization problems are introduced: (i) for assigning a measure to the quality of a particular grasp, which generalizes a (rigid-body) grasp quality metric in the continuum case, and (ii) for finding the best grasping configuration that maximizes the continuum grasp quality. Several numerical results are also provided to elucidate our methods.', 'abstract_zh': '连续体机器人抓取：受八足和象鼻生物附肢启发的物体 manipulation 提供了灵活适应的抓取方法。不同于传统的刚体抓取，连续体机器人利用分布式柔顺性和全身接触实现稳定的灵巧抓取。本文提出了一种控制理论框架，用于分析平面物体连续接触的静力学。物体的静态平衡方程被表述为一个线性控制系统，其中分布式接触力作为控制输入。为了优化抓取性能，提出了一个约束最优控制问题，旨在最小化实现静态抓取所需的接触力，并使用庞特里亚金最大原理求解。此外，引入了两个优化问题：(i) 为特定抓取质量赋予测度，该测度在连续体情况下推广了刚体抓取质量度量，(ii) 寻找最大化连续体抓取质量的最佳抓取配置。还提供了若干数值结果以阐明我们的方法。', 'title_zh': '连续平面抓取的静力学分析'}
{'arxiv_id': 'arXiv:2504.03038', 'title': 'How to Adapt Control Barrier Functions? A Learning-Based Approach with Applications to a VTOL Quadplane', 'authors': 'Taekyung Kim, Randal W. Beard, Dimitra Panagou', 'link': 'https://arxiv.org/abs/2504.03038', 'abstract': "In this paper, we present a novel theoretical framework for online adaptation of Control Barrier Function (CBF) parameters, i.e., of the class K functions included in the CBF condition, under input constraints. We introduce the concept of locally validated CBF parameters, which are adapted online to guarantee finite-horizon safety, based on conditions derived from Nagumo's theorem and tangent cone analysis. To identify these parameters online, we integrate a learning-based approach with an uncertainty-aware verification process that account for both epistemic and aleatoric uncertainties inherent in neural network predictions. Our method is demonstrated on a VTOL quadplane model during challenging transition and landing maneuvers, showcasing enhanced performance while maintaining safety.", 'abstract_zh': '本文提出了一种新型的理论框架，用于在输入约束条件下在线适应控制屏障函数（CBF）参数，即CBF条件中包含的类K函数参数。我们引入了局部验证CBF参数的概念，这些参数通过从Nagumo定理和切锥分析中导出的条件进行在线调整，以保证有限时限的安全性。为了在线识别这些参数，我们将基于学习的方法与一个同时考虑神经网络预测中固有的先验不确定性和偶然不确定性的验证过程相结合。我们的方法在VTOL四旋翼模型的挑战性过渡和着陆动作中进行了演示，展示了在保持安全的前提下性能的提升。', 'title_zh': '基于学习的方法如何适应控制屏障函数？应用于垂直起降四旋翼无人机的实例探究'}
{'arxiv_id': 'arXiv:2504.03271', 'title': 'Energy Aware and Safe Path Planning for Unmanned Aircraft Systems', 'authors': 'Sebastian Gasche, Christian Kallies, Andreas Himmel, Rolf Findeisen', 'link': 'https://arxiv.org/abs/2504.03271', 'abstract': 'This paper proposes a path planning algorithm for multi-agent unmanned aircraft systems (UASs) to autonomously cover a search area, while considering obstacle avoidance, as well as the capabilities and energy consumption of the employed unmanned aerial vehicles. The path planning is optimized in terms of energy efficiency to prefer low energy-consuming maneuvers. In scenarios where a UAS is low on energy, it autonomously returns to its initial position for a safe landing, thus preventing potential battery damage. To accomplish this, an energy-aware multicopter model is integrated into a path planning algorithm based on model predictive control and mixed integer linear programming. Besides factoring in energy consumption, the planning is improved by dynamically defining feasible regions for each UAS to prevent obstacle corner-cutting or over-jumping.', 'abstract_zh': '本文提出了一种多无人机系统(UASs)的路径规划算法，使其能够自主覆盖搜索区域，同时考虑避障、以及所用无人机的能力和能耗。路径规划在能效方面进行了优化，倾向于选择低能耗操作。在无人机能量不足的情况下，它能够自主返回初始位置安全降落，防止潜在的电池损坏。为此，基于模型预测控制和混合整数线性规划的路径规划算法中集成了一种能量感知的多旋翼模型。此外，通过动态定义每个无人机的可行区域来防止障碍物角端绕行或过跳，从而提高规划质量。', 'title_zh': '能源aware和安全路径规划for无人驾驶航空系统'}
{'arxiv_id': 'arXiv:2504.03256', 'title': 'A Modular Energy Aware Framework for Multicopter Modeling in Control and Planning Applications', 'authors': 'Sebastian Gasche, Christian Kallies, Andreas Himmel, Rolf Findeisen', 'link': 'https://arxiv.org/abs/2504.03256', 'abstract': 'Unmanned aerial vehicles (UAVs), especially multicopters, have recently gained popularity for use in surveillance, monitoring, inspection, and search and rescue missions. Their maneuverability and ability to operate in confined spaces make them particularly useful in cluttered environments. For advanced control and mission planning applications, accurate and resource-efficient modeling of UAVs and their capabilities is essential. This study presents a modular approach to multicopter modeling that considers vehicle dynamics, energy consumption, and sensor integration. The power train model includes detailed descriptions of key components such as the lithium-ion battery, electronic speed controllers, and brushless DC motors. Their models are validated with real test flight data. In addition, sensor models, including LiDAR and cameras, are integrated to describe the equipment often used in surveillance and monitoring missions. The individual models are combined into an energy-aware multicopter model, which provide the basis for a companion study on path planning for unmanned aircaft system (UAS) swarms performing search and rescue missions in cluttered and dynamic environments. The flexible modeling approach enables easy description of different UAVs in a heterogeneous UAS swarm, allowing for energy-efficient operations and autonomous decision making for a reliable mission performance.', 'abstract_zh': '无人直升机（UAVs），尤其是多旋翼无人机，近年来因其在监控、监测、检查及搜索救援任务中的应用而备受青睐。其机动性及在受限空间内操作的能力使得它们特别适用于复杂环境中。为了实现先进的控制和任务规划应用，对UAV及其能力进行准确且节省资源的建模至关重要。本研究提出了一种模块化的多旋翼无人机建模方法，该方法考虑了无人机的动力学、能耗以及传感器集成。动力系统模型详细描述了关键组件，如锂离子电池、电子调速器和无刷直流电机，并通过实际试飞数据进行了验证。此外，还集成了一系列传感器模型，包括LiDAR和摄像头，以描述通常用于监控和监测任务的设备。各个模型被整合成一种能源意识型多旋翼无人机模型，为执行搜索和救援任务的无人驾驶航空器（UAS）群在复杂和动态环境中的航迹规划研究奠定了基础。灵活的建模方法可方便地描述不同类型的UAV在异构UAS群中的特性，从而实现高效操作和自主决策，以确保任务执行的可靠性。', 'title_zh': '面向控制与规划应用的多旋翼 Modeling 的模块化能源意识框架'}
{'arxiv_id': 'arXiv:2504.03157', 'title': 'Taming High-Dimensional Dynamics: Learning Optimal Projections onto Spectral Submanifolds', 'authors': 'Hugo Buurmeijer, Luis A. Pabon, John Irvin Alora, Roshan S. Kaundinya, George Haller, Marco Pavone', 'link': 'https://arxiv.org/abs/2504.03157', 'abstract': 'High-dimensional nonlinear systems pose considerable challenges for modeling and control across many domains, from fluid mechanics to advanced robotics. Such systems are typically approximated with reduced order models, which often rely on orthogonal projections, a simplification that may lead to large prediction errors. In this work, we derive optimality of fiber-aligned projections onto spectral submanifolds, preserving the nonlinear geometric structure and minimizing long-term prediction error. We propose a computationally tractable procedure to approximate these projections from data, and show how the effect of control can be incorporated. For a 180-dimensional robotic system, we demonstrate that our reduced-order models outperform previous state-of-the-art approaches by up to fivefold in trajectory tracking accuracy under model predictive control.', 'abstract_zh': '高维非线性系统在流体力学和先进机器人等领域建模与控制中提出 considerable 挑战，通常通过降阶模型进行逼近，但可能产生较大预测误差。本文我们推导了沿纤维对谱子流形进行对齐投影的最优性，保留了非线性几何结构并最小化长期预测误差。提出了一种基于数据的计算上可行的方法来近似这些投影，并展示了如何纳入控制效应。对于一个180维的机器人系统，在模型预测控制下，我们的降阶模型在轨迹跟踪准确性上比现有最佳方法提高了一倍多。', 'title_zh': '驯化高维动力学：学习最优投影到谱子流形上'}
{'arxiv_id': 'arXiv:2504.03126', 'title': 'Distributed Linear Quadratic Gaussian for Multi-Robot Coordination with Localization Uncertainty', 'authors': 'Tohid Kargar Tasooji, Sakineh Khodadadi', 'link': 'https://arxiv.org/abs/2504.03126', 'abstract': 'This paper addresses the problem of distributed coordination control for multi-robot systems (MRSs) in the presence of localization uncertainty using a Linear Quadratic Gaussian (LQG) approach. We introduce a stochastic LQG control strategy that ensures the coordination of mobile robots while optimizing a performance criterion. The proposed control framework accounts for the inherent uncertainty in localization measurements, enabling robust decision-making and coordination. We analyze the stability of the system under the proposed control protocol, deriving conditions for the convergence of the multi-robot network. The effectiveness of the proposed approach is demonstrated through experimental validation using Robotrium simulation experiments, showcasing the practical applicability of the control strategy in real-world scenarios with localization uncertainty.', 'abstract_zh': '基于线性二次高斯方法的多机器人系统局部化不确定性下分布式协调控制研究', 'title_zh': '分布式线性二次加权滤波器在存在定位不确定性条件下多机器人协调控制'}
{'arxiv_id': 'arXiv:2504.03125', 'title': 'Event-Based Distributed Linear Quadratic Gaussian for Multi-Robot Coordination with Localization Uncertainty', 'authors': 'Tohid Kargar Tasooji, Sakineh Khodadadi', 'link': 'https://arxiv.org/abs/2504.03125', 'abstract': 'This paper addresses the problem of event-based distributed Linear Quadratic Gaussian (LQG) control for multirobot coordination under localization uncertainty. An event-triggered LQG rendezvous control strategy is proposed to ensure coordinated motion while reducing communication overhead. The design framework decouples the LQG controller from the event-triggering mechanism, although the scheduler parameters critically influence rendezvous performance. We establish stochastic stability for the closed-loop multi-robot system and demonstrate that a carefully tuned event-triggering scheduler can effectively balance rendezvous accuracy with communication efficiency by limiting the upper bound of the rendezvous error while minimizing the average transmission rate. Experimental results using a group of Robotarium mobile robots validate the proposed approach, confirming its efficacy in achieving robust coordination under uncertainty.', 'abstract_zh': '基于事件驱动的分布式线性二次高斯控制在定位不确定性下的多机器人协调问题研究', 'title_zh': '事件驱动的分布式线性二次高斯控制用于具有定位不确定性多机器人协调'}
{'arxiv_id': 'arXiv:2504.03123', 'title': 'Event-Triggered Nonlinear Model Predictive Control for Cooperative Cable-Suspended Payload Transportation with Multi-Quadrotors', 'authors': 'Tohid Kargar Tasooji, Sakineh Khodadadi, Guangjun Liu', 'link': 'https://arxiv.org/abs/2504.03123', 'abstract': 'Autonomous Micro Aerial Vehicles (MAVs), particularly quadrotors, have shown significant potential in assisting humans with tasks such as construction and package delivery. These applications benefit greatly from the use of cables for manipulation mechanisms due to their lightweight, low-cost, and simple design. However, designing effective control and planning strategies for cable-suspended systems presents several challenges, including indirect load actuation, nonlinear configuration space, and highly coupled system dynamics. In this paper, we introduce a novel event-triggered distributed Nonlinear Model Predictive Control (NMPC) method specifically designed for cooperative transportation involving multiple quadrotors manipulating a cable-suspended payload. This approach addresses key challenges such as payload manipulation, inter-robot separation, obstacle avoidance, and trajectory tracking, all while optimizing the use of computational and communication resources. By integrating an event-triggered mechanism, our NMPC method reduces unnecessary computations and communication, enhancing energy efficiency and extending the operational range of MAVs. The proposed method employs a lightweight state vector parametrization that focuses on payload states in all six degrees of freedom, enabling efficient planning of trajectories on the SE(3) manifold. This not only reduces planning complexity but also ensures real-time computational feasibility. Our approach is validated through extensive simulation, demonstrating its efficacy in dynamic and resource-constrained environments.', 'abstract_zh': '自主微空中车辆（MAVs），特别是四旋翼飞行器，在协助人类完成建筑和包裹配送任务方面展现出显著潜力。这些应用由于电缆操纵机制的轻量化、低成本和简易设计而获益良多。然而，为电缆悬吊系统设计有效的控制和规划策略面临着诸多挑战，包括间接负载操作、非线性配置空间和高度耦合的动力学特性。本文介绍了一种新颖的事件触发分布式非线性模型预测控制（NMPC）方法，专门用于多四旋翼飞行器协同运输电缆悬吊负载的任务。该方法解决了负载操作、机器人间距离控制、障碍物避让和轨迹跟踪等关键挑战，同时优化了计算和通信资源的使用。通过集成事件触发机制，我们的NMPC方法降低了不必要的计算和通信量，增强了能量效率并扩展了MAVs的操作范围。所提出的方法采用轻量级状态向量参数化，专注于所有六个自由度的负载状态，在SE(3)流形上进行轨迹规划，这不仅减少了规划复杂性，还确保了实时计算的可行性。通过广泛的仿真实验，我们的方法在动态和资源受限的环境中展现了其有效性。', 'title_zh': '基于事件触发的非线性模型预测控制在多旋翼协同缆索悬挂载荷运输中的应用'}
{'arxiv_id': 'arXiv:2504.03120', 'title': 'Distributed Resilience-Aware Control in Multi-Robot Networks', 'authors': 'Haejoon Lee, Dimitra Panagou', 'link': 'https://arxiv.org/abs/2504.03120', 'abstract': 'Ensuring resilient consensus in multi-robot systems with misbehaving agents remains a challenge, as many existing network resilience properties are inherently combinatorial and globally defined. While previous works have proposed control laws to enhance or preserve resilience in multi-robot networks, they often assume a fixed topology with known resilience properties, or require global state knowledge. These assumptions may be impractical in physically-constrained environments, where safety and resilience requirements are conflicting, or when misbehaving agents corrupt the shared information. In this work, we propose a distributed control law that enables each robot to guarantee resilient consensus and safety during its navigation without fixed topologies using only locally available information. To this end, we establish a new sufficient condition for resilient consensus in time-varying networks based on the degree of non-misbehaving or normal agents. Using this condition, we design a Control Barrier Function (CBF)-based controller that guarantees resilient consensus and collision avoidance without requiring estimates of global state and/or control actions of all other robots. Finally, we validate our method through simulations.', 'abstract_zh': '在具有异常行为代理的多机器人系统中确保复呡共识依然是一项挑战，因为许多现有的网络鲁棒性属性本质上是组合性和全局定义的。尽管此前已有工作提出了增强或保持多机器人网络鲁棒性的控制律，但这些方法往往假设具有固定且已知鲁棒性属性的拓扑结构，或者需要全局状态信息。在物理约束环境下，这些假设可能不切实际，因为安全性和鲁棒性要求可能存在冲突，或者当异常行为代理破坏共享信息时。在本工作中，我们提出了一种分布式的控制律，使得每个机器人能够在不依赖固定拓扑结构的情况下，仅通过局部可用信息来保证鲁棒共识和安全性。为此，我们基于正常或非异常行为代理的度建立了一个新的鲁棒共识充分条件。基于此条件，我们设计了一个基于控制屏障函数（CBF）的控制器，能够保证鲁棒共识和碰撞避免，而无需估计所有其他机器人的全局状态和/或控制动作。最后，我们通过仿真实验验证了该方法。', 'title_zh': '多机器人网络中的分布式鲁棒性aware控制'}
{'arxiv_id': 'arXiv:2504.02852', 'title': 'Curvature-Constrained Vector Field for Motion Planning of Nonholonomic Robots', 'authors': 'Yike Qiao, Xiaodong He, An Zhuo, Zhiyong Sun, Weimin Bao, Zhongkui Li', 'link': 'https://arxiv.org/abs/2504.02852', 'abstract': "Vector fields are advantageous in handling nonholonomic motion planning as they provide reference orientation for robots. However, additionally incorporating curvature constraints becomes challenging, due to the interconnection between the design of the curvature-bounded vector field and the tracking controller under underactuation. In this paper, we present a novel framework to co-develop the vector field and the control laws, guiding the nonholonomic robot to the target configuration with curvature-bounded trajectory. First, we formulate the problem by introducing the target positive limit set, which allows the robot to converge to or pass through the target configuration, depending on different dynamics and tasks. Next, we construct a curvature-constrained vector field (CVF) via blending and distributing basic flow fields in workspace and propose the saturated control laws with a dynamic gain, under which the tracking error's magnitude decreases even when saturation occurs. Under the control laws, kinematically constrained nonholonomic robots are guaranteed to track the reference CVF and converge to the target positive limit set with bounded trajectory curvature. Numerical simulations show that the proposed CVF method outperforms other vector-field-based algorithms. Experiments on Ackermann UGVs and semi-physical fixed-wing UAVs demonstrate that the method can be effectively implemented in real-world scenarios.", 'abstract_zh': '非holonomic运动规划中带有 curvature 约束的向量场及其控制律的联合设计框架', 'title_zh': '非完整机器人运动规划的曲率约束矢量场'}
{'arxiv_id': 'arXiv:2504.02851', 'title': 'A Class of Hierarchical Sliding Mode Control based on Extended Kalman filter for Quadrotor UAVs', 'authors': 'Van Chung Nguyen, Hung Manh La', 'link': 'https://arxiv.org/abs/2504.02851', 'abstract': 'This study introduces a novel methodology for controlling Quadrotor Unmanned Aerial Vehicles, focusing on Hierarchical Sliding Mode Control strategies and an Extended Kalman Filter. Initially, an EKF is proposed to enhance robustness in estimating UAV states, thereby reducing the impact of measured noises and external disturbances. By locally linearizing UAV systems, the EKF can mitigate the disadvantages of the Kalman filter and reduce the computational cost of other nonlinear observers. Subsequently, in comparison to other related work in terms of stability and computational cost, the HSMC framework shows its outperformance in allowing the quadrotor UAVs to track the references. Three types of HSMC Aggregated HSMC, Incremental HSMC, and Combining HSMC are investigated for their effectiveness in tracking reference trajectories. Moreover, the stability of the quadrotor UAVs is rigorously analyzed using the Lyapunov stability principle. Finally, experimental results and comparative analyses demonstrate the efficacy and feasibility of the proposed methodologies.', 'abstract_zh': '本研究介绍了一种新型的四旋翼无人机控制方法，专注于分层滑模控制策略和扩展卡尔曼滤波器。首先，提出了一种扩展卡尔曼滤波器（EKF）以增强对无人机状态估计的稳健性，从而减少测量噪声和外部干扰的影响。通过对无人机系统进行局部线性化，EKF可以缓解卡尔曼滤波器的缺点，并减少其他非线性观测器的计算成本。随后，从稳定性和计算成本的角度与其他相关工作进行对比，滑模控制（HSMC）框架展示了其在使四旋翼无人机跟踪参考轨迹方面的优越性能。研究了三种类型的HSMC：聚合滑模控制、增量滑模控制和综合滑模控制，以评估其跟踪参考轨迹的效果。此外，利用李雅普诺夫稳定性原理严谨分析了四旋翼无人机的稳定性。最后，实验结果和对比分析验证了所提方法的有效性和可行性。', 'title_zh': '基于扩展卡尔曼滤波的 quadrotor 无人机分层滑模控制方法'}
