{'arxiv_id': 'arXiv:2503.11560', 'title': 'Reparametrization of 3D CSC Dubins Paths Enabling 2D Search', 'authors': 'Ling Xu, Yuliy Baryshnikov, Cynthia Sung', 'link': 'https://arxiv.org/abs/2503.11560', 'abstract': 'This paper addresses the Dubins path planning problem for vehicles in 3D space. In particular, we consider the problem of computing CSC paths -- paths that consist of a circular arc (C) followed by a straight segment (S) followed by a circular arc (C). These paths are useful for vehicles such as fixed-wing aircraft and underwater submersibles that are subject to lower bounds on turn radius. We present a new parameterization that reduces the 3D CSC planning problem to a search over 2 variables, thus lowering search complexity, while also providing gradients that assist that search. We use these equations with a numerical solver to explore numbers and types of solutions computed for a variety of planar and 3D scenarios. Our method successfully computes CSC paths for the large majority of test cases, indicating that it could be useful for future generation of robust, efficient curvature-constrained trajectories.', 'abstract_zh': '本文解决三维空间中车辆的Dubins路径规划问题，特别考虑了由一段圆弧（C）跟随一段直线段（S）再跟随一段圆弧（C）组成的CSC路径的计算问题。这些路径适用于受最小转弯半径限制的飞机和水下潜航器等车辆。我们提出了一种新的参数化方法，将3D CSC路径规划问题简化为在两个变量上的搜索，从而降低了搜索复杂度，同时提供了帮助搜索的梯度。我们使用这些方程与数值求解器结合来探索不同平面和3D场景下计算的路径数量和类型。我们的方法成功计算了大量测试案例中的CSC路径，表明它可能对未来生成鲁棒高效的曲率约束轨迹具有实用价值。', 'title_zh': '3D CSC 圭布林路径的重新参数化以实现二维搜索'}
{'arxiv_id': 'arXiv:2503.11551', 'title': 'Vectorable Thrust Control for Multimodal Locomotion of Quadruped Robot SPIDAR', 'authors': 'Moju Zhao', 'link': 'https://arxiv.org/abs/2503.11551', 'abstract': "In this paper, I present vectorable thrust control for different locomotion modes by a novel quadruped robot, SPIDAR, equipped with vectoring rotor in each link. First, the robot's unique mechanical design, the dynamics model, and the basic control framework for terrestrial/aerial locomotion are briefly introduced. Second, a vectorable thrust control method derived from the basic control framework for aerial locomotion is presented. A key feature of this extended flight control is its ability to avoid interrotor aerodynamics interference under specific joint configuration. Third, another extended thrust control method and a fundamental gait strategy is proposed for special terrestrial locomotion called crawling that requires all legs to be lifted at the same time. Finally, the experimental results of the flight with a complex joint motion and the repeatable crawling motion are explained, which demonstrate the feasibility of the proposed thrust control methods for different locomotion modes.", 'abstract_zh': '本文提出了一种新型四足机器人SPIDAR的可矢量推力控制方法，该机器人在每个连杆上配备了矢量旋翼。首先，介绍了机器人的独特机械设计、动力学模型及其用于地面/空中运动的基本控制框架。其次，基于空中运动基本控制框架提出了一种可矢量推力控制方法，该扩展飞行控制的一个关键特征是在特定关节配置下能够避免旋翼间气动干扰。第三，针对一种特殊的地面运动方式——爬行，提出了另一种扩展推力控制方法和基本步态策略，该方式要求所有腿同时抬起。最后，详细解释了具有复杂关节运动的飞行实验结果和可重复的爬行运动实验结果，这些结果证明了所提出的不同运动模式下的推力控制方法的可行性。', 'title_zh': '可矢量控制的推力多模态四足机器人SPIDAR的腿部运动控制'}
{'arxiv_id': 'arXiv:2503.11520', 'title': 'Multi-robot coordination for connectivity recovery after unpredictable environment changes', 'authors': 'Yaroslav Marchukov, Luis Montano', 'link': 'https://arxiv.org/abs/2503.11520', 'abstract': 'In the present paper we develop a distributed method to reconnect a multi-robot team after connectivity failures, caused by unpredictable environment changes, i.e. appearance of new obstacles. After the changes, the team is divided into different groups of robots. The groups have a limited communication range and only a partial information in their field of view about the current scenario. Their objective is to form a chain from a static base station to a goal location. In the proposed distributed replanning approach, the robots predict new plans for the other groups from the new observed information by each robot in the changed scenario, to restore the connectivity with a base station and reach the initial joint objective. If a solution exists, the method achieves the reconnection of all the groups in a unique chain. The proposed method is compared with other two cases: 1) when all the agents have full information of the environment, and 2) when some robots must move to reach other waiting robots for reconnection. Numerical simulations are provided to evaluate the proposed approach in the presence of unpredictable scenario changes.', 'abstract_zh': '基于不可预测环境变化的多机器人团队分布式重新连接方法', 'title_zh': '不确定环境变化后多机器人协调以恢复连通性'}
{'arxiv_id': 'arXiv:2503.11474', 'title': 'Exo-muscle: A semi-rigid assistive device for the knee', 'authors': 'Yifang Zhang, Arash Ajoudani, Nikos G Tsagarakis', 'link': 'https://arxiv.org/abs/2503.11474', 'abstract': 'In this work, we introduce the principle, design and mechatronics of Exo-Muscle, a novel assistive device for the knee joint. Different from the existing systems based on rigid exoskeleton structures or soft-tendon driven approaches, the proposed device leverages a new semi-rigid principle that explores the benefits of both rigid and soft systems. The use of a novel semi-rigid chain mechanism around the knee joint eliminates the presence of misalignment between the device and the knee joint center of rotation, while at the same time, it forms a well-defined route for the tendon. This results in more deterministic load compensation functionality compared to the fully soft systems. The proposed device can provide up to 38Nm assistive torque to the knee joint. In the experiment section, the device was successfully validated through a series of experiments demonstrating the capacity of the device to provide the target assistive functionality in the knee joint.', 'abstract_zh': '本研究介绍了Exo-Muscle的工作原理、设计及机电一体化，这是一种新型的膝关节辅助设备。不同于基于刚性外骨骼结构或软腱驱动的方法，所提出的设备采用了新的半刚性原理，结合了刚性系统和软系统的优势。在膝关节周围采用一种新颖的半刚性链机构，消除了设备与膝关节旋转中心的错位，同时为肌腱提供了清晰的路径。这使得设备在负载补偿功能上比全软系统更具确定性。实验部分通过一系列实验成功验证了该设备能够为膝关节提供目标辅助功能，最大辅助扭矩可达38Nm。', 'title_zh': 'exo-肌骨：一种半刚性膝关节辅助装置'}
{'arxiv_id': 'arXiv:2503.11461', 'title': 'MRS-CWC: A Weakly Constrained Multi-Robot System with Controllable Constraint Stiffness for Mobility and Navigation in Unknown 3D Rough Environments', 'authors': 'Runze Xiao, Yongdong Wang, Yusuke Tsunoda, Koichi Osuka, Hajime Asama', 'link': 'https://arxiv.org/abs/2503.11461', 'abstract': "Navigating unknown three-dimensional (3D) rugged environments is challenging for multi-robot systems. Traditional discrete systems struggle with rough terrain due to limited individual mobility, while modular systems--where rigid, controllable constraints link robot units--improve traversal but suffer from high control complexity and reduced flexibility. To address these limitations, we propose the Multi-Robot System with Controllable Weak Constraints (MRS-CWC), where robot units are connected by constraints with dynamically adjustable stiffness. This adaptive mechanism softens or stiffens in real-time during environmental interactions, ensuring a balance between flexibility and mobility. We formulate the system's dynamics and control model and evaluate MRS-CWC against six baseline methods and an ablation variant in a benchmark dataset with 100 different simulation terrains. Results show that MRS-CWC achieves the highest navigation completion rate and ranks second in success rate, efficiency, and energy cost in the highly rugged terrain group, outperforming all baseline methods without relying on environmental modeling, path planning, or complex control. Even where MRS-CWC ranks second, its performance is only slightly behind a more complex ablation variant with environmental modeling and path planning. Finally, we develop a physical prototype and validate its feasibility in a constructed rugged environment. For videos, simulation benchmarks, and code, please visit this https URL.", 'abstract_zh': '具有可控弱约束的多机器人系统在未知三维崎岖环境中的导航', 'title_zh': 'MRS-CWC: 一种用于未知粗糙3D环境中的移动与导航的可控制约束刚度弱约束多机器人系统'}
{'arxiv_id': 'arXiv:2503.11433', 'title': 'Adaptive Torque Control of Exoskeletons under Spasticity Conditions via Reinforcement Learning', 'authors': 'Andrés Chavarrías, David Rodriguez-Cianca, Pablo Lanillos', 'link': 'https://arxiv.org/abs/2503.11433', 'abstract': 'Spasticity is a common movement disorder symptom in individuals with cerebral palsy, hereditary spastic paraplegia, spinal cord injury and stroke, being one of the most disabling features in the progression of these diseases. Despite the potential benefit of using wearable robots to treat spasticity, their use is not currently recommended to subjects with a level of spasticity above ${1^+}$ on the Modified Ashworth Scale. The varying dynamics of this velocity-dependent tonic stretch reflex make it difficult to deploy safe personalized controllers. Here, we describe a novel adaptive torque controller via deep reinforcement learning (RL) for a knee exoskeleton under joint spasticity conditions, which accounts for task performance and interaction forces reduction. To train the RL agent, we developed a digital twin, including a musculoskeletal-exoskeleton system with joint misalignment and a differentiable spastic reflexes model for the muscles activation. Results for a simulated knee extension movement showed that the agent learns to control the exoskeleton for individuals with different levels of spasticity. The proposed controller was able to reduce maximum torques applied to the human joint under spastic conditions by an average of 10.6\\% and decreases the root mean square until the settling time by 8.9\\% compared to a conventional compliant controller.', 'abstract_zh': '痉挛是脑瘫、遗传性痉挛性截瘫、脊髓损伤和中风等疾病中常见的运动障碍症状之一，是这些疾病进展中最具剥夺性特征之一。尽管使用可穿戴机器人治疗痉挛具有潜在益处，但目前不推荐对改良Ashworth量表上痉挛程度超过${1^+}$的受试者使用。由于这种与速度相关的维持伸展反射动力学的差异性，使得部署安全的个性化控制器变得困难。我们描述了一种基于深度强化学习的新型自适应扭矩控制器，用于在关节痉挛条件下膝关节外骨骼，该控制器考虑了任务性能和交互力的降低。为了训练RL代理，我们开发了一个数字 twin，包括一个包含关节对齐错误的肌骨-外骨骼系统和一个可微分的肌肉激活痉挛反射模型。模拟膝关节伸展运动的结果表明，代理能够学会在不同水平的痉挛条件下控制外骨骼。所提出的控制器在痉挛条件下能够将施加给人类关节的最大扭矩平均降低10.6%，并与传统顺应控制器相比，在调节时间内的均方根降低8.9%。', 'title_zh': '基于强化学习的痉挛状态下外骨骼的自适应扭矩控制'}
{'arxiv_id': 'arXiv:2503.11177', 'title': 'Hand Over or Place On The Table? A Study On Robotic Object Delivery When The Recipient Is Occupied', 'authors': 'Thieu Long Phan, Akansel Cosgun', 'link': 'https://arxiv.org/abs/2503.11177', 'abstract': 'This study investigates the subjective experiences of users in two robotic object delivery methods: direct handover and table placement, when users are occupied with another task. A user study involving 15 participants engaged in a typing game revealed that table placement significantly enhances user experience compared to direct handovers, particularly in terms of satisfaction, perceived safety and intuitiveness. Additionally, handovers negatively impacted typing performance, while all participants expressed a clear preference for table placement as the delivery method. These findings highlight the advantages of table placement in scenarios requiring minimal user disruption.', 'abstract_zh': '本研究调查了用户在执行另一任务时，使用两种机器人物体交付方法（桌面放置与直接交接）的主观体验。一项涉及15名参与者的打字游戏用户研究显示，与直接交接相比，桌面放置显著提高了用户体验，尤其是在满意度、感知安全性及直观性方面。此外，交接过程对打字性能产生了负面影响，所有参与者均明确表示更偏好桌面放置作为交付方法。这些发现强调了在需要 minimal 用户干扰的情境中，桌面放置的优势。', 'title_zh': '桌子上还是交给别人？当接受者忙的时候关于机器人物体交付的研究'}
{'arxiv_id': 'arXiv:2503.11163', 'title': 'A Benchmarking Study of Vision-based Robotic Grasping Algorithms', 'authors': 'Bharath K Rameshbabu, Sumukh S Balakrishna, Brian Flynn, Vinarak Kapoor, Adam Norton, Holly Yanco, Berk Calli', 'link': 'https://arxiv.org/abs/2503.11163', 'abstract': "We present a benchmarking study of vision-based robotic grasping algorithms with distinct approaches, and provide a comparative analysis. In particular, we compare two machine-learning-based and two analytical algorithms using an existing benchmarking protocol from the literature and determine the algorithm's strengths and weaknesses under different experimental conditions. These conditions include variations in lighting, background textures, cameras with different noise levels, and grippers. We also run analogous experiments in simulations and with real robots and present the discrepancies. Some experiments are also run in two different laboratories using same protocols to further analyze the repeatability of our results. We believe that this study, comprising 5040 experiments, provides important insights into the role and challenges of systematic experimentation in robotic manipulation, and guides the development of new algorithms by considering the factors that could impact the performance. The experiment recordings and our benchmarking software are publicly available.", 'abstract_zh': '基于视觉的机器人抓取算法基准研究及比较分析', 'title_zh': '基于视觉的机器人抓取算法基准研究'}
{'arxiv_id': 'arXiv:2503.11083', 'title': 'GP-enhanced Autonomous Drifting Framework using ADMM-based iLQR', 'authors': 'Yangyang Xie, Cheng Hu, Nicolas Baumann, Edoardo Ghignone, Michele Magno, Lei Xie', 'link': 'https://arxiv.org/abs/2503.11083', 'abstract': "Autonomous drifting is a complex challenge due to the highly nonlinear dynamics and the need for precise real-time control, especially in uncertain environments. To address these limitations, this paper presents a hierarchical control framework for autonomous vehicles drifting along general paths, primarily focusing on addressing model inaccuracies and mitigating computational challenges in real-time control. The framework integrates Gaussian Process (GP) regression with an Alternating Direction Method of Multipliers (ADMM)-based iterative Linear Quadratic Regulator (iLQR). GP regression effectively compensates for model residuals, improving accuracy in dynamic conditions. ADMM-based iLQR not only combines the rapid trajectory optimization of iLQR but also utilizes ADMM's strength in decomposing the problem into simpler sub-problems. Simulation results demonstrate the effectiveness of the proposed framework, with significant improvements in both drift trajectory tracking and computational efficiency. Our approach resulted in a 38$\\%$ reduction in RMSE lateral error and achieved an average computation time that is 75$\\%$ lower than that of the Interior Point OPTimizer (IPOPT).", 'abstract_zh': '自主车辆沿一般路径自控漂移是一个由于高度非线性动力学和对精确实时控制的需求而变得复杂的挑战，特别是在不确定环境中。为应对这些限制，本文提出了一种分级控制框架，旨在解决模型不准确性和减轻实时控制中的计算挑战。该框架结合了高斯过程（GP）回归与基于交替方向乘子法（ADMM）的迭代线性二次调节器（iLQR）。GP回归有效地补偿了模型残差，提高了动态条件下的准确性。基于ADMM的iLQR不仅结合了iLQR快速轨迹优化的优势，还利用了ADMM在分解问题为更简单的子问题方面的长处。仿真结果表明，所提出的框架有效提高了漂移轨迹跟踪和计算效率，在均方根横向误差上减少了38%，平均计算时间比Interior Point OPTimizer（IPOPT）低75%。', 'title_zh': '基于ADMM-iLQR的GP增强自主漂移框架'}
{'arxiv_id': 'arXiv:2503.11072', 'title': 'A High-Speed Time-Optimal Trajectory Generation Strategy via a Two-layer Planning Model', 'authors': 'Haotian Tan, Yuan-Hua Ni', 'link': 'https://arxiv.org/abs/2503.11072', 'abstract': "Motion planning and trajectory generation are crucial technologies in various domains including the control of Unmanned Aerial Vehicles (UAV), manipulators, and rockets. However, optimization-based real-time motion planning becomes increasingly challenging due to the problem's probable non-convexity and the inherent limitations of Non-Linear Programming algorithms. Highly nonlinear dynamics, obstacle avoidance constraints, and non-convex inputs can exacerbate these difficulties. To address these hurdles, this paper proposes a two-layer optimization algorithm for 2D vehicles by dynamically reformulating small time horizon convex programming subproblems, aiming to provide real-time guarantees for trajectory optimization. Our approach involves breaking down the original problem into small horizon-based planning cycles with fixed final times, referred to as planning cycles. Each planning cycle is then solved within a series of restricted convex sets identified by our customized search algorithms incrementally. The key benefits of our proposed algorithm include fast computation speeds and lower task time. We demonstrate these advantages through mathematical proofs under some moderate preconditions and experimental results.", 'abstract_zh': '基于优化的二维车辆实时轨迹优化两层算法：动态重构小时间窗凸规划子问题', 'title_zh': '一种基于两层规划模型的高速时间优化轨迹生成策略'}
{'arxiv_id': 'arXiv:2503.11057', 'title': 'Enhancing Regrasping Efficiency Using Prior Grasping Perceptions with Soft Fingertips', 'authors': 'Qiyin Huang, Ruomin Sui, Lunwei Zhang, Yenhang Zhou, Tiemin Li, Yao Jiang', 'link': 'https://arxiv.org/abs/2503.11057', 'abstract': 'Grasping the same object in different postures is often necessary, especially when handling tools or stacked items. Due to unknown object properties and changes in grasping posture, the required grasping force is uncertain and variable. Traditional methods rely on real-time feedback to control the grasping force cautiously, aiming to prevent slipping or damage. However, they overlook reusable information from the initial grasp, treating subsequent regrasping attempts as if they were the first, which significantly reduces efficiency. To improve this, we propose a method that utilizes perception from prior grasping attempts to predict the required grasping force, even with changes in position. We also introduce a calculation method that accounts for fingertip softness and object asymmetry. Theoretical analyses demonstrate the feasibility of predicting grasping forces across various postures after a single grasp. Experimental verifications attest to the accuracy and adaptability of our prediction method. Furthermore, results show that incorporating the predicted grasping force into feedback-based approaches significantly enhances grasping efficiency across a range of everyday objects.', 'abstract_zh': '抓取不同姿态的同一物体在处理工具或堆积物品时往往是必要的。由于物体属性未知和抓取姿态的变化，所需的抓取力不确定且会变化。传统方法依赖实时反馈谨慎控制抓取力，以防止滑落或损坏。然而，它们忽略了初始抓取的可重用信息，将后续重新抓取尝试视为第一次抓取，这显著降低了效率。为了改进这一问题，我们提出了一种方法，利用先前抓取尝试的感知预测所需的抓取力，即使在位置发生变化的情况下也是如此。我们还引入了一种考虑指尖柔软度和物体不对称性的计算方法。理论分析表明，在单次抓取后预测各种姿态下的抓取力是可行的。实验验证证实了我们预测方法的准确性和适应性。此外，结果表明，将预测的抓取力纳入基于反馈的方法中，可以显著提高各种日常物体抓取的效率。', 'title_zh': '基于先验抓取感知和软指尖提升重新抓取效率'}
{'arxiv_id': 'arXiv:2503.11049', 'title': 'Fish Mouth Inspired Origami Gripper for Robust Multi-Type Underwater Grasping', 'authors': 'Honghao Guo, Junda Huang, Ian Zhang, Boyuan Liang, Xin Ma, Yunhui Liu, Jianshu Zhou', 'link': 'https://arxiv.org/abs/2503.11049', 'abstract': 'Robotic grasping and manipulation in underwater environments present unique challenges for robotic hands traditionally used on land. These challenges stem from dynamic water conditions, a wide range of object properties from soft to stiff, irregular object shapes, and varying surface frictions. One common approach involves developing finger-based hands with embedded compliance using underactuation and soft actuators. This study introduces an effective alternative solution that does not rely on finger-based hand designs. We present a fish mouth inspired origami gripper that utilizes a single degree of freedom to perform a variety of robust grasping tasks underwater. The innovative structure transforms a simple uniaxial pulling motion into a grasping action based on the Yoshimura crease pattern folding. The origami gripper offers distinct advantages, including scalable and optimizable design, grasping compliance, and robustness, with four grasping types: pinch, power grasp, simultaneous grasping of multiple objects, and scooping from the seabed. In this work, we detail the design, modeling, fabrication, and validation of a specialized underwater gripper capable of handling various marine creatures, including jellyfish, crabs, and abalone. By leveraging an origami and bio-inspired approach, the presented gripper demonstrates promising potential for robotic grasping and manipulation in underwater environments.', 'abstract_zh': '水下环境中的机器人抓取与操作对传统陆地使用的机器人手提出了独特的挑战。这些挑战源于动态水环境、从柔软到刚性的广泛物体特性、不规则的物体形状以及变化的表面摩擦。一种常见方法是开发具有嵌入式顺应性的基于手指的手部，使用欠驱动和软致动器。本研究提出了一种有效替代方案，不依赖于基于手指的手部设计。我们提出了一种受鱼嘴启发的折纸 gripper，利用单自由度执行多种稳健的水下抓取任务。该创新结构将简单的单轴拉伸运动转化为基于吉森马折纸折叠模式的抓取动作。折纸 gripper 具有可扩展性和可优化设计、抓取顺应性和鲁棒性等优势，包括捏取、大力抓取、多物体同时抓取和海底抓取四种抓取类型。在本文中，我们详细介绍了设计、建模、制造和验证一种专门用于处理各种海洋生物（包括水母、螃蟹和鲍鱼）的水下 gripper。通过利用折纸和生物启发的方法，所提出的 gripper 展示了在水下环境中进行机器人抓取和操作的潜在应用前景。', 'title_zh': '鱼嘴启发式折纸式 Handbook 机器人爪具及其在多类型水下抓取中的应用'}
{'arxiv_id': 'arXiv:2503.11041', 'title': 'Enhancing Adaptivity of Two-Fingered Object Reorientation Using Tactile-based Online Optimization of Deconstructed Actions', 'authors': 'Qiyin Huang, Tiemin Li, Yao Jiang', 'link': 'https://arxiv.org/abs/2503.11041', 'abstract': 'Object reorientation is a critical task for robotic grippers, especially when manipulating objects within constrained environments. The task poses significant challenges for motion planning due to the high-dimensional output actions with the complex input information, including unknown object properties and nonlinear contact forces. Traditional approaches simplify the problem by reducing degrees of freedom, limiting contact forms, or acquiring environment/object information in advance, which significantly compromises adaptability. To address these challenges, we deconstruct the complex output actions into three fundamental types based on tactile sensing: task-oriented actions, constraint-oriented actions, and coordinating actions. These actions are then optimized online using gradient optimization to enhance adaptability. Key contributions include simplifying contact state perception, decomposing complex gripper actions, and enabling online action optimization for handling unknown objects or environmental constraints. Experimental results demonstrate that the proposed method is effective across a range of everyday objects, regardless of environmental contact. Additionally, the method exhibits robust performance even in the presence of unknown contacts and nonlinear external disturbances.', 'abstract_zh': '基于触觉感知的复杂输出动作分解与在线优化：面向物体重定向的适应性抓取方法', 'title_zh': '基于触觉在线优化分解动作的二指物体重定向适应性增强'}
{'arxiv_id': 'arXiv:2503.11012', 'title': 'Robotic Sim-to-Real Transfer for Long-Horizon Pick-and-Place Tasks in the Robotic Sim2Real Competition', 'authors': 'Ming Yang, Hongyu Cao, Lixuan Zhao, Chenrui Zhang, Yaran Chen', 'link': 'https://arxiv.org/abs/2503.11012', 'abstract': 'This paper presents a fully autonomous robotic system that performs sim-to-real transfer in complex long-horizon tasks involving navigation, recognition, grasping, and stacking in an environment with multiple obstacles.\nThe key feature of the system is the ability to overcome typical sensing and actuation discrepancies during sim-to-real transfer and to achieve consistent performance without any algorithmic modifications. To accomplish this, a lightweight noise-resistant visual perception system and a nonlinearity-robust servo system are adopted.\nWe conduct a series of tests in both simulated and real-world environments. The visual perception system achieves the speed of 11 ms per frame due to its lightweight nature, and the servo system achieves sub-centimeter accuracy with the proposed controller. Both exhibit high consistency during sim-to-real transfer. Benefiting from these, our robotic system took first place in the mineral searching task of the Robotic Sim2Real Challenge hosted at ICRA 2024.', 'abstract_zh': '一种在复杂长期任务中实现导航、识别、抓取和堆叠的全自主机器人系统：从模拟到现实的转移', 'title_zh': 'Robotic 模拟到现实的过渡：长期规划的取放任务'}
{'arxiv_id': 'arXiv:2503.11000', 'title': 'Optimal Design of Continuum Robots with Reachability Constraints', 'authors': 'Hyunmin Cheong, Mehran Ebrahimi, Timothy Duggan', 'link': 'https://arxiv.org/abs/2503.11000', 'abstract': 'While multi-joint continuum robots are highly dexterous and flexible, designing an optimal robot can be challenging due to its kinematics involving curvatures. Hence, the current work presents a computational method developed to find optimal designs of continuum robots given reachability constraints. First, we leverage both forward and inverse kinematic computations to perform reachability analysis in an efficient yet accurate manner. While implementing inverse kinematics, we also integrate torque minimization at joints such that robot configurations with the minimum actuator torque required to reach a given workspace could be found. Lastly, we apply an estimation of distribution algorithm (EDA) to find optimal robot dimensions while considering reachability, where the objective function could be the total length of the robot or the actuator torque required to operate the robot. Through three application problems, we show that the EDA is superior to a genetic algorithm (GA) in finding better solutions within a given number of iterations, as the objective values of the best solutions found by the EDA are 4-15\\% lower than those found by the GA.', 'abstract_zh': '虽然连续关节连续机器人具有高度的灵巧性和灵活性，但由于其涉及曲率的运动学复杂性，对其进行最优设计可能具有挑战性。因此，本文提出了一种计算方法，旨在在可达性约束下寻找连续机器人的最优设计。首先，我们利用正向和逆向运动学计算高效且精确地进行可达性分析。在实现逆向运动学时，我们还整合了减小关节扭矩的计算，以便找到所需最小驱动器扭矩即可达给定工作空间的机器人构型。最后，我们应用估计分布算法（EDA）在考虑可达性的条件下寻找最优的机器人尺寸，目标函数可以是机器人的总长度或操作机器人所需的驱动器扭矩。通过三个应用问题，我们表明，在给定的迭代次数内，EDA在找到更好的解决方案方面优于遗传算法（GA），因为EDA找到的最佳解的目标值比GA低4-15%。', 'title_zh': '具有可达性约束的连续机器人最优设计'}
{'arxiv_id': 'arXiv:2503.10928', 'title': 'Design and Development of the MeCO Open-Source Autonomous Underwater Vehicle', 'authors': 'David Widhalm, Cory Ohnsted, Corey Knutson, Demetrious Kutzke, Sakshi Singh, Rishi Mukherjee, Grant Schwidder, Ying-Kun Wu, Junaed Sattar', 'link': 'https://arxiv.org/abs/2503.10928', 'abstract': 'We present MeCO, the Medium Cost Open-source autonomous underwater vehicle (AUV), a versatile autonomous vehicle designed to support research and development in underwater human-robot interaction (UHRI) and marine robotics in general. An inexpensive platform to build compared to similarly-capable AUVs, the MeCO design and software are released under open-source licenses, making it a cost effective, extensible, and open platform. It is equipped with UHRI-focused systems, such as front and side facing displays, light-based communication devices, a transducer for acoustic interaction, and stereo vision, in addition to typical AUV sensing and actuation components. Additionally, MeCO is capable of real-time deep learning inference using the latest edge computing devices, while maintaining low-latency, closed-loop control through high-performance microcontrollers. MeCO is designed from the ground up for modularity in internal electronics, external payloads, and software architecture, exploiting open-source robotics and containerarization tools. We demonstrate the diverse capabilities of MeCO through simulated, closed-water, and open-water experiments. All resources necessary to build and run MeCO, including software and hardware design, have been made publicly available.', 'abstract_zh': 'MeCO：一种中等成本开源自主水下机器人，用于支持水下人机交互和海洋机器人技术的发展', 'title_zh': '开源自主水下车辆MeCO的设计与开发'}
{'arxiv_id': 'arXiv:2503.10919', 'title': 'Data-Driven Soft Robot Control via Adiabatic Spectral Submanifolds', 'authors': 'Roshan S. Kaundinya, John Irvin Alora, Jonas G. Matt, Luis A. Pabon, Marco Pavone, George Haller', 'link': 'https://arxiv.org/abs/2503.10919', 'abstract': 'The mechanical complexity of soft robots creates significant challenges for their model-based control. Specifically, linear data-driven models have struggled to control soft robots on complex, spatially extended paths that explore regions with significant nonlinear behavior. To account for these nonlinearities, we develop here a model-predictive control strategy based on the recent theory of adiabatic spectral submanifolds (aSSMs). This theory is applicable because the internal vibrations of heavily overdamped robots decay at a speed that is much faster than the desired speed of the robot along its intended path. In that case, low-dimensional attracting invariant manifolds (aSSMs) emanate from the path and carry the dominant dynamics of the robot. Aided by this recent theory, we devise an aSSM-based model-predictive control scheme purely from data. We demonstrate the effectiveness of this data-driven model on various dynamic trajectory tracking tasks on a high-fidelity and high-dimensional finite-element model of a soft trunk robot. Notably, we find that four- or five-dimensional aSSM-reduced models outperform the tracking performance of other data-driven modeling methods by a factor up to 10 across all closed-loop control tasks.', 'abstract_zh': '软体机器人的机械复杂性为其基于模型的控制带来了显著挑战。具体而言，线性数据驱动模型难以控制沿着复杂、空间扩展路径并探索具有显著非线性行为区域的软体机器人。为应对这些非线性，我们在此基于最近的渐近谱子流形理论（aSSMs）发展了一种模型预测控制策略。由于严重过阻尼机器人内部振动的衰减速度远快于机器人沿预期路径的期望速度，该理论适用。在该情况下，低维吸引不变子流形（aSSMs）从路径出发并承载机器人的主导动力学。借助这一最新理论，我们纯粹从数据出发设计了一种基于aSSM的模型预测控制方案。我们通过在高保真度和高维有限元模型的软体躯干机器人上进行各种动态轨迹跟踪任务，证明了这种数据驱动模型的有效性。值得注意的是，我们发现四维或五维aSSM减少模型在所有闭环控制任务中的跟踪性能比其他数据驱动建模方法高出高达10倍。', 'title_zh': '数据驱动的软机器人控制通过准静态谱子流形'}
{'arxiv_id': 'arXiv:2503.10904', 'title': 'Transferring Kinesthetic Demonstrations across Diverse Objects for Manipulation Planning', 'authors': 'Dibyendu Das, Aditya Patankar, Nilanjan Chakraborty, C. R. Ramakrishnan, I.V. Ramakrishnan', 'link': 'https://arxiv.org/abs/2503.10904', 'abstract': 'Given a demonstration of a complex manipulation task such as pouring liquid from one container to another, we seek to generate a motion plan for a new task instance involving objects with different geometries. This is non-trivial since we need to simultaneously ensure that the implicit motion constraints are satisfied (glass held upright while moving), the motion is collision-free, and that the task is successful (e.g. liquid is poured into the target container). We solve this problem by identifying positions of critical locations and associating a reference frame (called motion transfer frames) on the manipulated object and the target, selected based on their geometries and the task at hand. By tracking and transferring the path of the motion transfer frames, we generate motion plans for arbitrary task instances with objects of different geometries and poses. We show results from simulation as well as robot experiments on physical objects to evaluate the effectiveness of our solution.', 'abstract_zh': '给定一个复杂的操作任务演示，例如将液体从一个容器倒入另一个容器，我们需要生成一个涉及不同几何形状物体的新任务实例的操作计划。这具有挑战性，因为我们需要同时确保隐式运动约束得到满足（例如，在移动过程中玻璃器皿保持竖直），确保运动无碰撞，并且任务成功（例如，液体被倒入目标容器）。我们通过识别关键位置并为操作对象和目标选择基于其几何形状和任务的参考框架（称为运动传输框架）来解决这个问题。通过跟踪和传输运动传输框架的路径，我们可以为不同几何形状和姿态的物体生成任意任务实例的操作计划。我们通过仿真结果和物理对象的机器人实验展示了我们的解决方案的有效性。', 'title_zh': '在多样化对象上转移运动感知演示以进行操作规划'}
{'arxiv_id': 'arXiv:2503.10884', 'title': 'Fusion of Indirect Methods and Iterative Learning for Persistent Velocity Trajectory Optimization of a Sustainably Powered Autonomous Surface Vessel', 'authors': 'Kavin M. Govindarajan, Devansh R Agrawal, Dimitra Panagou, Chris Vermillion', 'link': 'https://arxiv.org/abs/2503.10884', 'abstract': 'In this paper, we present the methodology and results for a real-time velocity trajectory optimization for a solar-powered autonomous surface vessel (ASV), where we combine indirect optimal control techniques with iterative learning. The ASV exhibits cyclic operation due to the nature of the solar profile, but weather patterns create inevitable disturbances in this profile. The nature of the problem results in a formulation where the satisfaction of pointwise-in-time state of charge constraints does not generally guarantee persistent feasibility, and the goal is to maximize information gathered over a very long (ultimately persistent) time duration. To address these challenges, we first use barrier functions to tighten pointwise-in-time state of charge constraints by the minimal amount necessary to achieve persistent feasibility. We then use indirect methods to derive a simple switching control law, where the optimal velocity is shown to be an undetermined constant value during each constraint-inactive time segment. To identify this optimal constant velocity (which can vary from one segment to the next), we employ an iterative learning approach. The result is a simple closed-form control law that does not require a solar forecast. We present simulation-based validation results, based on a model of the SeaTrac SP-48 ASV and solar data from the North Carolina coast. These simulation results show that the proposed methodology, which amounts to a closed-form controller and simple iterative learning update law, performs nearly as well as a model predictive control approach that requires an accurate future solar forecast and significantly greater computational capability.', 'abstract_zh': '基于间接最优控制与时域迭代学习的太阳能动力自主水面舰艇实时速度轨迹优化方法与结果', 'title_zh': '间接方法与迭代学习融合的持续动力自主水面船舶持久速度轨迹优化'}
{'arxiv_id': 'arXiv:2503.10843', 'title': 'Communication-Aware Iterative Map Compression for Online Path-Planning', 'authors': 'Evangelos Psomiadis, Ali Reza Pedram, Dipankar Maity, Panagiotis Tsiotras', 'link': 'https://arxiv.org/abs/2503.10843', 'abstract': 'This paper addresses the problem of optimizing communicated information among heterogeneous, resource-aware robot teams to facilitate their navigation. In such operations, a mobile robot compresses its local map to assist another robot in reaching a target within an uncharted environment. The primary challenge lies in ensuring that the map compression step balances network load while transmitting only the most essential information for effective navigation. We propose a communication framework that sequentially selects the optimal map compression in a task-driven, communication-aware manner. It introduces a decoder capable of iterative map estimation, handling noise through Kalman filter techniques. The computational speed of our decoder allows for a larger compression template set compared to previous methods, and enables applications in more challenging environments. Specifically, our simulations demonstrate a remarkable 98% reduction in communicated information, compared to a framework that transmits the raw data, on a large Mars inclination map and an Earth map, all while maintaining similar planning costs. Furthermore, our method significantly reduces computational time compared to the state-of-the-art approach.', 'abstract_zh': '这篇论文探讨了在异构、资源感知机器人团队中优化传递信息的问题，以促进其导航。在此类操作中，移动机器人将其局部地图压缩以帮助另一机器人在未勘探环境中到达目标。主要挑战在于确保地图压缩步骤在传输对于有效导航至关重要的信息时能够平衡网络负载。我们提出了一种通信框架，该框架在任务驱动和通信感知的方式下顺序选择最优的地图压缩。该框架引入了一个解码器，能够通过卡尔曼滤波技术处理噪声，并进行迭代的地图估计。我们的解码器的计算速度允许使用比先前方法更大的压缩模板集，从而适用于更具挑战性的环境。具体来说，我们的仿真结果显示，在一个大型火星倾斜地图和一个地球地图上，与传输原始数据的框架相比，通信信息减少了98%，同时保持了类似的规划成本。此外，与当前最先进的方法相比，我们的方法显著减少了计算时间。', 'title_zh': '通信感知迭代地图压缩以实现在线路径规划'}
{'arxiv_id': 'arXiv:2503.11300', 'title': 'Six-DoF Stewart Platform Motion Simulator Control using Switchable Model Predictive Control', 'authors': 'Jiangwei Zhao, Zhengjia Xu, Dongsu Wu, Yingrui Cao, Jinpeng Xie', 'link': 'https://arxiv.org/abs/2503.11300', 'abstract': 'Due to excellent mechanism characteristics of high rigidity, maneuverability and strength-to-weight ratio, 6 Degree-of-Freedom (DoF) Stewart structure is widely adopted to construct flight simulator platforms for replicating motion feelings during training pilots. Unlike conventional serial link manipulator based mechanisms, Upset Prevention and Recovery Training (UPRT) in complex flight status is often accompanied by large speed and violent rate of change in angular velocity of the simulator. However, Classical Washout Filter (CWF) based Motion Cueing Algorithm (MCA) shows limitations in providing rapid response to drive motors to satisfy high accuracy performance requirements. This paper aims at exploiting Model Predictive Control (MPC) based MCA which is proved to be efficient in Hexapod-based motion simulators through controlling over limited linear workspace. With respect to uncertainties and control solution errors from the extraction of Terminal Constraints (COTC), this paper proposes a Switchable Model Predictive Control (S-MPC) based MCA under model adaptive architecture to mitigate the solution uncertainties and inaccuracies. It is verified that high accurate tracking is achievable using the MPC-based MCA with COTC within the simulator operating envelope. The proposed method provides optimal tracking solutions by switching to MPC based MCA without COTC outside the operating envelope. By demonstrating the UPRT with horizontal stall conditions following Average Absolute Scale(AAS) evaluation criteria, the proposed S-MPC based MCA outperforms MPC based MCA and SWF based MCA by 42.34% and 65.30%, respectively.', 'abstract_zh': '基于模型预测控制的飞行模拟器运动诱导算法研究：一种自适应切换策略提升操纵稳定性培训仿真精度', 'title_zh': '六自由度史陶伯平台运动模拟器控制的可切换模型预测控制'}
{'arxiv_id': 'arXiv:2503.10692', 'title': 'Exploring the best way for UAV visual localization under Low-altitude Multi-view Observation Condition: a Benchmark', 'authors': 'Yibin Ye, Xichao Teng, Shuo Chen, Zhang Li, Leqi Liu, Qifeng Yu, Tao Tan', 'link': 'https://arxiv.org/abs/2503.10692', 'abstract': 'Absolute Visual Localization (AVL) enables Unmanned Aerial Vehicle (UAV) to determine its position in GNSS-denied environments by establishing geometric relationships between UAV images and geo-tagged reference maps. While many previous works have achieved AVL with image retrieval and matching techniques, research in low-altitude multi-view scenarios still remains limited. Low-altitude Multi-view condition presents greater challenges due to extreme viewpoint changes. To explore the best UAV AVL approach in such condition, we proposed this benchmark. Firstly, a large-scale Low-altitude Multi-view dataset called AnyVisLoc was constructed. This dataset includes 18,000 images captured at multiple scenes and altitudes, along with 2.5D reference maps containing aerial photogrammetry maps and historical satellite maps. Secondly, a unified framework was proposed to integrate the state-of-the-art AVL approaches and comprehensively test their performance. The best combined method was chosen as the baseline and the key factors that influencing localization accuracy are thoroughly analyzed based on it. This baseline achieved a 74.1% localization accuracy within 5m under Low-altitude, Multi-view conditions. In addition, a novel retrieval metric called PDM@K was introduced to better align with the characteristics of the UAV AVL task. Overall, this benchmark revealed the challenges of Low-altitude, Multi-view UAV AVL and provided valuable guidance for future research. The dataset and codes are available at this https URL', 'abstract_zh': '绝对视觉定位（AVL）使无人驾驶 aerial vehicle （UAV）能够在不依赖GNSS的环境中通过建立UAV图像与地理标记参考地图之间的几何关系来确定其位置。尽管许多 previous works 已经通过图像检索和匹配技术实现了 AVL，但在低空多视角场景的研究仍然有限。低空多视角条件带来了更大的挑战，因为视角变化极端。为了在这种条件下探索最佳的 UAV AVL 方法，我们提出了这一基准。首先，构建了一个大规模的低空多视角数据集 AnyVisLoc，该数据集包含在多个场景和高度拍摄的 18,000 张图像，以及包含航空摄影测量图和历史卫星地图的 2.5D 参考地图。其次，提出了一种统一的框架来整合最先进的 AVL 方法并全面测试其性能。基于此基准，选择最佳组合方法作为基线，并基于该基线详细分析影响定位精度的关键因素。该基线在低空多视角条件下实现了 74.1% 的 5 米以内定位精度。此外，引入了一种新的检索指标 PDM@K，以更好地适应 UAV AVL 任务的特点。总体而言，这一基准揭示了低空多视角 UAV AVL 的挑战，并为未来研究提供了宝贵指导。数据集和代码可在以下网址获取。', 'title_zh': '探索低空多视角观测条件下无人机视觉定位的最佳方法：一个基准研究'}
