{'arxiv_id': 'arXiv:2506.17184', 'title': 'Judo: A User-Friendly Open-Source Package for Sampling-Based Model Predictive Control', 'authors': "Albert H. Li, Brandon Hung, Aaron D. Ames, Jiuguang Wang, Simon Le Cleac'h, Preston Culbertson", 'link': 'https://arxiv.org/abs/2506.17184', 'abstract': 'Recent advancements in parallel simulation and successful robotic applications are spurring a resurgence in sampling-based model predictive control. To build on this progress, however, the robotics community needs common tooling for prototyping, evaluating, and deploying sampling-based controllers. We introduce Judo, a software package designed to address this need. To facilitate rapid prototyping and evaluation, Judo provides robust implementations of common sampling-based MPC algorithms and standardized benchmark tasks. It further emphasizes usability with simple but extensible interfaces for controller and task definitions, asynchronous execution for straightforward simulation-to-hardware transfer, and a highly customizable interactive GUI for tuning controllers interactively. While written in Python, the software leverages MuJoCo as its physics backend to achieve real-time performance, which we validate across both consumer and server-grade hardware. Code at this https URL.', 'abstract_zh': '最近并行仿真技术的进展及其在机器人领域的成功应用正推动基于采样模型预测控制的复兴。为了在此基础上进一步发展，机器人社区需要一套通用工具来原型设计、评估和部署基于采样模型预测控制器。为此，我们引入了Judo，一个旨在解决这一需求的软件包。为了促进快速原型设计和评估，Judo 提供了常见的基于采样模型预测控制算法的 robust 实现和标准化基准任务。它还强调易用性，通过简单但可扩展的控制器和任务定义接口、异步执行以实现仿真到硬件的简便转移，以及高度可自定义的交互式 GUI 来交互调整控制器。虽然用 Python 编写，但该软件利用 MuJoCo 作为物理后端以实现实时性能，并已在消费级和服务器级硬件上进行了验证。相关代码请参见此 https URL。', 'title_zh': 'judo：一个用户友好的基于采样的模型预测控制开源软件包'}
{'arxiv_id': 'arXiv:2506.17110', 'title': 'Monocular One-Shot Metric-Depth Alignment for RGB-Based Robot Grasping', 'authors': 'Teng Guo, Baichuan Huang, Jingjin Yu', 'link': 'https://arxiv.org/abs/2506.17110', 'abstract': 'Accurate 6D object pose estimation is a prerequisite for successfully completing robotic prehensile and non-prehensile manipulation tasks. At present, 6D pose estimation for robotic manipulation generally relies on depth sensors based on, e.g., structured light, time-of-flight, and stereo-vision, which can be expensive, produce noisy output (as compared with RGB cameras), and fail to handle transparent objects. On the other hand, state-of-the-art monocular depth estimation models (MDEMs) provide only affine-invariant depths up to an unknown scale and shift. Metric MDEMs achieve some successful zero-shot results on public datasets, but fail to generalize. We propose a novel framework, Monocular One-shot Metric-depth Alignment (MOMA), to recover metric depth from a single RGB image, through a one-shot adaptation building on MDEM techniques. MOMA performs scale-rotation-shift alignments during camera calibration, guided by sparse ground-truth depth points, enabling accurate depth estimation without additional data collection or model retraining on the testing setup. MOMA supports fine-tuning the MDEM on transparent objects, demonstrating strong generalization capabilities. Real-world experiments on tabletop 2-finger grasping and suction-based bin-picking applications show MOMA achieves high success rates in diverse tasks, confirming its effectiveness.', 'abstract_zh': '单目一次-shot métric深度对齐（MOMA）：从单张RGB图像恢复 métric深度', 'title_zh': '基于RGB的一次成像度量深度对齐方法用于机器人抓取'}
{'arxiv_id': 'arXiv:2506.16748', 'title': 'A Scalable Post-Processing Pipeline for Large-Scale Free-Space Multi-Agent Path Planning with PiBT', 'authors': 'Arjo Chakravarty, Michael X. Grey, M. A. Viraj J. Muthugala, Mohan Rajesh Elara', 'link': 'https://arxiv.org/abs/2506.16748', 'abstract': 'Free-space multi-agent path planning remains challenging at large scales. Most existing methods either offer optimality guarantees but do not scale beyond a few dozen agents, or rely on grid-world assumptions that do not generalize well to continuous space. In this work, we propose a hybrid, rule-based planning framework that combines Priority Inheritance with Backtracking (PiBT) with a novel safety-aware path smoothing method. Our approach extends PiBT to 8-connected grids and selectively applies string-pulling based smoothing while preserving collision safety through local interaction awareness and a fallback collision resolution step based on Safe Interval Path Planning (SIPP). This design allows us to reduce overall path lengths while maintaining real-time performance. We demonstrate that our method can scale to over 500 agents in large free-space environments, outperforming existing any-angle and optimal methods in terms of runtime, while producing near-optimal trajectories in sparse domains. Our results suggest this framework is a promising building block for scalable, real-time multi-agent navigation in robotics systems operating beyond grid constraints.', 'abstract_zh': '自由空间多 Agents 路径规划在大规模场景下仍具挑战性。大多数现有方法要么提供了最优性保证但不能扩展到数十个以上的 Agents，要么依赖于网格世界的假设，不能很好地泛化到连续空间。在本文中，我们提出了一种基于优先级继承与回溯（PiBT）的混合规则规划框架，并结合了一种新型的安全意识路径平滑方法。我们的方法将 PiBT 扩展到 8 连通网格上，并在保持碰撞安全的前提下，通过局部交互意识和基于 Safe Interval Path Planning (SIPP) 的回退碰撞解决步骤，选择性地应用字符串拉伸基于的平滑方法。这种设计使我们在保持实时性能的同时，减少整体路径长度。我们证明，我们的方法可以扩展到超过 500 个 Agents 的大型自由空间环境，在运行时性能方面优于现有的任意角度和最优方法，同时在稀疏领域生成接近最优的轨迹。实验结果表明，该框架是构建适用于超越网格约束的大规模、实时多 Agents 导航的有前景的基本组件。', 'title_zh': '一种用于大规模自由空间多agent路径规划的可扩展后处理管道PiBT'}
{'arxiv_id': 'arXiv:2506.16710', 'title': 'Experimental Setup and Software Pipeline to Evaluate Optimization based Autonomous Multi-Robot Search Algorithms', 'authors': 'Aditya Bhatt, Mary Katherine Corra, Franklin Merlo, Prajit KrisshnaKumar, Souma Chowdhury', 'link': 'https://arxiv.org/abs/2506.16710', 'abstract': 'Signal source localization has been a problem of interest in the multi-robot systems domain given its applications in search \\& rescue and hazard localization in various industrial and outdoor settings. A variety of multi-robot search algorithms exist that usually formulate and solve the associated autonomous motion planning problem as a heuristic model-free or belief model-based optimization process. Most of these algorithms however remains tested only in simulation, thereby losing the opportunity to generate knowledge about how such algorithms would compare/contrast in a real physical setting in terms of search performance and real-time computing performance. To address this gap, this paper presents a new lab-scale physical setup and associated open-source software pipeline to evaluate and benchmark multi-robot search algorithms. The presented physical setup innovatively uses an acoustic source (that is safe and inexpensive) and small ground robots (e-pucks) operating in a standard motion-capture environment. This setup can be easily recreated and used by most robotics researchers. The acoustic source also presents interesting uncertainty in terms of its noise-to-signal ratio, which is useful to assess sim-to-real gaps. The overall software pipeline is designed to readily interface with any multi-robot search algorithm with minimal effort and is executable in parallel asynchronous form. This pipeline includes a framework for distributed implementation of multi-robot or swarm search algorithms, integrated with a ROS (Robotics Operating System)-based software stack for motion capture supported localization. The utility of this novel setup is demonstrated by using it to evaluate two state-of-the-art multi-robot search algorithms, based on swarm optimization and batch-Bayesian Optimization (called Bayes-Swarm), as well as a random walk baseline.', 'abstract_zh': '多机器人信号源定位的实验室物理设置及其开源软件管道的研究', 'title_zh': '基于优化的自主多机器人搜索算法评估的实验设置与软件管道'}
{'arxiv_id': 'arXiv:2506.16593', 'title': 'DRIVE Through the Unpredictability:From a Protocol Investigating Slip to a Metric Estimating Command Uncertainty', 'authors': 'Nicolas Samson, William Larrivée-Hardy, William Dubois, Élie Roy-Brouard, Edith Brotherton, Dominic Baril, Julien Lépine, François Pomerleau', 'link': 'https://arxiv.org/abs/2506.16593', 'abstract': "Off-road autonomous navigation is a challenging task as it is mainly dependent on the accuracy of the motion model. Motion model performances are limited by their ability to predict the interaction between the terrain and the UGV, which an onboard sensor can not directly measure. In this work, we propose using the DRIVE protocol to standardize the collection of data for system identification and characterization of the slip state space. We validated this protocol by acquiring a dataset with two platforms (from 75 kg to 470 kg) on six terrains (i.e., asphalt, grass, gravel, ice, mud, sand) for a total of 4.9 hours and 14.7 km. Using this data, we evaluate the DRIVE protocol's ability to explore the velocity command space and identify the reachable velocities for terrain-robot interactions. We investigated the transfer function between the command velocity space and the resulting steady-state slip for an SSMR. An unpredictability metric is proposed to estimate command uncertainty and help assess risk likelihood and severity in deployment. Finally, we share our lessons learned on running system identification on large UGV to help the community.", 'abstract_zh': '离线自主导航是一个具有挑战性的任务，因为它主要依赖于运动模型的准确性。运动模型性能受限于它们预测地形与UGV之间相互作用的能力，而这种相互作用是车载传感器无法直接测量的。在这项工作中，我们提出使用DRIVE协议来标准化系统识别和描述滑动状态空间的数据收集。通过在六种不同地形（即沥青、草地、碎石、冰、泥地、沙地）上使用两种平台（质量从75公斤到470公斤）收集数据，总时长为4.9小时，行驶距离14.7公里，验证了该协议。利用这些数据，我们评估了DRIVE协议探索速度命令空间和识别地形-机器人相互作用可达到的速度范围的能力。我们研究了SSMR的速度命令空间与最终稳定滑动之间的传递函数。提出了一个不确定性度量指标，以估计命令不确定性并帮助评估部署中的风险可能性和严重程度。最后，我们分享了在大型UGV上进行系统识别过程中获取的经验教训，以帮助社区。', 'title_zh': 'DRIVE通过不确定性：从一个研究滑动的协议到一个命令不确定性估计度量'}
{'arxiv_id': 'arXiv:2506.16555', 'title': 'An Optimization-Augmented Control Framework for Single and Coordinated Multi-Arm Robotic Manipulation', 'authors': 'Melih Özcan, Ozgur S. Oguz', 'link': 'https://arxiv.org/abs/2506.16555', 'abstract': "Robotic manipulation demands precise control over both contact forces and motion trajectories. While force control is essential for achieving compliant interaction and high-frequency adaptation, it is limited to operations in close proximity to the manipulated object and often fails to maintain stable orientation during extended motion sequences. Conversely, optimization-based motion planning excels in generating collision-free trajectories over the robot's configuration space but struggles with dynamic interactions where contact forces play a crucial role. To address these limitations, we propose a multi-modal control framework that combines force control and optimization-augmented motion planning to tackle complex robotic manipulation tasks in a sequential manner, enabling seamless switching between control modes based on task requirements. Our approach decomposes complex tasks into subtasks, each dynamically assigned to one of three control modes: Pure optimization for global motion planning, pure force control for precise interaction, or hybrid control for tasks requiring simultaneous trajectory tracking and force regulation. This framework is particularly advantageous for bimanual and multi-arm manipulation, where synchronous motion and coordination among arms are essential while considering both the manipulated object and environmental constraints. We demonstrate the versatility of our method through a range of long-horizon manipulation tasks, including single-arm, bimanual, and multi-arm applications, highlighting its ability to handle both free-space motion and contact-rich manipulation with robustness and precision.", 'abstract_zh': '机器人操作需要对接触力和运动轨迹进行精确控制。虽然力控制对于实现柔顺交互和高频适应至关重要，但它受限于与操作对象的近距离操作，并且在长时间的运动序列中往往难以维持稳定的方位。相反，基于优化的运动规划在生成机器人配置空间中的无碰撞轨迹方面表现出色，但在涉及接触力起关键作用的动态交互中却力不从心。为了解决这些限制，我们提出了一种多模态控制框架，该框架结合了力控制和优化增强的运动规划，以顺序方式应对复杂的机器人操作任务，并根据任务需求无缝切换控制模式。该方法将复杂的任务分解为子任务，并动态分配给三种控制模式之一：纯粹的优化用于全局运动规划、纯粹的力控制用于精确交互，或混合控制用于需要同时进行轨迹跟踪和力调节的任务。该框架特别适用于双臂和多臂操作，其中同步运动和手臂之间的协调至关重要，同时需要考虑操作对象和环境约束。通过一系列长时程操作任务，包括单臂、双臂和多臂应用，我们的方法展示了其在自由空间运动和丰富的接触操作中具有鲁棒性和精确性的 versatility。', 'title_zh': '单臂和协调多臂机器人操作的优化增强控制框架'}
{'arxiv_id': 'arXiv:2506.16427', 'title': 'Full-Pose Tracking via Robust Control for Over-Actuated Multirotors', 'authors': 'Mohamad Hachem, Clément Roos, Thierry Miquel, Murat Bronz', 'link': 'https://arxiv.org/abs/2506.16427', 'abstract': "This paper presents a robust cascaded control architecture for over-actuated multirotors. It extends the Incremental Nonlinear Dynamic Inversion (INDI) control combined with structured H_inf control, initially proposed for under-actuated multirotors, to a broader range of multirotor configurations. To achieve precise and robust attitude and position tracking, we employ a weighted least-squares geometric guidance control allocation method, formulated as a quadratic optimization problem, enabling full-pose tracking. The proposed approach effectively addresses key challenges, such as preventing infeasible pose references and enhancing robustness against disturbances, as well as considering multirotor's actual physical limitations. Numerical simulations with an over-actuated hexacopter validate the method's effectiveness, demonstrating its adaptability to diverse mission scenarios and its potential for real-world aerial applications.", 'abstract_zh': '本文提出了一种适用于过度驱动多旋翼者的稳健级联控制架构。该架构将初始用于欠驱动多旋翼者的增量非线性动态逆控制（INDI）与结构化H_inf控制相结合，扩展到更广泛的多旋翼配置。为了实现精确且稳健的姿态和位置跟踪，我们采用了一种加权最小二乘几何引导控制分配方法，将其形式化为二次优化问题，从而实现全方位姿态跟踪。所提出的方法有效应对了诸如预防不可行姿态参考和增强对干扰的鲁棒性等关键挑战，并考虑了多旋翼的实际物理限制。数值 simulations 与一个过度驱动的六旋翼机的仿真验证了该方法的有效性，展示了其在多样任务场景下的适应性及其在实际空中应用中的潜在价值。', 'title_zh': '过驱动多旋翼飞行器的鲁棒控制全姿态跟踪'}
{'arxiv_id': 'arXiv:2506.16386', 'title': 'CSC-MPPI: A Novel Constrained MPPI Framework with DBSCAN for Reliable Obstacle Avoidance', 'authors': 'Leesai Park, Keunwoo Jang, Sanghyun Kim', 'link': 'https://arxiv.org/abs/2506.16386', 'abstract': 'This paper proposes Constrained Sampling Cluster Model Predictive Path Integral (CSC-MPPI), a novel constrained formulation of MPPI designed to enhance trajectory optimization while enforcing strict constraints on system states and control inputs. Traditional MPPI, which relies on a probabilistic sampling process, often struggles with constraint satisfaction and generates suboptimal trajectories due to the weighted averaging of sampled trajectories. To address these limitations, the proposed framework integrates a primal-dual gradient-based approach and Density-Based Spatial Clustering of Applications with Noise (DBSCAN) to steer sampled input trajectories into feasible regions while mitigating risks associated with weighted averaging. First, to ensure that sampled trajectories remain within the feasible region, the primal-dual gradient method is applied to iteratively shift sampled inputs while enforcing state and control constraints. Then, DBSCAN groups the sampled trajectories, enabling the selection of representative control inputs within each cluster. Finally, among the representative control inputs, the one with the lowest cost is chosen as the optimal action. As a result, CSC-MPPI guarantees constraint satisfaction, improves trajectory selection, and enhances robustness in complex environments. Simulation and real-world experiments demonstrate that CSC-MPPI outperforms traditional MPPI in obstacle avoidance, achieving improved reliability and efficiency. The experimental videos are available at this https URL', 'abstract_zh': '受限采样聚类模型预测路径积分（CSC-MPPI）：一种强化轨迹优化并严格约束系统状态和控制输入的新型方法', 'title_zh': 'CSC-MPPI：一种基于DBSCAN的新型约束MPPI框架以实现可靠的障碍 avoidance'}
{'arxiv_id': 'arXiv:2506.16356', 'title': 'Comparison between External and Internal Single Stage Planetary gearbox actuators for legged robots', 'authors': 'Aman Singh, Deepak Kapa, Prasham Chedda, Shishir N.Y. Kolathaya', 'link': 'https://arxiv.org/abs/2506.16356', 'abstract': 'Legged robots, such as quadrupeds and humanoids, require high-performance actuators for efficient locomotion. Quasi-Direct-Drive (QDD) actuators with single-stage planetary gearboxes offer low inertia, high efficiency, and transparency. Among planetary gearbox architectures, Internal (ISSPG) and External Single-Stage Planetary Gearbox (ESSPG) are the two predominant designs. While ISSPG is often preferred for its compactness and high torque density at certain gear ratios, no objective comparison between the two architectures exists. Additionally, existing designs rely on heuristics rather than systematic optimization. This paper presents a design framework for optimally selecting actuator parameters based on given performance requirements and motor specifications. Using this framework, we generate and analyze various optimized gearbox designs for both architectures. Our results demonstrate that for the T-motor U12, ISSPG is the superior choice within the lower gear ratio range of 5:1 to 7:1, offering a lighter design. However, for gear ratios exceeding 7:1, ISSPG becomes infeasible, making ESSPG the better option in the 7:1 to 11:1 range. To validate our approach, we designed and optimized two actuators for manufacturing: an ISSPG with a 6.0:1 gear ratio and an ESSPG with a 7.2:1 gear ratio. Their respective masses closely align with our optimization model predictions, confirming the effectiveness of our methodology.', 'abstract_zh': '基于给定性能要求和电机规格优化选择传动器参数的设计框架：内部单级行星齿轮箱与外部单级行星齿轮箱的对比分析', 'title_zh': '外部与内部单级行星齿轮减速器执行机构在腿式机器人中的对比'}
{'arxiv_id': 'arXiv:2506.16301', 'title': 'M-Predictive Spliner: Enabling Spatiotemporal Multi-Opponent Overtaking for Autonomous Racing', 'authors': 'Nadine Imholz, Maurice Brunner, Nicolas Baumann, Edoardo Ghignone, Michele Magno', 'link': 'https://arxiv.org/abs/2506.16301', 'abstract': "Unrestricted multi-agent racing presents a significant research challenge, requiring decision-making at the limits of a robot's operational capabilities. While previous approaches have either ignored spatiotemporal information in the decision-making process or been restricted to single-opponent scenarios, this work enables arbitrary multi-opponent head-to-head racing while considering the opponents' future intent. The proposed method employs a KF-based multi-opponent tracker to effectively perform opponent ReID by associating them across observations. Simultaneously, spatial and velocity GPR is performed on all observed opponent trajectories, providing predictive information to compute the overtaking maneuvers. This approach has been experimentally validated on a physical 1:10 scale autonomous racing car, achieving an overtaking success rate of up to 91.65% and demonstrating an average 10.13%-point improvement in safety at the same speed as the previous SotA. These results highlight its potential for high-performance autonomous racing.", 'abstract_zh': '不受限制的多agent竞速研究提出了一个重大的研究挑战，需要在机器人的操作极限范围内进行决策。虽然以前的方法要么在决策过程中忽略了时空信息，要么仅限于单对手场景，本工作则允许在考虑对手未来意图的情况下进行任意多对手一对一竞速。所提出的方法使用基于卡尔曼滤波的多对手跟踪器，通过跨观测关联对手来有效执行对手重识别。同时，对所有观测到的对手轨迹进行空间和速度广义回归分析，提供预测信息以计算超车动作。该方法已在物理1:10比例的自主竞速车上进行实验验证，超车成功率高达91.65%，并在相同速度下平均提高了10.13%的安全性。这些结果突显了其在高性能自主竞速中的潜力。', 'title_zh': 'M-预测型样条: 使能自主赛车时空多对手超越预测底盘'}
{'arxiv_id': 'arXiv:2506.16219', 'title': 'Probabilistic Collision Risk Estimation for Pedestrian Navigation', 'authors': 'Amine Tourki, Paul Prevel, Nils Einecke, Tim Puphal, Alexandre Alahi', 'link': 'https://arxiv.org/abs/2506.16219', 'abstract': "Intelligent devices for supporting persons with vision impairment are becoming more widespread, but they are lacking behind the advancements in intelligent driver assistant system. To make a first step forward, this work discusses the integration of the risk model technology, previously used in autonomous driving and advanced driver assistance systems, into an assistance device for persons with vision impairment. The risk model computes a probabilistic collision risk given object trajectories which has previously been shown to give better indications of an object's collision potential compared to distance or time-to-contact measures in vehicle scenarios. In this work, we show that the risk model is also superior in warning persons with vision impairment about dangerous objects. Our experiments demonstrate that the warning accuracy of the risk model is 67% while both distance and time-to-contact measures reach only 51% accuracy for real-world data.", 'abstract_zh': '智能视力障碍辅助设备正变得越来越普遍，但它们落后于智能驾驶辅助系统的进步。为了迈出第一步，本文讨论了将 previously 用于自动驾驶和先进驾驶辅助系统的风险模型技术整合到视力障碍人员的辅助设备中。风险模型计算基于物体轨迹的概率碰撞风险，研究表明在车辆场景中这种测量方法比距离或接触时间指标能更准确地指示物体的碰撞潜力。在这项工作中，我们展示了风险模型在警告视力障碍人员关于危险物体方面也更为优越。我们的实验表明，风险模型的警告准确率为67%，而距离和接触时间指标在实际数据中的准确率仅为51%。', 'title_zh': '行人导航中的概率碰撞风险估计'}
{'arxiv_id': 'arXiv:2506.16173', 'title': 'Single-Microphone-Based Sound Source Localization for Mobile Robots in Reverberant Environments', 'authors': 'Jiang Wang, Runwu Shi, Benjamin Yen, He Kong, Kazuhiro Nakadai', 'link': 'https://arxiv.org/abs/2506.16173', 'abstract': 'Accurately estimating sound source positions is crucial for robot audition. However, existing sound source localization methods typically rely on a microphone array with at least two spatially preconfigured microphones. This requirement hinders the applicability of microphone-based robot audition systems and technologies. To alleviate these challenges, we propose an online sound source localization method that uses a single microphone mounted on a mobile robot in reverberant environments. Specifically, we develop a lightweight neural network model with only 43k parameters to perform real-time distance estimation by extracting temporal information from reverberant signals. The estimated distances are then processed using an extended Kalman filter to achieve online sound source localization. To the best of our knowledge, this is the first work to achieve online sound source localization using a single microphone on a moving robot, a gap that we aim to fill in this work. Extensive experiments demonstrate the effectiveness and merits of our approach. To benefit the broader research community, we have open-sourced our code at this https URL.', 'abstract_zh': '准确估计声源位置对于机器人听觉至关重要。然而，现有的声源定位方法通常依赖于包含至少两个空间预配置麦克风的麦克风阵列。这一要求限制了基于麦克风的机器人听觉系统和技术的适用性。为了解决这些挑战，我们提出了一种在线声源定位方法，该方法在回声环境中使用安装在移动机器人上的单个麦克风进行声源定位。具体而言，我们开发了一个仅包含43K参数的轻量级神经网络模型，通过从回声信号中提取时域信息来实时估计距离。然后使用扩展的卡尔曼滤波器处理这些估计的距离，以实现在线声源定位。据我们所知，这是首次使用移动机器人上的单个麦克风实现在线声源定位的工作，我们希望填补这一空白。大量实验表明了我们方法的有效性和优点。为了惠及更广泛的科研界，我们在以下网址开源了我们的代码：this https URL。', 'title_zh': '基于单麦克风的移动机器人在混响环境中的声源定位'}
{'arxiv_id': 'arXiv:2506.16143', 'title': 'From Theory to Practice: Identifying the Optimal Approach for Offset Point Tracking in the Context of Agricultural Robotics', 'authors': 'Stephane Ngnepiepaye Wembe, Vincent Rousseau, Johann Laconte, Roland Lenain', 'link': 'https://arxiv.org/abs/2506.16143', 'abstract': "Modern agriculture faces escalating challenges: increasing demand for food, labor shortages, and the urgent need to reduce environmental impact. Agricultural robotics has emerged as a promising response to these pressures, enabling the automation of precise and suitable field operations. In particular, robots equipped with implements for tasks such as weeding or sowing must interact delicately and accurately with the crops and soil. Unlike robots in other domains, these agricultural platforms typically use rigidly mounted implements, where the implement's position is more critical than the robot's center in determining task success. Yet, most control strategies in the literature focus on the vehicle body, often neglecting the acctual working point of the system. This is particularly important when considering new agriculture practices where crops row are not necessary straights. This paper presents a predictive control strategy targeting the implement's reference point. The method improves tracking performance by anticipating the motion of the implement, which, due to its offset from the vehicle's center of rotation, is prone to overshooting during turns if not properly accounted for.", 'abstract_zh': '现代农业面临着 escalating 挑战：不断增长的食品需求、劳动力短缺以及迫切需要减少环境影响。农业机器人作为应对这些压力的前景广泛的方法之一，能够实现精确和适宜的田间操作自动化。特别是，用于除草或播种等任务的机器人必须与作物和土壤进行细致而准确的交互。与其它领域中的机器人不同，这些农业平台通常使用刚性安装的工具，工具的位置比机器人的中心更为关键，决定了任务的成功。然而，文献中的大多数控制策略侧重于车辆主体，往往忽视了系统的实际工作点。当考虑新的农业实践时，尤为重要的是作物行不一定必须是直线的。本文提出了一种针对工具参考点的预测控制策略，该方法通过预测工具的运动来提高跟踪性能，因为工具相对于车辆旋转中心的位置偏移，在转弯时如果没有适当考虑，容易导致过冲。', 'title_zh': '从理论到实践：在农业机器人背景下确定最优偏移点跟踪方法的研究'}
{'arxiv_id': 'arXiv:2506.15920', 'title': 'Learning from Planned Data to Improve Robotic Pick-and-Place Planning Efficiency', 'authors': 'Liang Qin, Weiwei Wan, Jun Takahashi, Ryo Negishi, Masaki Matsushita, Kensuke Harada', 'link': 'https://arxiv.org/abs/2506.15920', 'abstract': 'This work proposes a learning method to accelerate robotic pick-and-place planning by predicting shared grasps. Shared grasps are defined as grasp poses feasible to both the initial and goal object configurations in a pick-and-place task. Traditional analytical methods for solving shared grasps evaluate grasp candidates separately, leading to substantial computational overhead as the candidate set grows. To overcome the limitation, we introduce an Energy-Based Model (EBM) that predicts shared grasps by combining the energies of feasible grasps at both object poses. This formulation enables early identification of promising candidates and significantly reduces the search space. Experiments show that our method improves grasp selection performance, offers higher data efficiency, and generalizes well to unseen grasps and similarly shaped objects.', 'abstract_zh': '本研究提出了一种学习方法，通过预测共享握持方式来加速机器人取放规划。共享握持方式被定义为在取放任务中初始和目标对象配置都可行的握持姿态。传统分析方法求解共享握持方式时，分别评估每个握持候选方案，导致随着候选方案集的增加，计算开销显著增大。为克服这一限制，我们引入了一种能量模型（EBM），通过结合两种对象姿态下可行握持的能量来预测共享握持方式。该表述能在早期识别出有前景的候选方案，并显著缩小搜索空间。实验结果显示，本方法提高了握持选择性能，具有更高的数据效率，并能很好地泛化到未见过的握持方式和形状相似的物体。', 'title_zh': '基于计划数据的学习以提高机器人上下料规划效率'}
{'arxiv_id': 'arXiv:2506.15899', 'title': 'Advancing Autonomous Racing: A Comprehensive Survey of the RoboRacer (F1TENTH) Platform', 'authors': 'Israel Charles, Hossein Maghsoumi, Yaser Fallah', 'link': 'https://arxiv.org/abs/2506.15899', 'abstract': "The RoboRacer (F1TENTH) platform has emerged as a leading testbed for advancing autonomous driving research, offering a scalable, cost-effective, and community-driven environment for experimentation. This paper presents a comprehensive survey of the platform, analyzing its modular hardware and software architecture, diverse research applications, and role in autonomous systems education. We examine critical aspects such as bridging the simulation-to-reality (Sim2Real) gap, integration with simulation environments, and the availability of standardized datasets and benchmarks. Furthermore, the survey highlights advancements in perception, planning, and control algorithms, as well as insights from global competitions and collaborative research efforts. By consolidating these contributions, this study positions RoboRacer as a versatile framework for accelerating innovation and bridging the gap between theoretical research and real-world deployment. The findings underscore the platform's significance in driving forward developments in autonomous racing and robotics.", 'abstract_zh': 'RoboRacer (F1TENTH) 平台：一个促进自主驾驶研究的领先测试床，及其在自主系统教育中的作用综述', 'title_zh': '自动驾驶赛车进展：RoboRacer（F1TENTH）平台综述'}
{'arxiv_id': 'arXiv:2506.15870', 'title': 'A Small-Scale Robot for Autonomous Driving: Design, Challenges, and Best Practices', 'authors': 'Hossein Maghsoumi, Yaser Fallah', 'link': 'https://arxiv.org/abs/2506.15870', 'abstract': 'Small-scale autonomous vehicle platforms provide a cost-effective environment for developing and testing advanced driving systems. However, specific configurations within this scale are underrepresented, limiting full awareness of their potential. This paper focuses on a one-sixth-scale setup, offering a high-level overview of its design, hardware and software integration, and typical challenges encountered during development. We discuss methods for addressing mechanical and electronic issues common to this scale and propose guidelines for improving reliability and performance. By sharing these insights, we aim to expand the utility of small-scale vehicles for testing autonomous driving algorithms and to encourage further research in this domain.', 'abstract_zh': '小型自主车辆平台为高级驾驶系统的研究与测试提供了一种经济高效的环境。然而，该规模下的特定配置研究不足，限制了其潜在价值的全面认识。本文专注于六分之一规模的搭建，从设计、硬件与软件集成以及开发过程中遇到的典型挑战等方面进行高层次概述。我们讨论了针对该规模常见机械和电气问题的解决方法，并提出了提高可靠性和性能的建议。通过分享这些见解，我们旨在扩大小型车辆在测试自主驾驶算法方面的应用范围，并鼓励在该领域进行进一步研究。', 'title_zh': '小型自主驾驶机器人：设计、挑战及最佳实践'}
{'arxiv_id': 'arXiv:2506.15865', 'title': 'Improving Robotic Manipulation: Techniques for Object Pose Estimation, Accommodating Positional Uncertainty, and Disassembly Tasks from Examples', 'authors': 'Viral Rasik Galaiya', 'link': 'https://arxiv.org/abs/2506.15865', 'abstract': 'To use robots in more unstructured environments, we have to accommodate for more complexities. Robotic systems need more awareness of the environment to adapt to uncertainty and variability. Although cameras have been predominantly used in robotic tasks, the limitations that come with them, such as occlusion, visibility and breadth of information, have diverted some focus to tactile sensing. In this thesis, we explore the use of tactile sensing to determine the pose of the object using the temporal features. We then use reinforcement learning with tactile collisions to reduce the number of attempts required to grasp an object resulting from positional uncertainty from camera estimates. Finally, we use information provided by these tactile sensors to a reinforcement learning agent to determine the trajectory to take to remove an object from a restricted passage while reducing training time by pertaining from human examples.', 'abstract_zh': '为了在更多非结构化环境中使用机器人，我们需要应对更多的复杂性。机器人系统需要增加对环境的意识以适应不确定性与变化性。虽然相机在机器人任务中被广泛使用，但它们带来的遮挡、可见范围和信息广度的限制促使一些研究转向触觉感知。在本文中，我们探索使用触觉感知通过时间特征来确定物体的姿态。然后，我们利用基于触觉碰撞的强化学习来减少因相机估计位置不确定性而导致的抓取物体的尝试次数。最后，我们利用这些触觉传感器提供的信息来为强化学习代理确定轨迹，以从狭窄通道中移除物体，同时通过避免人类示例来减少训练时间。', 'title_zh': '改进机器人操作:基于例证的物体姿态估计、位置不确定性处理及拆解任务方法研究'}
{'arxiv_id': 'arXiv:2506.15788', 'title': 'Robust control for multi-legged elongate robots in noisy environments', 'authors': 'Baxi Chong, Juntao He, Daniel Irvine, Tianyu Wang, Esteban Flores, Daniel Soto, Jianfeng Lin, Zhaochen Xu, Vincent R Nienhusser, Grigoriy Blekherman, Daniel I. Goldman', 'link': 'https://arxiv.org/abs/2506.15788', 'abstract': 'Modern two and four legged robots exhibit impressive mobility on complex terrain, largely attributed to advancement in learning algorithms. However, these systems often rely on high-bandwidth sensing and onboard computation to perceive/respond to terrain uncertainties. Further, current locomotion strategies typically require extensive robot-specific training, limiting their generalizability across platforms. Building on our prior research connecting robot-environment interaction and communication theory, we develop a new paradigm to construct robust and simply controlled multi-legged elongate robots (MERs) capable of operating effectively in cluttered, unstructured environments. In this framework, each leg-ground contact is thought of as a basic active contact (bac), akin to bits in signal transmission. Reliable locomotion can be achieved in open-loop on "noisy" landscapes via sufficient redundancy in bacs. In such situations, robustness is achieved through passive mechanical responses. We term such processes as those displaying mechanical intelligence (MI) and analogize these processes to forward error correction (FEC) in signal transmission. To augment MI, we develop feedback control schemes, which we refer to as computational intelligence (CI) and such processes analogize automatic repeat request (ARQ) in signal transmission. Integration of these analogies between locomotion and communication theory allow analysis, design, and prediction of embodied intelligence control schemes (integrating MI and CI) in MERs, showing effective and reliable performance (approximately half body lengths per cycle) on complex landscapes with terrain "noise" over twice the robot\'s height. Our work provides a foundation for systematic development of MER control, paving the way for terrain-agnostic, agile, and resilient robotic systems capable of operating in extreme environments.', 'abstract_zh': '基于机械智能和计算智能的多足延展机器人在复杂地形上的稳健控制新范式', 'title_zh': '多腿长形机器人在噪声环境中的鲁棒控制'}
{'arxiv_id': 'arXiv:2506.16882', 'title': 'ROS 2 Agnocast: Supporting Unsized Message Types for True Zero-Copy Publish/Subscribe IPC', 'authors': 'Takahiro Ishikawa-Aso, Shinpei Kato', 'link': 'https://arxiv.org/abs/2506.16882', 'abstract': 'Robot applications, comprising independent components that mutually publish/subscribe messages, are built on inter-process communication (IPC) middleware such as Robot Operating System 2 (ROS 2). In large-scale ROS 2 systems like autonomous driving platforms, true zero-copy communication -- eliminating serialization and deserialization -- is crucial for efficiency and real-time performance. However, existing true zero-copy middleware solutions lack widespread adoption as they fail to meet three essential requirements: 1) Support for all ROS 2 message types including unsized ones; 2) Minimal modifications to existing application code; 3) Selective implementation of zero-copy communication between specific nodes while maintaining conventional communication mechanisms for other inter-node communications including inter-host node communications. This first requirement is critical, as production-grade ROS 2 projects like Autoware rely heavily on unsized message types throughout their codebase to handle diverse use cases (e.g., various sensors), and depend on the broader ROS 2 ecosystem, where unsized message types are pervasive in libraries. The remaining requirements facilitate seamless integration with existing projects. While IceOryx middleware, a practical true zero-copy solution, meets all but the first requirement, other studies achieving the first requirement fail to satisfy the remaining criteria. This paper presents Agnocast, a true zero-copy IPC framework applicable to ROS 2 C++ on Linux that fulfills all these requirements. Our evaluation demonstrates that Agnocast maintains constant IPC overhead regardless of message size, even for unsized message types. In Autoware PointCloud Preprocessing, Agnocast achieves a 16% improvement in average response time and a 25% improvement in worst-case response time.', 'abstract_zh': '基于ROS 2的真正零拷贝应用：Agnocast框架', 'title_zh': 'ROS 2 Agnocast: 支持无大小消息类型的真正零拷贝发布/订阅IPC'}
{'arxiv_id': 'arXiv:2506.16870', 'title': 'Vision-Based Multirotor Control for Spherical Target Tracking: A Bearing-Angle Approach', 'authors': 'Marcelo Jacinto, Rita Cunha', 'link': 'https://arxiv.org/abs/2506.16870', 'abstract': "This work addresses the problem of designing a visual servo controller for a multirotor vehicle, with the end goal of tracking a moving spherical target with unknown radius. To address this problem, we first transform two bearing measurements provided by a camera sensor into a bearing-angle pair. We then use this information to derive the system's dynamics in a new set of coordinates, where the angle measurement is used to quantify a relative distance to the target. Building on this system representation, we design an adaptive nonlinear control algorithm that takes advantage of the properties of the new system geometry and assumes that the target follows a constant acceleration model. Simulation results illustrate the performance of the proposed control algorithm.", 'abstract_zh': '本研究解决了设计多旋翼飞行器视觉伺服控制器的问题，目的是跟踪一个未知半径的移动球形目标。为此，我们首先将相机传感器提供的两个方位角测量值转换为一个方位角-角度对。然后，利用这一信息在新的坐标系中推导系统的动力学模型，其中的角度测量值用于量化相对于目标的距离。基于这种系统表示，我们设计了一种利用新系统几何特性且假定目标遵循恒定加速度模型的自适应非线性控制算法。仿真结果展示了所提出的控制算法的性能。', 'title_zh': '基于视觉的多旋翼飞行器球形目标追踪控制：一种方位角方法'}
{'arxiv_id': 'arXiv:2506.15958', 'title': 'Contactless Precision Steering of Particles in a Fluid inside a Cube with Rotating Walls', 'authors': 'Lucas Amoudruz, Petr Karnakov, Petros Koumoutsakos', 'link': 'https://arxiv.org/abs/2506.15958', 'abstract': 'Contactless manipulation of small objects is essential for biomedical and chemical applications, such as cell analysis, assisted fertilisation, and precision chemistry. Established methods, including optical, acoustic, and magnetic tweezers, are now complemented by flow control techniques that use flow-induced motion to enable precise and versatile manipulation. However, trapping multiple particles in fluid remains a challenge. This study introduces a novel control algorithm capable of steering multiple particles in flow. The system uses rotating disks to generate flow fields that transport particles to precise locations. Disk rotations are governed by a feedback control policy based on the Optimising a Discrete Loss (ODIL) framework, which combines fluid dynamics equations with path objectives into a single loss function. Our experiments, conducted in both simulations and with the physical device, demonstrate the capability of the approach to transport two beads simultaneously to predefined locations, advancing robust contactless particle manipulation for biomedical applications.', 'abstract_zh': '接触less操控小型物体对于生物医学和化学应用至关重要，如细胞分析、辅助受精和精密化学。已有方法，包括光学、声学和磁力镊子，现在被流动控制技术所补充，后者通过流动诱导的运动来实现精确和多功能的操控。然而，流体中捕获多个颗粒仍然是一项挑战。本研究介绍了一种新型控制算法，能够引导流动中的多个颗粒。该系统使用旋转盘生成流场，将颗粒输送到精确位置。盘的旋转由基于优化离散损失（ODIL）框架的反馈控制策略指导，该策略将流体力学方程与路径目标结合成单一的损失函数。我们在模拟和物理设备实验中演示了该方法同时将两个微珠运送到预定义位置的能力，从而推进了生物医学应用中稳健的接触less颗粒操控。', 'title_zh': '腔内旋转壁对流体中颗粒的无接触精确转向'}
{'arxiv_id': 'arXiv:2506.16546', 'title': 'BIDA: A Bi-level Interaction Decision-making Algorithm for Autonomous Vehicles in Dynamic Traffic Scenarios', 'authors': 'Liyang Yu, Tianyi Wang, Junfeng Jiao, Fengwu Shan, Hongqing Chu, Bingzhao Gao', 'link': 'https://arxiv.org/abs/2506.16546', 'abstract': 'In complex real-world traffic environments, autonomous vehicles (AVs) need to interact with other traffic participants while making real-time and safety-critical decisions accordingly. The unpredictability of human behaviors poses significant challenges, particularly in dynamic scenarios, such as multi-lane highways and unsignalized T-intersections. To address this gap, we design a bi-level interaction decision-making algorithm (BIDA) that integrates interactive Monte Carlo tree search (MCTS) with deep reinforcement learning (DRL), aiming to enhance interaction rationality, efficiency and safety of AVs in dynamic key traffic scenarios. Specifically, we adopt three types of DRL algorithms to construct a reliable value network and policy network, which guide the online deduction process of interactive MCTS by assisting in value update and node selection. Then, a dynamic trajectory planner and a trajectory tracking controller are designed and implemented in CARLA to ensure smooth execution of planned maneuvers. Experimental evaluations demonstrate that our BIDA not only enhances interactive deduction and reduces computational costs, but also outperforms other latest benchmarks, which exhibits superior safety, efficiency and interaction rationality under varying traffic conditions.', 'abstract_zh': '在复杂的现实交通环境中，自动驾驶车辆（AVs）需要在实时和安全性关键的决策中与其他交通参与者进行互动。人类行为的不可预测性在动态场景中，如多车道高速公路和无信号T型交叉口，提出了重大挑战。为了解决这个问题，我们设计了一种双层互动决策算法（BIDA），将互动蒙特卡洛树搜索（MCTS）与深度强化学习（DRL）相结合，旨在增强AVs在动态关键交通场景中的互动合理性、效率和安全性。具体来说，我们采用三种类型的DRL算法构建一个可靠的值网络和策略网络，通过协助价值更新和节点选择，引导互动MCTS的在线推断过程。然后，在CARLA中设计并实现了动态轨迹规划器和轨迹跟踪控制器，以确保计划机动的平滑执行。实验评估表明，我们的BIDA不仅提高了互动推断能力并降低了计算成本，而且在各种交通条件下的性能优于其他最新基准，展现出更优的安全性、效率和互动合理性。', 'title_zh': 'BIDA：动态交通场景中自主车辆多级交互决策算法'}
{'arxiv_id': 'arXiv:2506.15700', 'title': 'Contraction Actor-Critic: Contraction Metric-Guided Reinforcement Learning for Robust Path Tracking', 'authors': 'Minjae Cho, Hiroyasu Tsukamoto, Huy Trong Tran', 'link': 'https://arxiv.org/abs/2506.15700', 'abstract': 'Control contraction metrics (CCMs) provide a framework to co-synthesize a controller and a corresponding contraction metric -- a positive-definite Riemannian metric under which a closed-loop system is guaranteed to be incrementally exponentially stable. However, the synthesized controller only ensures that all the trajectories of the system converge to one single trajectory and, as such, does not impose any notion of optimality across an entire trajectory. Furthermore, constructing CCMs requires a known dynamics model and non-trivial effort in solving an infinite-dimensional convex feasibility problem, which limits its scalability to complex systems featuring high dimensionality with uncertainty. To address these issues, we propose to integrate CCMs into reinforcement learning (RL), where CCMs provide dynamics-informed feedback for learning control policies that minimize cumulative tracking error under unknown dynamics. We show that our algorithm, called contraction actor-critic (CAC), formally enhances the capability of CCMs to provide a set of contracting policies with the long-term optimality of RL in a fully automated setting. Given a pre-trained dynamics model, CAC simultaneously learns a contraction metric generator (CMG) -- which generates a contraction metric -- and uses an actor-critic algorithm to learn an optimal tracking policy guided by that metric. We demonstrate the effectiveness of our algorithm relative to established baselines through extensive empirical studies, including simulated and real-world robot experiments, and provide a theoretical rationale for incorporating contraction theory into RL.', 'abstract_zh': '基于收缩度量的控制收缩度量（CCMs）提供了一种框架，用于协同设计控制器和相应的收缩度量——在该收缩度量下，闭环系统可确保增量指数稳定。然而，合成的控制器仅确保系统的所有轨迹收敛到一条单一轨迹，因此不涵盖整个轨迹上的最优性概念。此外，构造CCMs需要已知的动力学模型，并且需要解决无限维凸可行问题，这限制了其在高维度和不确定性的复杂系统中的可扩展性。为解决这些问题，我们提出了将CCMs集成到强化学习（RL）中，在未知动力学的情况下，CCMs提供动力学指导的反馈，用于学习最小化累积跟踪误差的控制策略。我们证明，我们的算法，称为收缩演员-评论家（CAC），在自动化设置中正式扩展了CCMs的能力，能够提供一组收敛策略，并结合RL长期内的最优性。给定预训练的动力学模型，CAC同时学习一个收缩度量生成器（CMG）——生成收缩度量——并使用演员-评论家算法学习由该度量引导的最佳跟踪策略。我们通过广泛的实证研究，包括仿真和实际机器人实验，展示了该算法相对于现有基线的有效性，并为将收缩理论纳入RL提供了理论依据。', 'title_zh': '收缩actor-critic: 收缩度量引导的强化学习方法及其在稳健路径跟踪中的应用'}
