{'arxiv_id': 'arXiv:2503.10559', 'title': 'Towards Safe Path Tracking Using the Simplex Architecture', 'authors': 'Georg Jäger, Nils-Jonathan Friedrich, Hauke Petersen, Benjamin Noack', 'link': 'https://arxiv.org/abs/2503.10559', 'abstract': "Robot navigation in complex environments necessitates controllers that are adaptive and safe. Traditional controllers like Regulated Pure Pursuit, Dynamic Window Approach, and Model-Predictive Path Integral, while reliable, struggle to adapt to dynamic conditions. Reinforcement Learning offers adaptability but lacks formal safety guarantees. To address this, we propose a path tracking controller leveraging the Simplex architecture. It combines a Reinforcement Learning controller for adaptiveness and performance with a high-assurance controller providing safety and stability. Our contribution is twofold. We firstly discuss general stability and safety considerations for designing controllers using the Simplex architecture. Secondly, we present a Simplex-based path tracking controller. Our simulation results, supported by preliminary in-field tests, demonstrate the controller's effectiveness in maintaining safety while achieving comparable performance to state-of-the-art methods.", 'abstract_zh': '复杂环境中的机器人导航需要适应性和安全性兼具的控制器。传统控制器如 regulated pure pursuit、dynamic window approach 和 model-predictive path integral 可靠但难以适应动态条件。强化学习提供了适应性但缺乏形式上的安全性保证。为此，我们提出了一种基于简单xes架构的路径跟踪控制器。该控制器结合了强化学习控制器以实现适应性和性能，以及高保证控制器以提供安全性和稳定性。我们的贡献主要有两点。首先，讨论了使用简单xes架构设计控制器的一般稳定性和安全性考虑。其次，我们提出了一个基于简单xes架构的路径跟踪控制器。我们的仿真结果，结合初步的实地测试，证明了该控制器在保持安全性的同时，能够实现与先进方法相当的性能。', 'title_zh': '使用单纯形架构实现安全路径跟踪'}
{'arxiv_id': 'arXiv:2503.10349', 'title': 'Autonomous Robotic Radio Source Localization via a Novel Gaussian Mixture Filtering Approach', 'authors': 'Sukkeun Kim, Sangwoo Moon, Ivan Petrunin, Hyo-Sang Shin, Shehryar Khattak', 'link': 'https://arxiv.org/abs/2503.10349', 'abstract': 'This study proposes a new Gaussian Mixture Filter (GMF) to improve the estimation performance for the autonomous robotic radio signal source search and localization problem in unknown environments. The proposed filter is first tested with a benchmark numerical problem to validate the performance with other state-of-practice approaches such as Particle Gaussian Mixture (PGM) filters and Particle Filter (PF). Then the proposed approach is tested and compared against PF and PGM filters in real-world robotic field experiments to validate its impact for real-world robotic applications. The considered real-world scenarios have partial observability with the range-only measurement and uncertainty with the measurement model. The results show that the proposed filter can handle this partial observability effectively whilst showing improved performance compared to PF, reducing the computation requirements while demonstrating improved robustness over compared techniques.', 'abstract_zh': '本研究提出了一种新的高斯混合滤波器（GMF），以提高在未知环境中自主机器人对无线电信号源的搜索与定位问题的估计性能。所提出的滤波器首先使用基准数值问题进行测试，以验证其性能，与其他现有的方法如粒子高斯混合滤波器（PGM）和粒子滤波器（PF）进行对比。然后，在实际的机器人场实验中测试并对比所提出的方法与PF和PGM滤波器，以验证其对实际机器人应用的影响。考虑的实际应用场景具有部分可观测性及测量模型中的不确定性。结果表明，所提出的滤波器能够有效地处理这种部分可观测性，相较于PF展现出更好的性能，同时降低了计算需求并展示了比对比技术更好的鲁棒性。', 'title_zh': '基于新型高斯混合滤波方法的自主机器人射电源定位'}
{'arxiv_id': 'arXiv:2503.10334', 'title': 'Enhanced View Planning for Robotic Harvesting: Tackling Occlusions with Imitation Learning', 'authors': 'Lun Li, Hamidreza Kasaei', 'link': 'https://arxiv.org/abs/2503.10334', 'abstract': 'In agricultural automation, inherent occlusion presents a major challenge for robotic harvesting. We propose a novel imitation learning-based viewpoint planning approach to actively adjust camera viewpoint and capture unobstructed images of the target crop. Traditional viewpoint planners and existing learning-based methods, depend on manually designed evaluation metrics or reward functions, often struggle to generalize to complex, unseen scenarios. Our method employs the Action Chunking with Transformer (ACT) algorithm to learn effective camera motion policies from expert demonstrations. This enables continuous six-degree-of-freedom (6-DoF) viewpoint adjustments that are smoother, more precise and reveal occluded targets. Extensive experiments in both simulated and real-world environments, featuring agricultural scenarios and a 6-DoF robot arm equipped with an RGB-D camera, demonstrate our method\'s superior success rate and efficiency, especially in complex occlusion conditions, as well as its ability to generalize across different crops without reprogramming. This study advances robotic harvesting by providing a practical "learn from demonstration" (LfD) solution to occlusion challenges, ultimately enhancing autonomous harvesting performance and productivity.', 'abstract_zh': '农业自动化中，固有的遮挡是机器人采摘面临的主要挑战。我们提出了一种新颖的模仿学习导向的观点规划方法，以主动调整相机视角并捕获目标作物的无遮挡图像。传统的观点规划方法和现有的基于学习的方法通常依赖于人工设计的评估指标或奖励函数，难以在复杂、未见过的场景中泛化。我们的方法使用Action Chunking with Transformer (ACT) 算法从专家演示中学习有效的相机运动策略，从而实现连续的六自由度（6-DoF）视角调整，这些调整更加平滑、精确并能揭示被遮挡的目标。在含农业场景和配备RGB-D相机的6-DoF机械臂的仿真和实际环境中的广泛实验表明，我们的方法具有更高的成功率和效率，尤其是在复杂遮挡条件下，并且能够跨不同作物泛化而无需重新编程。本研究通过提供一种实用的“示教即学”（LfD）解决方案来应对遮挡挑战，从而增强自主收获性能和生产率。', 'title_zh': '增强视图规划以应对遮挡的机器人收获：基于模仿学习的方法'}
{'arxiv_id': 'arXiv:2503.10141', 'title': 'Mapless Collision-Free Flight via MPC using Dual KD-Trees in Cluttered Environments', 'authors': 'Linzuo Zhang, Yu Hu, Yang Deng, Feng Yu, Danping Zou', 'link': 'https://arxiv.org/abs/2503.10141', 'abstract': 'Collision-free flight in cluttered environments is a critical capability for autonomous quadrotors. Traditional methods often rely on detailed 3D map construction, trajectory generation, and tracking. However, this cascade pipeline can introduce accumulated errors and computational delays, limiting flight agility and safety. In this paper, we propose a novel method for enabling collision-free flight in cluttered environments without explicitly constructing 3D maps or generating and tracking collision-free trajectories. Instead, we leverage Model Predictive Control (MPC) to directly produce safe actions from sparse waypoints and point clouds from a depth camera. These sparse waypoints are dynamically adjusted online based on nearby obstacles detected from point clouds. To achieve this, we introduce a dual KD-Tree mechanism: the Obstacle KD-Tree quickly identifies the nearest obstacle for avoidance, while the Edge KD-Tree provides a robust initial guess for the MPC solver, preventing it from getting stuck in local minima during obstacle avoidance. We validate our approach through extensive simulations and real-world experiments. The results show that our approach significantly outperforms the mapping-based methods and is also superior to imitation learning-based methods, demonstrating reliable obstacle avoidance at up to 12 m/s in simulations and 6 m/s in real-world tests. Our method provides a simple and robust alternative to existing methods.', 'abstract_zh': '无碰撞飞行在复杂环境中的能力对于自主四旋翼无人机至关重要。传统方法通常依赖于详细的3D地图构建、 trajectory生成和跟踪。然而，这种流水线方法会引入累积误差和计算延迟，限制了飞行的敏捷性和安全性。在本文中，我们提出了一种新型方法，无需显式构建3D地图或生成和跟踪无碰撞轨迹即可实现复杂环境中的无碰撞飞行。相反，我们利用模型预测控制（MPC）直接从稀疏航点和深度相机的点云中产生安全动作。这些稀疏航点会根据从点云检测到的附近障碍物在线动态调整。为此，我们引入了一种双KD-树机制：障碍KD-树快速识别用于避免的最近障碍物，而边缘KD-树为MPC解算器提供稳健的初始猜测，防止其在避障过程中陷入局部极小值。我们通过广泛的仿真和实地实验验证了我们的方法。结果显示，与基于建图的方法相比，我们的方法性能显著提高，并且优于基于模仿学习的方法，在仿真中可达12 m/s，在实地测试中可达6 m/s。我们的方法为现有方法提供了一种简单而 robust 的替代方案。', 'title_zh': '基于双KD树的无碰撞飞行MPG方法在复杂环境中的应用'}
{'arxiv_id': 'arXiv:2503.10028', 'title': 'LEVA: A high-mobility logistic vehicle with legged suspension', 'authors': 'Marco Arnold, Lukas Hildebrandt, Kaspar Janssen, Efe Ongan, Pascal Bürge, Ádám Gyula Gábriel, James Kennedy, Rishi Lolla, Quanisha Oppliger, Micha Schaaf, Joseph Church, Michael Fritsche, Victor Klemm, Turcan Tuna, Giorgio Valsecchi, Cedric Weibel, Marco Hutter', 'link': 'https://arxiv.org/abs/2503.10028', 'abstract': 'The autonomous transportation of materials over challenging terrain is a challenge with major economic implications and remains unsolved. This paper introduces LEVA, a high-payload, high-mobility robot designed for autonomous logistics across varied terrains, including those typical in agriculture, construction, and search and rescue operations. LEVA uniquely integrates an advanced legged suspension system using parallel kinematics. It is capable of traversing stairs using a rl controller, has steerable wheels, and includes a specialized box pickup mechanism that enables autonomous payload loading as well as precise and reliable cargo transportation of up to 85 kg across uneven surfaces, steps and inclines while maintaining a cot of as low as 0.15. Through extensive experimental validation, LEVA demonstrates its off-road capabilities and reliability regarding payload loading and transport.', 'abstract_zh': '具有高承载能力和高机动性的自主地形物流机器人LEVA', 'title_zh': 'LEVA：一种具有腿式悬挂的高移动性物流车辆'}
{'arxiv_id': 'arXiv:2503.09628', 'title': 'Optimizing AUV speed dynamics with a data-driven Koopman operator approach', 'authors': 'Zhiliang Liu, Xin Zhao, Peng Cai, Bing Cong', 'link': 'https://arxiv.org/abs/2503.09628', 'abstract': "Autonomous Underwater Vehicles (AUVs) play an essential role in modern ocean exploration, and their speed control systems are fundamental\nto their efficient operation. Like many other robotic systems, AUVs exhibit multivariable nonlinear dynamics and face various constraints,\nincluding state limitations, input constraints, and constraints on the increment input, making controller design challenging\nand requiring significant effort and time. This paper addresses these challenges by employing a data-driven Koopman operator theory combined\nwith Model Predictive Control (MPC), which takes into account the aforementioned constraints. The proposed approach not only ensures\nthe performance of the AUV under state and input limitations but also considers the variation in incremental input to prevent\nrapid and potentially damaging changes to the vehicle's operation. Additionally, we develop a platform based on ROS2 and Gazebo\nto validate the effectiveness of the proposed algorithms, providing new control strategies for underwater vehicles against the complex and dynamic nature of underwater environments.", 'abstract_zh': '自主水下车辆（AUVs）在现代海洋探索中发挥着重要作用，其速度控制系统对其高效运行至关重要。像许多其他机器人系统一样，AUVs表现出多变量非线性动态特性，并面临状态限制、输入约束以及增量输入约束等问题，使得控制器设计极具挑战性。本文通过结合数据驱动的Koopman算子理论和模型预测控制（MPC），同时考虑上述约束，来应对这些挑战。所提出的方法不仅确保了在状态和输入限制下的AUV性能，还考虑了增量输入的变化以防止车辆操作发生快速且可能有害的变化。此外，我们基于ROS2和Gazebo开发了一个平台，以验证所提算法的有效性，提供了针对复杂多变的水下环境的新控制策略。', 'title_zh': '基于数据驱动的科帕曼算子方法优化自治水下车辆速度动态'}
{'arxiv_id': 'arXiv:2503.09622', 'title': 'Dynamics-Invariant Quadrotor Control using Scale-Aware Deep Reinforcement Learning', 'authors': 'Varad Vaidya, Jishnu Keshavan', 'link': 'https://arxiv.org/abs/2503.09622', 'abstract': "Due to dynamic variations such as changing payload, aerodynamic disturbances, and varying platforms, a robust solution for quadrotor trajectory tracking remains challenging. To address these challenges, we present a deep reinforcement learning (DRL) framework that achieves physical dynamics invariance by directly optimizing force/torque inputs, eliminating the need for traditional intermediate control layers. Our architecture integrates a temporal trajectory encoder, which processes finite-horizon reference positions/velocities, with a latent dynamics encoder trained on historical state-action pairs to model platform-specific characteristics. Additionally, we introduce scale-aware dynamics randomization parameterized by the quadrotor's arm length, enabling our approach to maintain stability across drones spanning from 30g to 2.1kg and outperform other DRL baselines by 85% in tracking accuracy. Extensive real-world validation of our approach on the Crazyflie 2.1 quadrotor, encompassing over 200 flights, demonstrates robust adaptation to wind, ground effects, and swinging payloads while achieving less than 0.05m RMSE at speeds up to 2.0 m/s. This work introduces a universal quadrotor control paradigm that compensates for dynamic discrepancies across varied conditions and scales, paving the way for more resilient aerial systems.", 'abstract_zh': '基于深度强化学习的四旋翼轨迹跟踪稳健解决方案', 'title_zh': '使用尺度感知深度强化学习的动态不变四旋翼控制'}
