{'arxiv_id': 'arXiv:2509.20333', 'title': 'BBoE: Leveraging Bundle of Edges for Kinodynamic Bidirectional Motion Planning', 'authors': 'Srikrishna Bangalore Raghu, Alessandro Roncone', 'link': 'https://arxiv.org/abs/2509.20333', 'abstract': 'In this work, we introduce BBoE, a bidirectional, kinodynamic, sampling-based motion planner that consistently and quickly finds low-cost solutions in environments with varying obstacle clutter. The algorithm combines exploration and exploitation while relying on precomputed robot state traversals, resulting in efficient convergence towards the goal. Our key contributions include: i) a strategy to navigate through obstacle-rich spaces by sorting and sequencing preprocessed forward propagations; and ii) BBoE, a robust bidirectional kinodynamic planner that utilizes this strategy to produce fast and feasible solutions. The proposed framework reduces planning time, diminishes solution cost and increases success rate in comparison to previous approaches.', 'abstract_zh': '本工作中，我们引入了BBoE，这是一种双向、动力学采样的运动规划器，能够在不同障碍物密度的环境中一致且迅速地找到低成本解。该算法结合了探索和利用，并依赖预计算的机器人状态遍历，从而高效地向目标收敛。我们的主要贡献包括：i) 一种通过排序和序列化预处理的前向传播策略来导航密集障碍物空间的方法；ii) BBoE，一种鲁棒的双向动力学规划器，利用此策略生成快速且可行的解决方案。所提出框架减少了规划时间，降低了解的成本，并提高了成功率，相较于先前的方法。', 'title_zh': 'BBoE：利用边缘束进行动力学双向运动规划'}
{'arxiv_id': 'arXiv:2509.20229', 'title': 'Techno-Economic analysis for Smart Hangar inspection operations through Sensing and Localisation at scale', 'authors': 'Angelos Plastropoulos, Nicolas P. Avdelidis, Argyrios Zolotas', 'link': 'https://arxiv.org/abs/2509.20229', 'abstract': 'The accuracy, resilience, and affordability of localisation are fundamental to autonomous robotic inspection within aircraft maintenance and overhaul (MRO) hangars. Hangars typically feature tall ceilings and are often made of materials such as metal. Due to its nature, it is considered a GPS-denied environment, with extensive multipath effects and stringent operational constraints that collectively create a uniquely challenging environment. This persistent gap highlights the need for domain-specific comparative studies, including rigorous cost, accuracy, and integration assessments, to inform a reliable and scalable deployment of a localisation system in the Smart Hangar. This paper presents the first techno-economic roadmap that benchmarks motion capture (MoCap), ultra-wideband (UWB), and a ceiling-mounted camera network across three operational scenarios: robot localisation, asset tracking, and surface defect detection within a 40x50 m hangar bay. A dual-layer optimisation for camera selection and positioning framework is introduced, which couples market-based camera-lens selection with an optimisation solver, producing camera layouts that minimise hardware while meeting accuracy targets. The roadmap equips MRO planners with an actionable method to balance accuracy, coverage, and budget, demonstrating that an optimised vision architecture has the potential to unlock robust and cost-effective sensing for next-generation Smart Hangars.', 'abstract_zh': '本地化精度、韧性和经济性对于航空维修与大修（MRO）机库中的自主机器人检查至关重要。机库通常具有高顶棚，且多由金属等材料构成。由于其特性，被认为是一个GPS受限的环境，存在广泛的多路径效应和严格的操作约束，这共同构成了独特而复杂的环境。这一持续存在的差距强调了需要进行特定领域的比较研究，包括严格的成本、精度和集成评估，以指导智能机库中本地化系统的可靠和可扩展部署。本文提出了第一个技术经济路线图，该路线图基于运动捕捉（MoCap）、超宽带（UWB）和天花板安装摄像头网络，在40x50米的机库空间内评估三种操作场景：机器人本地化、资产跟踪和表面缺陷检测。引入了一种双层优化框架来进行摄像头选择和定位，该框架结合市场驱动的摄像头-镜头选择与优化求解器，生成满足精度目标的同时最小化硬件的摄像头布局。该路线图为MRO规划者提供了实用的方法来平衡精度、覆盖范围和预算，证明了优化的视觉架构有潜力解锁智能机库中稳健且低成本的感知。', 'title_zh': '智能机库检测操作通过大规模传感与定位的 techno-economics 分析'}
{'arxiv_id': 'arXiv:2509.20093', 'title': 'Hybrid Safety Verification of Multi-Agent Systems using $ψ$-Weighted CBFs and PAC Guarantees', 'authors': 'Venkat Margapuri, Garik Kazanjian, Naren Kosaraju', 'link': 'https://arxiv.org/abs/2509.20093', 'abstract': 'This study proposes a hybrid safety verification framework for closed-loop multi-agent systems under bounded stochastic disturbances. The proposed approach augments control barrier functions with a novel $\\psi$-weighted formulation that encodes directional control alignment between agents into the safety constraints. Deterministic admissibility is combined with empirical validation via Monte Carlo rollouts, and a PAC-style guarantee is derived based on margin-aware safety violations to provide a probabilistic safety certificate. The results from the experiments conducted under different bounded stochastic disturbances validate the feasibility of the proposed approach.', 'abstract_zh': '本文提出了一种混合安全验证框架，用于受有界随机干扰影响的闭环多agent系统。提出的观点通过一种新颖的$\\psi$加权公式将agent间的方向控制对齐编码到安全约束中，增强了控制障碍函数。确定性可接纳性与基于蒙特卡洛展开的实验验证相结合，并基于感知差错的安全违规推导出PAC风格的保证，以提供一种概率安全证明。在不同有界随机干扰下的实验结果验证了所提出方法的可行性。', 'title_zh': '基于ψ加权CBF和PAC保证的多智能体系统混合安全性验证'}
{'arxiv_id': 'arXiv:2509.20084', 'title': 'C-3TO: Continuous 3D Trajectory Optimization on Neural Euclidean Signed Distance Fields', 'authors': 'Guillermo Gil, Jose Antonio Cobano, Luis Merino, Fernando Caballero', 'link': 'https://arxiv.org/abs/2509.20084', 'abstract': "This paper introduces a novel framework for continuous 3D trajectory optimization in cluttered environments, leveraging online neural Euclidean Signed Distance Fields (ESDFs). Unlike prior approaches that rely on discretized ESDF grids with interpolation, our method directly optimizes smooth trajectories represented by fifth-order polynomials over a continuous neural ESDF, ensuring precise gradient information throughout the entire trajectory. The framework integrates a two-stage nonlinear optimization pipeline that balances efficiency, safety and smoothness. Experimental results demonstrate that C-3TO produces collision-aware and dynamically feasible trajectories. Moreover, its flexibility in defining local window sizes and optimization parameters enables straightforward adaptation to diverse user's needs without compromising performance. By combining continuous trajectory parameterization with a continuously updated neural ESDF, C-3TO establishes a robust and generalizable foundation for safe and efficient local replanning in aerial robotics.", 'abstract_zh': '本文提出了一种新颖的框架，用于利用在线神经欧几里得-signed距离场(ESDF)在复杂环境中进行连续三维轨迹优化。该方法直接优化由五次多项式表示的平滑轨迹，而非依赖于离散化的ESDF网格和插值，确保在整个轨迹中都具有精确的梯度信息。该框架集成了一个兼顾效率、安全性和平滑性的两阶段非线性优化管道。实验结果表明，C-3TO能够生成碰撞感知和动态可行的轨迹。此外，通过灵活定义局部窗口大小和优化参数，C-3TO能轻松适应多样化用户需求而不牺牲性能。通过结合连续轨迹参数化和不断更新的神经ESDF，C-3TO为航空机器人中的安全高效局部重规划提供了稳健且通用的基础。', 'title_zh': 'C-3TO：神经欧几里得符号距离场上的连续3D轨迹优化'}
{'arxiv_id': 'arXiv:2509.19597', 'title': 'From Space to Time: Enabling Adaptive Safety with Learned Value Functions via Disturbance Recasting', 'authors': 'Sander Tonkens, Nikhil Uday Shinde, Azra Begzadić, Michael C. Yip, Jorge Cortés, Sylvia L. Herbert', 'link': 'https://arxiv.org/abs/2509.19597', 'abstract': 'The widespread deployment of autonomous systems in safety-critical environments such as urban air mobility hinges on ensuring reliable, performant, and safe operation under varying environmental conditions. One such approach, value function-based safety filters, minimally modifies a nominal controller to ensure safety. Recent advances leverage offline learned value functions to scale these safety filters to high-dimensional systems. However, these methods assume detailed priors on all possible sources of model mismatch, in the form of disturbances in the environment -- information that is rarely available in real world settings. Even in well-mapped environments like urban canyons or industrial sites, drones encounter complex, spatially-varying disturbances arising from payload-drone interaction, turbulent airflow, and other environmental factors. We introduce SPACE2TIME, which enables safe and adaptive deployment of offline-learned safety filters under unknown, spatially-varying disturbances. The key idea is to reparameterize spatial variations in disturbance as temporal variations, enabling the use of precomputed value functions during online operation. We validate SPACE2TIME on a quadcopter through extensive simulations and hardware experiments, demonstrating significant improvement over baselines.', 'abstract_zh': '基于值函数的安全滤波器在不同空间变化干扰下的安全自适应部署', 'title_zh': '从空间到时间：通过干扰重铸实现基于学习价值函数的自适应安全'}
{'arxiv_id': 'arXiv:2509.19463', 'title': 'CU-Multi: A Dataset for Multi-Robot Collaborative Perception', 'authors': 'Doncey Albin, Daniel McGann, Miles Mena, Annika Thomas, Harel Biggie, Xuefei Sun, Steve McGuire, Jonathan P. How, Christoffer Heckman', 'link': 'https://arxiv.org/abs/2509.19463', 'abstract': 'A central challenge for multi-robot systems is fusing independently gathered perception data into a unified representation. Despite progress in Collaborative SLAM (C-SLAM), benchmarking remains hindered by the scarcity of dedicated multi-robot datasets. Many evaluations instead partition single-robot trajectories, a practice that may only partially reflect true multi-robot operations and, more critically, lacks standardization, leading to results that are difficult to interpret or compare across studies. While several multi-robot datasets have recently been introduced, they mostly contain short trajectories with limited inter-robot overlap and sparse intra-robot loop closures. To overcome these limitations, we introduce CU-Multi, a dataset collected over multiple days at two large outdoor sites on the University of Colorado Boulder campus. CU-Multi comprises four synchronized runs with aligned start times and controlled trajectory overlap, replicating the distinct perspectives of a robot team. It includes RGB-D sensing, RTK GPS, semantic LiDAR, and refined ground-truth odometry. By combining overlap variation with dense semantic annotations, CU-Multi provides a strong foundation for reproducible evaluation in multi-robot collaborative perception tasks.', 'abstract_zh': '多机器人系统的一个关键挑战是将独立收集的感知数据融合为统一表示。尽管在协作SLAM（C-SLAM）方面取得了进展，但由于专用多机器人数据集的稀缺性，基准测试仍然受到阻碍。许多评估将单机器人轨迹分割，这种做法可能仅部分反映真正的多机器人操作，并且更关键的是缺乏标准化，导致结果难以在研究之间进行解释或比较。虽然最近引入了多个多机器人数据集，但它们主要包含有限的跨机器人重叠和稀疏的内部机器人回环闭合轨迹。为克服这些限制，我们引入了CU-Multi数据集，该数据集在科罗拉多大学 Boulder 校园的两个大型户外地点上收集自多日的数据。CU-Multi 包含四次同步运行，具有对齐的起始时间并控制轨迹重叠，复制了机器人团队的不同视角。它包括RGB-D传感、RTK GPS、语义LiDAR以及校准的地面真相里程计。通过结合重叠变化和密集的语义注释，CU-Multi 为多机器人协作感知任务的再现性评估提供了坚实的基础。', 'title_zh': 'CU-Multi: 一种多机器人协作感知数据集'}
{'arxiv_id': 'arXiv:2509.20314', 'title': 'On Robustness of Consensus over Pseudo-Undirected Path Graphs', 'authors': 'Abhinav Sinha, Dwaipayan Mukherjee, Shashi Ranjan Kumar', 'link': 'https://arxiv.org/abs/2509.20314', 'abstract': 'Consensus over networked agents is typically studied using undirected or directed communication graphs. Undirected graphs enforce symmetry in information exchange, leading to convergence to the average of initial states, while directed graphs permit asymmetry but make consensus dependent on root nodes and their influence. Both paradigms impose inherent restrictions on achievable consensus values and network robustness. This paper introduces a theoretical framework for achieving consensus over a class of network topologies, termed pseudo-undirected graphs, which retains bidirectional connectivity between node pairs but allows the corresponding edge weights to differ, including the possibility of negative values under bounded conditions. The resulting Laplacian is generally non-symmetric, yet it guarantees consensus under connectivity assumptions, to expand the solution space, which enables the system to achieve a stable consensus value that can lie outside the convex hull of the initial state set. We derive admissibility bounds for negative weights for a pseudo-undirected path graph, and show an application in the simultaneous interception of a moving target.', 'abstract_zh': '基于伪无向图的网络代理共识研究', 'title_zh': '伪无向路径图上一致性算法的健壮性研究'}
{'arxiv_id': 'arXiv:2509.19789', 'title': 'RDAR: Reward-Driven Agent Relevance Estimation for Autonomous Driving', 'authors': 'Carlo Bosio, Greg Woelki, Noureldin Hendy, Nicholas Roy, Byungsoo Kim', 'link': 'https://arxiv.org/abs/2509.19789', 'abstract': 'Human drivers focus only on a handful of agents at any one time. On the other hand, autonomous driving systems process complex scenes with numerous agents, regardless of whether they are pedestrians on a crosswalk or vehicles parked on the side of the road. While attention mechanisms offer an implicit way to reduce the input to the elements that affect decisions, existing attention mechanisms for capturing agent interactions are quadratic, and generally computationally expensive. We propose RDAR, a strategy to learn per-agent relevance -- how much each agent influences the behavior of the controlled vehicle -- by identifying which agents can be excluded from the input to a pre-trained behavior model. We formulate the masking procedure as a Markov Decision Process where the action consists of a binary mask indicating agent selection. We evaluate RDAR on a large-scale driving dataset, and demonstrate its ability to learn an accurate numerical measure of relevance by achieving comparable driving performance, in terms of overall progress, safety and performance, while processing significantly fewer agents compared to a state of the art behavior model.', 'abstract_zh': '基于代理相关性的自主驾驶注意力机制：RDAR策略', 'title_zh': 'RDAR：基于奖励驱动的代理相关性估计在自主驾驶中的应用'}
{'arxiv_id': 'arXiv:2509.19379', 'title': 'Learning from Observation: A Survey of Recent Advances', 'authors': 'Returaj Burnwal, Hriday Mehta, Nirav Pravinbhai Bhatt, Balaraman Ravindran', 'link': 'https://arxiv.org/abs/2509.19379', 'abstract': "Imitation Learning (IL) algorithms offer an efficient way to train an agent by mimicking an expert's behavior without requiring a reward function. IL algorithms often necessitate access to state and action information from expert demonstrations. Although expert actions can provide detailed guidance, requiring such action information may prove impractical for real-world applications where expert actions are difficult to obtain. To address this limitation, the concept of learning from observation (LfO) or state-only imitation learning (SOIL) has recently gained attention, wherein the imitator only has access to expert state visitation information. In this paper, we present a framework for LfO and use it to survey and classify existing LfO methods in terms of their trajectory construction, assumptions and algorithm's design choices. This survey also draws connections between several related fields like offline RL, model-based RL and hierarchical RL. Finally, we use our framework to identify open problems and suggest future research directions.", 'abstract_zh': '学习从观察（LfO）算法：一种无需专家行为信息的有效模仿学习框架', 'title_zh': '基于观察学习：近期进展综述'}
{'arxiv_id': 'arXiv:2509.19318', 'title': 'Scensory: Automated Real-Time Fungal Identification and Spatial Mapping', 'authors': 'Yanbaihui Liu, Erica Babusci, Claudia K. Gunsch, Boyuan Chen', 'link': 'https://arxiv.org/abs/2509.19318', 'abstract': 'Indoor fungal contamination poses significant risks to public health, yet existing detection methods are slow, costly, and lack spatial resolution. Conventional approaches rely on laboratory analysis or high-concentration sampling, making them unsuitable for real-time monitoring and scalable deployment. We introduce \\textbf{\\textit{Scensory}}, a robot-enabled olfactory system that simultaneously identifies fungal species and localizes their spatial origin using affordable volatile organic compound (VOC) sensor arrays and deep learning. Our key idea is that temporal VOC dynamics encode both chemical and spatial signatures, which we decode through neural architectures trained on robot-automated data collection. We demonstrate two operational modes: a passive multi-array configuration for environmental monitoring, and a mobile single-array configuration for active source tracking. Across five fungal species, our system achieves up to 89.85\\% accuracy in species detection and 87.31\\% accuracy in localization under ambient conditions, where each prediction only takes 3--7\\,s sensor inputs. Additionally, by computationally analyzing model behavior, we can uncover key biochemical signatures without additional laboratory experiments. Our approach enables real-time, spatially aware fungal monitoring and establishes a scalable and affordable framework for autonomous environmental sensing.', 'abstract_zh': '室内真菌污染对公共健康构成显著风险，现有检测方法速度缓慢、成本高昂且缺乏空间分辨率。传统的做法依赖于实验室分析或高浓度采样，使得实时监测和规模化部署不具备可行性。我们介绍了\\textbf{\\textit{Scensory}}——一种基于机器人嗅觉系统的解决方案，该系统利用经济实惠的挥发性有机化合物(VOC)传感器阵列和深度学习同时识别真菌种类并定位其空间来源。我们提出的核心思想是时间上的VOC动态编码了化学和空间特征，通过基于机器人自动化数据收集训练的神经架构进行解码。我们展示了两种操作模式：一种是用于环境监测的被动多阵列配置，另一种是用于主动源头追踪的便携式单阵列配置。在五种真菌物种中，我们的系统在环境条件下实现高达89.85%的种类检测准确率和87.31%的定位准确率，每项预测仅需3-7秒的传感器输入。此外，通过计算分析模型行为，我们可以在不进行额外实验室实验的情况下揭示关键的生物化学特征。我们的方法实现了实时、空间感知的真菌监测，并建立了一个可扩展且经济实惠的自主环境感知框架。', 'title_zh': 'Scensory: 自动实时真菌识别与空间映射'}
{'arxiv_id': 'arXiv:2509.20175', 'title': 'Federation of Agents: A Semantics-Aware Communication Fabric for Large-Scale Agentic AI', 'authors': 'Lorenzo Giusti, Ole Anton Werner, Riccardo Taiello, Matilde Carvalho Costa, Emre Tosun, Andrea Protani, Marc Molina, Rodrigo Lopes de Almeida, Paolo Cacace, Diogo Reis Santos, Luigi Serio', 'link': 'https://arxiv.org/abs/2509.20175', 'abstract': 'We present Federation of Agents (FoA), a distributed orchestration framework that transforms static multi-agent coordination into dynamic, capability-driven collaboration. FoA introduces Versioned Capability Vectors (VCVs): machine-readable profiles that make agent capabilities searchable through semantic embeddings, enabling agents to advertise their capabilities, cost, and limitations. Our aarchitecturecombines three key innovations: (1) semantic routing that matches tasks to agents over sharded HNSW indices while enforcing operational constraints through cost-biased optimization, (2) dynamic task decomposition where compatible agents collaboratively break down complex tasks into DAGs of subtasks through consensus-based merging, and (3) smart clustering that groups agents working on similar subtasks into collaborative channels for k-round refinement before synthesis. Built on top of MQTT,s publish-subscribe semantics for scalable message passing, FoA achieves sub-linear complexity through hierarchical capability matching and efficient index maintenance. Evaluation on HealthBench shows 13x improvements over single-model baselines, with clustering-enhanced laboration particularly effective for complex reasoning tasks requiring multiple perspectives. The system scales horizontally while maintaining consistent performance, demonstrating that semantic orchestration with structured collaboration can unlock the collective intelligence of heterogeneous federations of AI agents.', 'abstract_zh': '联邦代理体框架：动态、能力驱动的合作', 'title_zh': '代理联邦：一种面向大规模代理型AI的意义感知通信架构'}
{'arxiv_id': 'arXiv:2509.20138', 'title': 'Formal Verification of Minimax Algorithms', 'authors': 'Wieger Wesselink, Kees Huizing, Huub van de Wetering', 'link': 'https://arxiv.org/abs/2509.20138', 'abstract': 'Using the Dafny verification system, we formally verify a range of minimax search algorithms, including variations with alpha-beta pruning and transposition tables. For depth-limited search with transposition tables, we introduce a witness-based correctness criterion and apply it to two representative algorithms. All verification artifacts, including proofs and Python implementations, are publicly available.', 'abstract_zh': '使用Dafny验证系统，我们形式化验证了一系列极小极大搜索算法，包括带有α-β剪枝和置换表的变体。对于带有置换表的深度受限搜索，我们引入了一种基于证人的正确性标准，并将其应用于两种代表性算法。所有验证成果，包括证明和Python实现，均已公开。', 'title_zh': '最小化最大化算法的形式验证'}
{'arxiv_id': 'arXiv:2509.20095', 'title': 'From Pheromones to Policies: Reinforcement Learning for Engineered Biological Swarms', 'authors': 'Aymeric Vellinger, Nemanja Antonic, Elio Tuci', 'link': 'https://arxiv.org/abs/2509.20095', 'abstract': 'Swarm intelligence emerges from decentralised interactions among simple agents, enabling collective problem-solving. This study establishes a theoretical equivalence between pheromone-mediated aggregation in \\celeg\\ and reinforcement learning (RL), demonstrating how stigmergic signals function as distributed reward mechanisms. We model engineered nematode swarms performing foraging tasks, showing that pheromone dynamics mathematically mirror cross-learning updates, a fundamental RL algorithm. Experimental validation with data from literature confirms that our model accurately replicates empirical \\celeg\\ foraging patterns under static conditions. In dynamic environments, persistent pheromone trails create positive feedback loops that hinder adaptation by locking swarms into obsolete choices. Through computational experiments in multi-armed bandit scenarios, we reveal that introducing a minority of exploratory agents insensitive to pheromones restores collective plasticity, enabling rapid task switching. This behavioural heterogeneity balances exploration-exploitation trade-offs, implementing swarm-level extinction of outdated strategies. Our results demonstrate that stigmergic systems inherently encode distributed RL processes, where environmental signals act as external memory for collective credit assignment. By bridging synthetic biology with swarm robotics, this work advances programmable living systems capable of resilient decision-making in volatile environments.', 'abstract_zh': 'swarm智能源自简单代理之间去中心化的互动，使其能够集体解决问题。本研究建立了C. elegans的化学信号聚集与强化学习之间的理论等价性，展示了标记信号作为分布式奖励机制的运作方式。我们构建了工程化的线虫群进行觅食任务的模型，表明化学信号动态与交叉学习更新具有数学上的相似性，后者是基础的强化学习算法。通过文献数据的实验验证，证明我们的模型在静态条件下能够准确复制实测的C. elegans觅食模式。在动态环境中，持续的化学生命痕迹会产生正反馈循环，阻碍适应性，使群落固定在过时的选择上。通过在多臂老虎机情景下的计算实验，我们发现引入少数不受化学信号影响的探索代理，可以恢复群体的可塑性，使其能够快速切换任务。这种行为异质性平衡了探索与利用的权衡，实现了群体层级对过时策略的淘汰。我们的结果表明，标记信号系统本质上编码了分布式强化学习过程，其中环境信号作为群体共同信用分配的外部记忆。通过将合成生物学与 swarm 机器人学相结合，本工作推进了能够在多变环境中实现稳健决策的可编程生物系统。', 'title_zh': '从信息素到策略：工程化生物群 Swarm 的强化学习'}
{'arxiv_id': 'arXiv:2509.19800', 'title': 'Analysis of approximate linear programming solution to Markov decision problem with log barrier function', 'authors': 'Donghwan Lee, Hyukjun Yang, Bum Geun Park', 'link': 'https://arxiv.org/abs/2509.19800', 'abstract': 'There are two primary approaches to solving Markov decision problems (MDPs): dynamic programming based on the Bellman equation and linear programming (LP). Dynamic programming methods are the most widely used and form the foundation of both classical and modern reinforcement learning (RL). By contrast, LP-based methods have been less commonly employed, although they have recently gained attention in contexts such as offline RL. The relative underuse of the LP-based methods stems from the fact that it leads to an inequality-constrained optimization problem, which is generally more challenging to solve effectively compared with Bellman-equation-based methods. The purpose of this paper is to establish a theoretical foundation for solving LP-based MDPs in a more effective and practical manner. Our key idea is to leverage the log-barrier function, widely used in inequality-constrained optimization, to transform the LP formulation of the MDP into an unconstrained optimization problem. This reformulation enables approximate solutions to be obtained easily via gradient descent. While the method may appear simple, to the best of our knowledge, a thorough theoretical interpretation of this approach has not yet been developed. This paper aims to bridge this gap.', 'abstract_zh': '基于线性规划的方法求解马尔可夫决策过程的理论基础', 'title_zh': '基于对数障碍函数的马尔可夫决策问题近似线性规划求解分析'}
{'arxiv_id': 'arXiv:2509.19783', 'title': 'Agentic Metacognition: Designing a "Self-Aware" Low-Code Agent for Failure Prediction and Human Handoff', 'authors': 'Jiexi Xu', 'link': 'https://arxiv.org/abs/2509.19783', 'abstract': 'The inherent non-deterministic nature of autonomous agents, particularly within low-code/no-code (LCNC) environments, presents significant reliability challenges. Agents can become trapped in unforeseen loops, generate inaccurate outputs, or encounter unrecoverable failures, leading to user frustration and a breakdown of trust. This report proposes a novel architectural pattern to address these issues: the integration of a secondary, "metacognitive" layer that actively monitors the primary LCNC agent. Inspired by human introspection, this layer is designed to predict impending task failures based on a defined set of triggers, such as excessive latency or repetitive actions. Upon predicting a failure, the metacognitive agent proactively initiates a human handoff, providing the user with a clear summary of the agent\'s "thought process" and a detailed explanation of why it could not proceed. An empirical analysis of a prototype system demonstrates that this approach significantly increases the overall task success rate. However, this performance gain comes with a notable increase in computational overhead. The findings reframe human handoffs not as an admission of defeat but as a core design feature that enhances system resilience, improves user experience, and builds trust by providing transparency into the agent\'s internal state. The report discusses the practical and ethical implications of this approach and identifies key directions for future research.', 'abstract_zh': '自主代理的固有非确定性性质，特别是在低代码/无代码（LCNC）环境中，提出了显著的可靠性挑战。代理可能会陷入未预见的循环、生成不准确的输出，或遇到无法恢复的故障，导致用户 frustration 和信任崩溃。本报告提出了一种新的架构模式来解决这些问题：在主要的LCNC代理中集成一个次级的、“元认知”的层，该层主动监控主要代理。受人类反省的启发，该层设计为基于一定触发条件预测即将发生的任务失败，如过度延迟或重复动作。在预测到失败时，元认知代理主动发起人工干预，向用户提供代理“思维过程”的清晰总结和详细解释，说明它为何无法继续执行。对一个原型系统的实证分析表明，这种方法显著提高了整体任务的成功率。然而，这种性能增益伴随着计算开销的显著增加。研究结果重新定义了人工干预不仅仅是一种失败的承认，而是增强系统韧性的核心设计特征，改善用户体验，并通过提供代理内部状态的透明度来建立信任。报告讨论了这一方法的实践和伦理影响，并指出了未来研究的关键方向。', 'title_zh': '代理元认知：设计一种“自我意识”低代码代理进行故障预测和人工交接'}
{'arxiv_id': 'arXiv:2509.19736', 'title': 'UserRL: Training Interactive User-Centric Agent via Reinforcement Learning', 'authors': 'Cheng Qian, Zuxin Liu, Akshara Prabhakar, Jielin Qiu, Zhiwei Liu, Haolin Chen, Shirley Kokane, Heng Ji, Weiran Yao, Shelby Heinecke, Silvio Savarese, Caiming Xiong, Huan Wang', 'link': 'https://arxiv.org/abs/2509.19736', 'abstract': 'Reinforcement learning (RL) has shown promise in training agentic models that move beyond static benchmarks to engage in dynamic, multi-turn interactions. Yet, the ultimate value of such agents lies in their ability to assist users, a setting where diversity and dynamics of user interaction pose challenges. In this work, we propose UserRL, a unified framework for training and evaluating user-centric abilities through standardized gym environments paired with simulated users. We systematically vary turn-level reward assignment and trajectory-level score calculation to analyze how different formulations affect learning under the GRPO algorithm. Our experiments across Qwen3 models reveal three key findings: (i) SFT cold start is critical for unlocking initial interaction ability and enabling sustained RL improvements; (ii) deliberate trajectory scoring yields more efficient and effective multi-turn interactions; and (iii) while stronger simulated users (e.g., GPT-4o) facilitates training, open-source simulators (e.g., Qwen3-32B) remain a cost-effective and transferable option. Together, these results highlight that careful design of reward shaping and user simulation choice is as crucial as model scale, and establish UserRL as a practical pathway for developing robust user-centric agentic models. All codes and data are public for future research.', 'abstract_zh': '强化学习（RL）在训练能够超越静态基准并参与动态多轮交互的模型方面展现了潜力。然而，这类代理的价值在于其辅助用户的能力，而在这种用户交互多样性和动态性的背景下，这一任务面临着挑战。在本工作中，我们提出了一种名为UserRL的统一框架，通过标准化的健身环境配以模拟用户，来训练和评估以用户为中心的能力。我们系统地变化了回合级奖励分配和轨迹级评分计算方法，分析了不同形式如何影响GRPO算法下的学习。我们的实验结果揭示了三点关键发现：(i) 自动化建模初始交互能力对于解锁初始交互能力和持续的RL改进至关重要；(ii) 计划性轨迹评分能更有效地促进多轮交互；(iii) 虽然更强的模拟用户（如GPT-4o）有利于训练，开源模拟器（如Qwen3-32B）仍然是一个成本效益高且可转移的选择。这些结果表明，奖励塑造和用户模拟设计的精心规划与模型规模同样重要，并确立了UserRL作为一种实用路径，用于开发稳健的以用户为中心的代理模型。所有代码和数据均已公开，供未来研究使用。', 'title_zh': 'UserRL: 通过强化学习训练以用户为中心的交互智能体'}
{'arxiv_id': 'arXiv:2509.19681', 'title': 'Calibrated Reasoning: An Explanatory Verifier for Dynamic and Efficient Problem-Solving', 'authors': 'Anisha Garg, Engin Tekin, Yash More, David Bick, Nishit Neema, Ganesh Venkatesh', 'link': 'https://arxiv.org/abs/2509.19681', 'abstract': "Advanced test-time computing strategies are essential for scaling reasoning models, but their effectiveness is capped by the models' poor self-evaluation. We propose a pairwise Explanatory Verifier, trained via reinforcement learning (GRPO), that produces calibrated confidence scores and associated natural language reasoning for generated solutions. Our verifier improves the accuracy and efficiency of test-time strategies like best-of-n and self-reflection. Crucially, it excels at identifying challenging failure modes, such as when both candidate solutions are identically incorrect, succeeding where standard methods like majority voting fail.", 'abstract_zh': '先进的测试时计算策略对于扩展推理模型至关重要，但其效果受限于模型的 poor self-evaluation。我们提出了一个基于强化学习（GRPO）训练的成对解释验证器，该验证器生成校准的信任分数和相应的自然语言推理，以支持生成的解决方案。该验证器提高了像 best-of-n 和自我反思这类测试时策略的准确性和效率。最关键的是，它在识别具有挑战性的失败模式（例如，当两个候选解决方案都错误时）上表现更佳，而标准方法如多数投票则会失效。', 'title_zh': '校准推理：一种解释性验证器，用于动态高效的问题解决'}
{'arxiv_id': 'arXiv:2509.19623', 'title': 'SteinerSQL: Graph-Guided Mathematical Reasoning for Text-to-SQL Generation', 'authors': 'Xutao Mao, Tao Liu, Hongying Zan', 'link': 'https://arxiv.org/abs/2509.19623', 'abstract': 'Large Language Models (LLMs) struggle with complex Text-to-SQL queries that demand both sophisticated mathematical reasoning and intricate schema navigation. Existing methods often tackle these challenges in isolation, creating a fractured reasoning process that compromises logical and structural correctness. To resolve this, we introduce SteinerSQL, a framework that unifies these dual challenges into a single, graph-centric optimization problem. SteinerSQL operates in three stages: mathematical decomposition to identify required tables (terminals), optimal reasoning scaffold construction via a Steiner tree problem, and multi-level validation to ensure correctness. On the challenging LogicCat and Spider2.0-Lite benchmarks, SteinerSQL establishes a new state-of-the-art with 36.10% and 40.04% execution accuracy, respectively, using Gemini-2.5-Pro. Beyond accuracy, SteinerSQL presents a new, unified paradigm for Text-to-SQL, paving the way for more robust and principled solutions to complex reasoning tasks.', 'abstract_zh': '大型语言模型（LLMs）在处理既需要复杂的数学推理又需要精细的模式导航的Text-to-SQL查询时存在困难。现有方法往往将这些挑战孤立地解决，导致推理过程断层，影响逻辑和结构的正确性。为解决这一问题，我们提出SteinerSQL框架，将这些双重挑战统一为一个基于图的优化问题。SteinerSQL分三个阶段工作：数学分解以识别所需的表格（终端）、通过Steiner树问题构建最优推理框架，并进行多级验证以确保正确性。在具有挑战性的LogicCat和Spider2.0-Lite基准测试中，SteinerSQL分别使用Gemini-2.5-Pro实现了36.10%和40.04%的执行准确性。不仅如此，SteinerSQL还提出了一种新的统一Text-to-SQL范式，为更 robust 和原则性的复杂推理任务解决方案铺平了道路。', 'title_zh': 'SteinerSQL: 图引导的数学推理在文本到SQL生成中的应用'}
{'arxiv_id': 'arXiv:2509.19590', 'title': 'What Does Your Benchmark Really Measure? A Framework for Robust Inference of AI Capabilities', 'authors': 'Nathanael Jo, Ashia Wilson', 'link': 'https://arxiv.org/abs/2509.19590', 'abstract': "Evaluations of generative models on benchmark data are now ubiquitous, and their outcomes critically shape public and scientific expectations of AI's capabilities. Yet growing skepticism surrounds their reliability. How can we know that a reported accuracy genuinely reflects a model's true performance? Evaluations are often presented as simple measurements, but in reality they are inferences: to treat benchmark scores as evidence of capability is already to assume a theory of what capability is and how it manifests in a test. We make this step explicit by proposing a principled framework for evaluation as inference: begin from a theory of capability, and then derive methods for estimating it. This perspective, familiar in fields such as psychometrics, has not yet become commonplace in AI evaluation. As a proof of concept, we address a central challenge that undermines reliability: sensitivity to perturbations. After formulating a model of ability, we introduce methods that infer ability while accounting for uncertainty from sensitivity and finite samples, including an adaptive algorithm that significantly reduces sample complexity. Together, these contributions lay the groundwork for more reliable and trustworthy estimates of AI capabilities as measured through benchmarks.", 'abstract_zh': '基于基准数据的生成模型评估已无处不在，其结果对AI能力的公众和科学期望至关重要。然而，对其可靠性的怀疑日益加剧。我们如何知道报告的准确率真正反映了模型的真实性能？评估往往被简单呈现为测量，但实际上它们是推断：将基准分数视为能力证据的前提是对能力的理论及其在测试中表现形式的假设。我们通过提出一个规范的评估框架作为推断的方法，使之明确化：从能力的理论出发，然后推导出估计能力的方法。这种观点在心理测量学等领域已相当常见，但在AI评估中尚未普及。作为概念验证，我们针对影响可靠性的核心挑战——对扰动的敏感性——进行了研究。在构建能力模型后，我们引入了一种方法，在考虑敏感性和有限样本的不确定性的同时推断能力，并提出了一种自适应算法，显著降低了样本复杂性。这些贡献为通过基准测量AI能力的更可靠和可信赖的估计奠定了基础。', 'title_zh': '你的基准究竟衡量了什么？一种用于人工智能能力稳健推断的框架'}
{'arxiv_id': 'arXiv:2509.19456', 'title': 'The Indispensable Role of User Simulation in the Pursuit of AGI', 'authors': 'Krisztian Balog, ChengXiang Zhai', 'link': 'https://arxiv.org/abs/2509.19456', 'abstract': 'Progress toward Artificial General Intelligence (AGI) faces significant bottlenecks, particularly in rigorously evaluating complex interactive systems and acquiring the vast interaction data needed for training adaptive agents. This paper posits that user simulation -- creating computational agents that mimic human interaction with AI systems -- is not merely a useful tool, but is a critical catalyst required to overcome these bottlenecks and accelerate AGI development. We argue that realistic simulators provide the necessary environments for scalable evaluation, data generation for interactive learning, and fostering the adaptive capabilities central to AGI. Therefore, research into user simulation technology and intelligent task agents are deeply synergistic and must advance hand-in-hand. This article elaborates on the critical role of user simulation for AGI, explores the interdisciplinary nature of building realistic simulators, identifies key challenges including those posed by large language models, and proposes a future research agenda.', 'abstract_zh': '人工智能通用智能（AGI）进展面临显著瓶颈，特别是在严谨评估复杂交互系统和获取用于训练适应性代理的大量交互数据方面。本文认为，用户仿真——创建模仿人类与AI系统交互的计算代理——不仅是有用的工具，更是克服这些瓶颈和加速AGI开发的关键催化剂。我们主张，真实的仿真器提供了必要的环境，用于可扩展的评估、交互学习所需的数据生成以及培养AGI的核心适应能力。因此，用户仿真技术研究与智能任务代理的研究深度互补，必须同步进行。本文阐述了用户仿真在AGI中的关键作用，探讨了构建真实仿真器的跨学科性质，识别了包括大型语言模型在内的关键挑战，并提出未来研究议程。', 'title_zh': '用户模拟在追求AGI过程中的不可或缺作用'}
{'arxiv_id': 'arXiv:2509.20341', 'title': "Morphological Synthesizer for Ge'ez Language: Addressing Morphological Complexity and Resource Limitations", 'authors': 'Gebrearegawi Gebremariam, Hailay Teklehaymanot, Gebregewergs Mezgebe', 'link': 'https://arxiv.org/abs/2509.20341', 'abstract': "Ge'ez is an ancient Semitic language renowned for its unique alphabet. It serves as the script for numerous languages, including Tigrinya and Amharic, and played a pivotal role in Ethiopia's cultural and religious development during the Aksumite kingdom era. Ge'ez remains significant as a liturgical language in Ethiopia and Eritrea, with much of the national identity documentation recorded in Ge'ez. These written materials are invaluable primary sources for studying Ethiopian and Eritrean philosophy, creativity, knowledge, and civilization. Ge'ez has a complex morphological structure with rich inflectional and derivational morphology, and no usable NLP has been developed and published until now due to the scarcity of annotated linguistic data, corpora, labeled datasets, and lexicons. Therefore, we propose a rule-based Ge'ez morphological synthesizer to generate surface words from root words according to the morphological structures of the language. We used 1,102 sample verbs, representing all verb morphological structures, to test and evaluate the system. The system achieves a performance of 97.4%, outperforming the baseline model and suggesting that future work should build a comprehensive system considering morphological variations of the language.\nKeywords: Ge'ez, NLP, morphology, morphological synthesizer, rule-based", 'abstract_zh': '吉泽语是一种以独特字母闻名的古老闪米特语言。它作为提格雷尼亚语和阿姆哈拉语等语言的书写系统，在阿克苏姆王国时代对埃塞俄比亚的文化和宗教发展起到了关键作用。吉泽语在埃塞俄利亚和厄立特里亚作为礼拜语言仍具有重要意义，大量的国家身份文档都以吉泽语记录。这些书面材料是研究埃塞俄利亚和厄立特里亚哲学、创意、知识和文明的宝贵原始资料。吉泽语具有复杂的形态结构，丰富的屈折和派生形态学，但由于缺乏注释的语料库、标注数据集和词汇表，至今未开发出可用的NLP系统。因此，我们提出了一种基于规则的吉泽语形态合成器，根据语言的形态结构生成表层词汇。我们使用了1102个代表性动词样本，涵盖了所有动词的形态结构，对该系统进行了测试和评估。系统性能达到了97.4%，超过了基线模型，表明未来工作应在考虑语言形态变化的基础上构建全面的系统。', 'title_zh': '_ge’ez语言形态合成器：应对形态复杂性和资源限制_'}
{'arxiv_id': 'arXiv:2509.20338', 'title': 'Adaptive Event-Triggered Policy Gradient for Multi-Agent Reinforcement Learning', 'authors': 'Umer Siddique, Abhinav Sinha, Yongcan Cao', 'link': 'https://arxiv.org/abs/2509.20338', 'abstract': "Conventional multi-agent reinforcement learning (MARL) methods rely on time-triggered execution, where agents sample and communicate actions at fixed intervals. This approach is often computationally expensive and communication-intensive. To address this limitation, we propose ET-MAPG (Event-Triggered Multi-Agent Policy Gradient reinforcement learning), a framework that jointly learns an agent's control policy and its event-triggering policy. Unlike prior work that decouples these mechanisms, ET-MAPG integrates them into a unified learning process, enabling agents to learn not only what action to take but also when to execute it. For scenarios with inter-agent communication, we introduce AET-MAPG, an attention-based variant that leverages a self-attention mechanism to learn selective communication patterns. AET-MAPG empowers agents to determine not only when to trigger an action but also with whom to communicate and what information to exchange, thereby optimizing coordination. Both methods can be integrated with any policy gradient MARL algorithm. Extensive experiments across diverse MARL benchmarks demonstrate that our approaches achieve performance comparable to state-of-the-art, time-triggered baselines while significantly reducing both computational load and communication overhead.", 'abstract_zh': '基于事件触发的多智能体策略梯度强化学习（ET-MAPG）及其注意力变体（AET-MAPG）', 'title_zh': '自适应事件触发策略梯度在多智能体强化学习中的应用'}
{'arxiv_id': 'arXiv:2509.20319', 'title': 'Z-Scores: A Metric for Linguistically Assessing Disfluency Removal', 'authors': 'Maria Teleki, Sai Janjur, Haoran Liu, Oliver Grabner, Ketan Verma, Thomas Docog, Xiangjue Dong, Lingfeng Shi, Cong Wang, Stephanie Birkelbach, Jason Kim, Yin Zhang, James Caverlee', 'link': 'https://arxiv.org/abs/2509.20319', 'abstract': 'Evaluating disfluency removal in speech requires more than aggregate token-level scores. Traditional word-based metrics such as precision, recall, and F1 (E-Scores) capture overall performance but cannot reveal why models succeed or fail. We introduce Z-Scores, a span-level linguistically-grounded evaluation metric that categorizes system behavior across distinct disfluency types (EDITED, INTJ, PRN). Our deterministic alignment module enables robust mapping between generated text and disfluent transcripts, allowing Z-Scores to expose systematic weaknesses that word-level metrics obscure. By providing category-specific diagnostics, Z-Scores enable researchers to identify model failure modes and design targeted interventions -- such as tailored prompts or data augmentation -- yielding measurable performance improvements. A case study with LLMs shows that Z-Scores uncover challenges with INTJ and PRN disfluencies hidden in aggregate F1, directly informing model refinement strategies.', 'abstract_zh': '评估语音中的连贯性去除需要超出单词级别汇总得分。Z-分数：一种基于跨度的语义导向评估指标，用于跨不同类型断言（EDITED、INTJ、PRN）分类系统行为。', 'title_zh': 'Z-分数：一种语言评估连读删除的方法'}
{'arxiv_id': 'arXiv:2509.20290', 'title': 'PGCLODA: Prompt-Guided Graph Contrastive Learning for Oligopeptide-Infectious Disease Association Prediction', 'authors': 'Dayu Tan, Jing Chen, Xiaoping Zhou, Yansen Su, Chunhou Zheng', 'link': 'https://arxiv.org/abs/2509.20290', 'abstract': 'Infectious diseases continue to pose a serious threat to public health, underscoring the urgent need for effective computational approaches to screen novel anti-infective agents. Oligopeptides have emerged as promising candidates in antimicrobial research due to their structural simplicity, high bioavailability, and low susceptibility to resistance. Despite their potential, computational models specifically designed to predict associations between oligopeptides and infectious diseases remain scarce. This study introduces a prompt-guided graph-based contrastive learning framework (PGCLODA) to uncover potential associations. A tripartite graph is constructed with oligopeptides, microbes, and diseases as nodes, incorporating both structural and semantic information. To preserve critical regions during contrastive learning, a prompt-guided graph augmentation strategy is employed to generate meaningful paired views. A dual encoder architecture, integrating Graph Convolutional Network (GCN) and Transformer, is used to jointly capture local and global features. The fused embeddings are subsequently input into a multilayer perceptron (MLP) classifier for final prediction. Experimental results on a benchmark dataset indicate that PGCLODA consistently outperforms state-of-the-art models in AUROC, AUPRC, and accuracy. Ablation and hyperparameter studies confirm the contribution of each module. Case studies further validate the generalization ability of PGCLODA and its potential to uncover novel, biologically relevant associations. These findings offer valuable insights for mechanism-driven discovery and oligopeptide-based drug development. The source code of PGCLODA is available online at this https URL.', 'abstract_zh': '感染性疾病继续对公共卫生构成严重威胁，强调了迫切需要有效计算方法来筛选新型抗感染剂的急迫性。寡肽由于其结构简单、高生物利用度和低抗药性，已成为抗菌研究中的有前途的候选者。尽管具有巨大的潜力，但专门用于预测寡肽与感染性疾病之间关联的计算模型仍然稀缺。本文引入了一种基于提示的图对比学习框架（PGCLODA）以发现潜在的关联。构建了一个tripartite图，将寡肽、微生物和疾病作为节点，并结合了结构和语义信息。通过采用基于提示的图增强策略，生成有意义的配对视图，以保持对比学习过程中的关键区域。采用结合图卷积网络（GCN）和Transformer的双编码器架构，共同捕获局部和全局特征。融合后的嵌入随后输入多层感知机（MLP）分类器进行最终预测。在基准数据集上的实验结果表明，PGCLODA在AUROC、AUPRC和准确性方面均优于现有模型。消融和超参数研究证实了每个模块的贡献。案例研究进一步验证了PGCLODA的泛化能力和发现新型生物相关关联的潜力。这些发现为机制驱动的发现和基于寡肽的药物开发提供了宝贵见解。PGCLODA的源代码可在以下网址获得。', 'title_zh': 'PGCLODA：提示引导的图对比学习在寡肽-传染性疾病关联预测中的应用'}
{'arxiv_id': 'arXiv:2509.20287', 'title': 'Feeding Two Birds or Favoring One? Adequacy-Fluency Tradeoffs in Evaluation and Meta-Evaluation of Machine Translation', 'authors': 'Behzad Shayegh, Jan-Thorsten Peter, David Vilar, Tobias Domhan, Juraj Juraska, Markus Freitag, Lili Mou', 'link': 'https://arxiv.org/abs/2509.20287', 'abstract': 'We investigate the tradeoff between adequacy and fluency in machine translation. We show the severity of this tradeoff at the evaluation level and analyze where popular metrics fall within it. Essentially, current metrics generally lean toward adequacy, meaning that their scores correlate more strongly with the adequacy of translations than with fluency. More importantly, we find that this tradeoff also persists at the meta-evaluation level, and that the standard WMT meta-evaluation favors adequacy-oriented metrics over fluency-oriented ones. We show that this bias is partially attributed to the composition of the systems included in the meta-evaluation datasets. To control this bias, we propose a method that synthesizes translation systems in meta-evaluation. Our findings highlight the importance of understanding this tradeoff in meta-evaluation and its impact on metric rankings.', 'abstract_zh': '我们考察机器翻译中适当性和流畅性之间的权衡。我们在评估层面展示了这一权衡的严重性，并分析了流行指标在其间的分布情况。本质上，当前的指标通常更侧重于适当性，这意味着它们的得分与翻译的适当性相关性更强，而不是与流畅性。更重要的是，我们发现这一权衡在元评估层面也存在，并且标准的WMT元评估更偏好侧重适当性的指标，而不是侧重流畅性的指标。我们展示了这种偏见部分是由于元评估数据集所包含系统的构成。为了控制这种偏见，我们提出了一种合成元评估中翻译系统的办法。我们的发现强调了理解元评估中的这一权衡及其对指标排名影响的重要性。', 'title_zh': '兼顾两者还是偏向一方？机器翻译评估与元评估中的恰当性-流畅性权衡'}
{'arxiv_id': 'arXiv:2509.20240', 'title': 'A HyperGraphMamba-Based Multichannel Adaptive Model for ncRNA Classification', 'authors': 'Xin An, Ruijie Li, Qiao Ning, Hui Li, Qian Ma, Shikai Guo', 'link': 'https://arxiv.org/abs/2509.20240', 'abstract': "Non-coding RNAs (ncRNAs) play pivotal roles in gene expression regulation and the pathogenesis of various diseases. Accurate classification of ncRNAs is essential for functional annotation and disease diagnosis. To address existing limitations in feature extraction depth and multimodal fusion, we propose HGMamba-ncRNA, a HyperGraphMamba-based multichannel adaptive model, which integrates sequence, secondary structure, and optionally available expression features of ncRNAs to enhance classification performance. Specifically, the sequence of ncRNA is modeled using a parallel Multi-scale Convolution and LSTM architecture (MKC-L) to capture both local patterns and long-range dependencies of nucleotides. The structure modality employs a multi-scale graph transformer (MSGraphTransformer) to represent the multi-level topological characteristics of ncRNA secondary structures. The expression modality utilizes a Chebyshev Polynomial-based Kolmogorov-Arnold Network (CPKAN) to effectively model and interpret high-dimensional expression profiles. Finally, by incorporating virtual nodes to facilitate efficient and comprehensive multimodal interaction, HyperGraphMamba is proposed to adaptively align and integrate multichannel heterogeneous modality features. Experiments conducted on three public datasets demonstrate that HGMamba-ncRNA consistently outperforms state-of-the-art methods in terms of accuracy and other metrics. Extensive empirical studies further confirm the model's robustness, effectiveness, and strong transferability, offering a novel and reliable strategy for complex ncRNA functional classification. Code and datasets are available at this https URL.", 'abstract_zh': '非编码RNA（ncRNAs）在基因表达调控和多种疾病的发生机制中扮演关键角色。准确分类ncRNAs对于功能注释和疾病诊断至关重要。为了解决特征提取深度和多模态融合方面的现有局限性，我们提出了基于HyperGraphMamba的多通道自适应模型HGMamba-ncRNA，该模型整合了ncRNAs的序列、二级结构以及可获取的表达特征，以增强分类性能。具体而言，ncRNA序列使用并行多尺度卷积和LSTM架构（MKC-L）建模，以捕获核苷酸的局部模式和长程依赖性。结构模态采用多尺度图变换器（MSGraphTransformer）表示ncRNA二级结构的多层次拓扑特性。表达模态利用Chebyshev多项式基础上的Kolmogorov-Arnold网络（CPKAN）有效地建模和解释高维表达谱。最后，通过引入虚拟节点促进高效全面的多模态交互，提出了HyperGraphMamba以自适应对齐和整合多通道异质模态特征。在三个公开数据集上的实验表明，HGMamba-ncRNA在准确性和其他指标方面均优于现有方法。广泛的经验研究表明该模型具有鲁棒性、有效性及强迁移性，提供了一种处理复杂ncRNA功能分类的新颖可靠策略。代码和数据集可访问此链接。', 'title_zh': '基于HyperGraphMamba的多通道自适应ncRNA分类模型'}
{'arxiv_id': 'arXiv:2509.20215', 'title': 'The Cream Rises to the Top: Efficient Reranking Method for Verilog Code Generation', 'authors': 'Guang Yang, Wei Zheng, Xiang Chen, Yifan Sun, Fengji Zhang, Terry Yue Zhuo', 'link': 'https://arxiv.org/abs/2509.20215', 'abstract': 'LLMs face significant challenges in Verilog generation due to limited domain-specific knowledge. While sampling techniques improve pass@k metrics, hardware engineers need one trustworthy solution rather than uncertain candidates. To bridge this gap, we formulate it as a semantic alignment problem between requirements and Verilog implementations, and propose VCD-RNK, a discriminator model tailored for efficient Verilog code reranking. Specifically, VCD-RNKincorporates Verilog-specific reasoning by distilling expert knowledge across three dimensions: code semantic analysis, test case generation, and functional correctness assessment. By explicitly simulating the above reasoning processes during inference, VCD-RNK effectively avoids computationally intensive test execution in existing methods.', 'abstract_zh': 'LLMs在Verilog生成中面临显著挑战，受限于有限的专业领域知识。虽然采样技术改善了pass@k指标，硬件工程师更需要一个可靠的解决方案而非不确定的选择。为了弥合这一差距，我们将这一问题形式化为需求与Verilog实现之间的语义对齐问题，并提出了VCD-RNK，一种针对高效Verilog代码重排序的鉴别模型。具体而言，VCD-RNK通过提炼三维专家知识——代码语义分析、测试案例生成和功能正确性评估——增强了Verilog特定的推理能力。通过在推理过程中显式模拟上述推理过程，VCD-RNK有效避免了现有方法中计算密集型的测试执行。', 'title_zh': '优秀的代码浮上 come out on top: 基于高效重排序方法的Verilog代码生成'}
{'arxiv_id': 'arXiv:2509.20209', 'title': 'Low-Resource English-Tigrinya MT: Leveraging Multilingual Models, Custom Tokenizers, and Clean Evaluation Benchmarks', 'authors': 'Hailay Kidu Teklehaymanot, Gebrearegawi Gidey, Wolfgang Nejdl', 'link': 'https://arxiv.org/abs/2509.20209', 'abstract': 'Despite advances in Neural Machine Translation (NMT), low-resource languages like Tigrinya remain underserved due to persistent challenges, including limited corpora, inadequate tokenization strategies, and the lack of standardized evaluation benchmarks. This paper investigates transfer learning techniques using multilingual pretrained models to enhance translation quality for morphologically rich, low-resource languages. We propose a refined approach that integrates language-specific tokenization, informed embedding initialization, and domain-adaptive fine-tuning. To enable rigorous assessment, we construct a high-quality, human-aligned English-Tigrinya evaluation dataset covering diverse domains. Experimental results demonstrate that transfer learning with a custom tokenizer substantially outperforms zero-shot baselines, with gains validated by BLEU, chrF, and qualitative human evaluation. Bonferroni correction is applied to ensure statistical significance across configurations. Error analysis reveals key limitations and informs targeted refinements. This study underscores the importance of linguistically aware modeling and reproducible benchmarks in bridging the performance gap for underrepresented languages. Resources are available at this https URL\nand this https URL', 'abstract_zh': '尽管神经机器翻译（NMT）取得了进展，但由于数据量有限、分词策略不足和缺乏标准化评估基准等持续性的挑战，像提格雷尼亚语这样的低资源语言仍得不到充分服务。本文研究了使用多语言预训练模型的迁移学习技术，以提升形态学丰富的低资源语言的翻译质量。我们提出了一种改进的方法，该方法结合了语言特定的分词、有指导的嵌入初始化和领域适应性微调。为了进行严格的评估，我们构建了一个高质量的人工对齐的英语-提格雷尼亚语评估数据集，涵盖多个领域。实验结果表明，使用自定义分词器的迁移学习显著优于零-shot基准，通过BLEU、chrF和定性的手工评价得到了验证。使用布农尼罗修正确保各配置下的统计显著性。错误分析揭示了关键限制并指导了有针对性的改进。本研究强调了在减少欠代表语言性能差距时需重视语言意识建模和可再现基准的重要性。资源可访问于此https:// 和此https://。', 'title_zh': '低资源英提尼语机器翻译：利用多语言模型、自定义分词器和清洁评估基准'}
{'arxiv_id': 'arXiv:2509.20187', 'title': 'How People Manage Knowledge in their "Second Brains"- A Case Study with Industry Researchers Using Obsidian', 'authors': 'Juliana Jansen Ferreira, Vinícius Segura, Joana Gabriela Souza, Joao Henrique Gallas Brasil', 'link': 'https://arxiv.org/abs/2509.20187', 'abstract': "People face overwhelming information during work activities, necessitating effective organization and management strategies. Even in personal lives, individuals must keep, annotate, organize, and retrieve knowledge from daily routines. The collection of records for future reference is known as a personal knowledge base. Note-taking applications are valuable tools for building and maintaining these bases, often called a ''second brain''. This paper presents a case study on how people build and explore personal knowledge bases for various purposes. We selected the note-taking tool Obsidian and researchers from a Brazilian lab for an in-depth investigation. Our investigation reveals interesting findings about how researchers build and explore their personal knowledge bases. A key finding is that participants' knowledge retrieval strategy influences how they build and maintain their content. We suggest potential features for an AI system to support this process.", 'abstract_zh': '人们在工作活动中面临海量信息，需要有效的组织和管理策略。即使在个人生活中，个体也需要记录、注释、组织和检索日常生活中的知识。为了未来参考而收集的记录称为个人知识库。笔记应用程序是构建和维护这些知识库的有效工具，常被称为“第二个大脑”。本文展示了如何为了各种目的构建和探索个人知识库的案例研究。我们选择了笔记工具Obsidian和巴西实验室的研究人员进行了深入调查。我们的调查揭示了研究人员构建和探索个人知识库的一些有趣发现。一个关键发现是参与者的知识检索策略影响了他们构建和维护内容的方式。我们提出了可能支持这一过程的AI系统功能建议。', 'title_zh': '人们在其“第二个大脑”中管理知识的研究——基于使用Obsidian的行业研究人员案例研究'}
{'arxiv_id': 'arXiv:2509.20184', 'title': 'An Improved Time Series Anomaly Detection by Applying Structural Similarity', 'authors': 'Tiejun Wang, Rui Wang, Xudong Mou, Mengyuan Ma, Tianyu Wo, Renyu Yang, Xudong Liu', 'link': 'https://arxiv.org/abs/2509.20184', 'abstract': 'Effective anomaly detection in time series is pivotal for modern industrial applications and financial systems. Due to the scarcity of anomaly labels and the high cost of manual labeling, reconstruction-based unsupervised approaches have garnered considerable attention. However, accurate anomaly detection remains an unsettled challenge, since the optimization objectives of reconstruction-based methods merely rely on point-by-point distance measures, ignoring the potential structural characteristics of time series and thus failing to tackle complex pattern-wise anomalies. In this paper, we propose StrAD, a novel structure-enhanced anomaly detection approach to enrich the optimization objective by incorporating structural information hidden in the time series and steering the data reconstruction procedure to better capture such structural features. StrAD accommodates the trend, seasonality, and shape in the optimization objective of the reconstruction model to learn latent structural characteristics and capture the intrinsic pattern variation of time series. The proposed structure-aware optimization objective mechanism can assure the alignment between the original data and the reconstructed data in terms of structural features, thereby keeping consistency in global fluctuation and local characteristics. The mechanism is pluggable and applicable to any reconstruction-based methods, enhancing the model sensitivity to both point-wise anomalies and pattern-wise anomalies. Experimental results show that StrAD improves the performance of state-of-the-art reconstruction-based models across five real-world anomaly detection datasets.', 'abstract_zh': '结构增强的时间序列异常检测方法StrAD', 'title_zh': '应用结构相似性改进的时间序列异常检测'}
{'arxiv_id': 'arXiv:2509.20182', 'title': 'Automated Multi-Agent Workflows for RTL Design', 'authors': 'Amulya Bhattaram, Janani Ramamoorthy, Ranit Gupta, Diana Marculescu, Dimitrios Stamoulis', 'link': 'https://arxiv.org/abs/2509.20182', 'abstract': 'The rise of agentic AI workflows unlocks novel opportunities for computer systems design and optimization. However, for specialized domains such as program synthesis, the relative scarcity of HDL and proprietary EDA resources online compared to more common programming tasks introduces challenges, often necessitating task-specific fine-tuning, high inference costs, and manually-crafted agent orchestration. In this work, we present VeriMaAS, a multi-agent framework designed to automatically compose agentic workflows for RTL code generation. Our key insight is to integrate formal verification feedback from HDL tools directly into workflow generation, reducing the cost of gradient-based updates or prolonged reasoning traces. Our method improves synthesis performance by 5-7% for pass@k over fine-tuned baselines, while requiring only a few hundred training examples, representing an order-of-magnitude reduction in supervision cost.', 'abstract_zh': '基于代理的AI工作流的兴起为计算机系统设计与优化开启了新的机遇。然而，对于如程序合成这样的专业领域，相较于常见的编程任务，HDL和专有EDA资源的相对稀缺性常常带来挑战，通常需要任务特定的微调、高昂的推理成本以及手工编排的代理协同。本文提出了一种名为VeriMaAS的多代理框架，旨在自动生成用于RTL代码生成的代理工作流。我们的核心见解是直接将HDL工具的正式验证反馈整合到工作流生成中，从而减少基于梯度的更新或长时间推理轨迹的成本。该方法在k@pass性能上比微调基线提高了5-7%，同时只需要少量的训练样本，代表了监督成本的一个数量级减少。', 'title_zh': '基于RTL设计的自动化多代理工作流'}
{'arxiv_id': 'arXiv:2509.20113', 'title': 'Discovering Association Rules in High-Dimensional Small Tabular Data', 'authors': 'Erkan Karabulut, Daniel Daza, Paul Groth, Victoria Degeler', 'link': 'https://arxiv.org/abs/2509.20113', 'abstract': 'Association Rule Mining (ARM) aims to discover patterns between features in datasets in the form of propositional rules, supporting both knowledge discovery and interpretable machine learning in high-stakes decision-making. However, in high-dimensional settings, rule explosion and computational overhead render popular algorithmic approaches impractical without effective search space reduction, challenges that propagate to downstream tasks. Neurosymbolic methods, such as Aerial+, have recently been proposed to address the rule explosion in ARM. While they tackle the high dimensionality of the data, they also inherit limitations of neural networks, particularly reduced performance in low-data regimes.\nThis paper makes three key contributions to association rule discovery in high-dimensional tabular data. First, we empirically show that Aerial+ scales one to two orders of magnitude better than state-of-the-art algorithmic and neurosymbolic baselines across five real-world datasets. Second, we introduce the novel problem of ARM in high-dimensional, low-data settings, such as gene expression data from the biomedicine domain with around 18k features and 50 samples. Third, we propose two fine-tuning approaches to Aerial+ using tabular foundation models. Our proposed approaches are shown to significantly improve rule quality on five real-world datasets, demonstrating their effectiveness in low-data, high-dimensional scenarios.', 'abstract_zh': '高维表格数据中关联规则发现的神经符号方法研究', 'title_zh': '在高维小表数据中发现关联规则'}
{'arxiv_id': 'arXiv:2509.20057', 'title': 'Responsible AI Technical Report', 'authors': 'Soonmin Bae, Wanjin Park, Jeongyeop Kim, Yunjin Park, Jungwon Yoon, Junhyung Moon, Myunggyo Oh, Wonhyuk Lee, Junseo Jang, Dongyoung Jung, Minwook Ju, Eunmi Kim, Sujin Kim, Youngchol Kim, Somin Lee, Wonyoung Lee, Minsung Noh, Hyoungjun Park, Eunyoung Shin', 'link': 'https://arxiv.org/abs/2509.20057', 'abstract': "KT developed a Responsible AI (RAI) assessment methodology and risk mitigation technologies to ensure the safety and reliability of AI services. By analyzing the Basic Act on AI implementation and global AI governance trends, we established a unique approach for regulatory compliance and systematically identify and manage all potential risk factors from AI development to operation. We present a reliable assessment methodology that systematically verifies model safety and robustness based on KT's AI risk taxonomy tailored to the domestic environment. We also provide practical tools for managing and mitigating identified AI risks. With the release of this report, we also release proprietary Guardrail : SafetyGuard that blocks harmful responses from AI models in real-time, supporting the enhancement of safety in the domestic AI development ecosystem. We also believe these research outcomes provide valuable insights for organizations seeking to develop Responsible AI.", 'abstract_zh': 'KT开发了一种负责任的人工智能(RAI)评估方法和风险缓解技术，以确保人工智能服务的安全性和可靠性。通过分析《人工智能实施基本法》和全球人工智能治理趋势，我们建立了一种独特的合规方法，系统地识别和管理从人工智能开发到运营的所有潜在风险因素。我们提出了一种可靠的评估方法，基于KT为国内环境定制的人工智能风险分类，系统地验证模型的安全性和 robustness。我们还提供了管理和缓解已识别AI风险的实用工具。随着这份报告的发布，我们还推出了 proprietary Guardrail：SafetyGuard，这是一种实时阻止有害人工智能模型响应的工具，支持国内人工智能开发生态系统安全性提升。我们认为这些研究成果为寻求开发负责任人工智能的组织提供了宝贵的见解。', 'title_zh': '负责任人工智能技术报告'}
{'arxiv_id': 'arXiv:2509.20049', 'title': 'Projective Kolmogorov Arnold Neural Networks (P-KANs): Entropy-Driven Functional Space Discovery for Interpretable Machine Learning', 'authors': 'Alastair Poole, Stig McArthur, Saravan Kumar', 'link': 'https://arxiv.org/abs/2509.20049', 'abstract': 'Kolmogorov-Arnold Networks (KANs) relocate learnable nonlinearities from nodes to edges, demonstrating remarkable capabilities in scientific machine learning and interpretable modeling. However, current KAN implementations suffer from fundamental inefficiencies due to redundancy in high-dimensional spline parameter spaces, where numerous distinct parameterisations yield functionally equivalent behaviors. This redundancy manifests as a "nuisance space" in the model\'s Jacobian, leading to susceptibility to overfitting and poor generalization. We introduce Projective Kolmogorov-Arnold Networks (P-KANs), a novel training framework that guides edge function discovery towards interpretable functional representations through entropy-minimisation techniques from signal analysis and sparse dictionary learning. Rather than constraining functions to predetermined spaces, our approach maintains spline space flexibility while introducing "gravitational" terms that encourage convergence towards optimal functional representations. Our key insight recognizes that optimal representations can be identified through entropy analysis of projection coefficients, compressing edge functions to lower-parameter projective spaces (Fourier, Chebyshev, Bessel). P-KANs demonstrate superior performance across multiple domains, achieving up to 80% parameter reduction while maintaining representational capacity, significantly improved robustness to noise compared to standard KANs, and successful application to industrial automated fiber placement prediction. Our approach enables automatic discovery of mixed functional representations where different edges converge to different optimal spaces, providing both compression benefits and enhanced interpretability for scientific machine learning applications.', 'abstract_zh': '(projective) Kolmogorov-Arnold Networks (P-KANs): Entropy-Minimisation for Interpretable and Efficient Scientific Machine Learning', 'title_zh': '投影柯尔莫哥洛夫阿诺尔德神经网络(P-KANs):基于熵驱动的功能空间发现可解释机器学习'}
{'arxiv_id': 'arXiv:2509.20048', 'title': 'Diffusion-Augmented Contrastive Learning: A Noise-Robust Encoder for Biosignal Representations', 'authors': 'Rami Zewail', 'link': 'https://arxiv.org/abs/2509.20048', 'abstract': 'Learning robust representations for biosignals is often hampered by the challenge of designing effective data this http URL methods can fail to capture the complex variations inherent in physiological data. Within this context, we propose a novel hybrid framework, Diffusion-Augmented Contrastive Learning (DACL), that fuses concepts from diffusion models and supervised contrastive learning. The DACL framework operates on a latent space created by a lightweight Variational Autoencoder (VAE) trained on our novel Scattering Transformer (ST) features [12]. It utilizes the diffusion forward process as a principled data augmentation technique to generate multiple noisy views of these latent embeddings. A U-Net style encoder is then trained with a supervised contrastive objective to learn a representation that balances class discrimination with robustness to noise across various diffusion time steps. We evaluated this proof-of-concept method on the PhysioNet 2017 ECG dataset, achieving a competitive AUROC of 0.7815. This work establishes a new paradigm for representation learning by using the diffusion process itself to drive the contrastive objective, creating noise-invariant embeddings that demonstrate a strong foundation for class separability.', 'abstract_zh': '基于扩散增广对比学习的生物信号鲁棒表示学习', 'title_zh': '扩散增强对比学习：一种生物信号表示的噪声鲁棒编码器'}
{'arxiv_id': 'arXiv:2509.20024', 'title': 'Generative Adversarial Networks Applied for Privacy Preservation in Biometric-Based Authentication and Identification', 'authors': 'Lubos Mjachky, Ivan Homoliak', 'link': 'https://arxiv.org/abs/2509.20024', 'abstract': "Biometric-based authentication systems are getting broadly adopted in many areas. However, these systems do not allow participating users to influence the way their data is used. Furthermore, the data may leak and can be misused without the users' knowledge. In this paper, we propose a new authentication method that preserves the privacy of individuals and is based on a generative adversarial network (GAN). Concretely, we suggest using the GAN for translating images of faces to a visually private domain (e.g., flowers or shoes). Classifiers, which are used for authentication purposes, are then trained on the images from the visually private domain. Based on our experiments, the method is robust against attacks and still provides meaningful utility.", 'abstract_zh': '基于生物特征的身份认证系统已在许多领域广泛采用。然而，这些系统不允许参与者影响其数据的使用方式，且数据可能会泄漏并被不知情的滥用。在本文中，我们提出了一种新的身份认证方法，该方法保护个人隐私，并基于生成式对抗网络（GAN）。具体而言，我们建议使用GAN将面部图像转换为视觉隐私域（例如花朵或鞋子），然后用于身份验证目的的分类器在来自视觉隐私域的图像上进行训练。根据我们的实验，该方法对攻击具有鲁棒性，并仍能提供有意义的实用性。', 'title_zh': '基于生物特征识别的隐私保护生成对抗网络应用'}
{'arxiv_id': 'arXiv:2509.20003', 'title': 'Table Detection with Active Learning', 'authors': 'Somraj Gautam, Nachiketa Purohit, Gaurav Harit', 'link': 'https://arxiv.org/abs/2509.20003', 'abstract': 'Efficient data annotation remains a critical challenge in machine learning, particularly for object detection tasks requiring extensive labeled data. Active learning (AL) has emerged as a promising solution to minimize annotation costs by selecting the most informative samples. While traditional AL approaches primarily rely on uncertainty-based selection, recent advances suggest that incorporating diversity-based strategies can enhance sampling efficiency in object detection tasks. Our approach ensures the selection of representative examples that improve model generalization. We evaluate our method on two benchmark datasets (TableBank-LaTeX, TableBank-Word) using state-of-the-art table detection architectures, CascadeTabNet and YOLOv9. Our results demonstrate that AL-based example selection significantly outperforms random sampling, reducing annotation effort given a limited budget while maintaining comparable performance to fully supervised models. Our method achieves higher mAP scores within the same annotation budget.', 'abstract_zh': '高效的数据标注仍然是机器学习中的一个关键挑战，特别是在需要大量标注数据的对象检测任务中。主动学习(AL)已成为一种有前景的解决方案，通过选择最具信息量的样本来最小化标注成本。虽然传统的AL方法主要依赖于基于不确定性的选择，但最近的研究表明，在对象检测任务中结合多样性策略可以提高采样效率。我们的方法确保选择出能提高模型泛化能力的代表性样本。我们在两个基准数据集(TableBank-LaTeX, TableBank-Word)上使用最先进的表格检测架构(CascadeTabNet和YOLOv9)评估了我们的方法。实验结果表明，基于AL的样本选择明显优于随机采样，在有限的标注预算下减少了标注努力，并且在性能上与完全监督的模型相当。我们的方法在相同的标注预算内实现了更高的mAP分数。', 'title_zh': '主动学习的表格检测'}
{'arxiv_id': 'arXiv:2509.19996', 'title': 'Choosing to Be Green: Advancing Green AI via Dynamic Model Selection', 'authors': 'Emilio Cruciani, Roberto Verdecchia', 'link': 'https://arxiv.org/abs/2509.19996', 'abstract': 'Artificial Intelligence is increasingly pervasive across domains, with ever more complex models delivering impressive predictive performance. This fast technological advancement however comes at a concerning environmental cost, with state-of-the-art models - particularly deep neural networks and large language models - requiring substantial computational resources and energy. In this work, we present the intuition of Green AI dynamic model selection, an approach based on dynamic model selection that aims at reducing the environmental footprint of AI by selecting the most sustainable model while minimizing potential accuracy loss. Specifically, our approach takes into account the inference task, the environmental sustainability of available models, and accuracy requirements to dynamically choose the most suitable model. Our approach presents two different methods, namely Green AI dynamic model cascading and Green AI dynamic model routing. We demonstrate the effectiveness of our approach via a proof of concept empirical example based on a real-world dataset. Our results show that Green AI dynamic model selection can achieve substantial energy savings (up to ~25%) while substantially retaining the accuracy of the most energy greedy solution (up to ~95%). As conclusion, our preliminary findings highlight the potential that hybrid, adaptive model selection strategies withhold to mitigate the energy demands of modern AI systems without significantly compromising accuracy requirements.', 'abstract_zh': '绿色人工智能动态模型选择：降低环境足迹的同时保留预测准确性', 'title_zh': '选择绿色之路：通过动态模型选择推动绿色AI的发展'}
{'arxiv_id': 'arXiv:2509.19953', 'title': '2025 Southeast Asia Eleven Nations Influence Index Report', 'authors': 'Wei Meng', 'link': 'https://arxiv.org/abs/2509.19953', 'abstract': "This study constructs a fully data-driven and reproducible Southeast Asia Influence Index (SAII v3) to reduce bias from expert scoring and subjective weighting while mapping hierarchical power structures across the eleven ASEAN nations. We aggregate authoritative open-source indicators across four dimensions (economic, military, diplomatic, socio-technological) and apply a three-tiered standardization chain quantile-Box-Cox-min-max to mitigate outliers and skewness. Weights are obtained through equal-weight integration of Entropy Weighting Method (EWM), CRITIC, and PCA. Robustness is assessed via Kendall's tau, +/-20% weight perturbation, and 10,000 bootstrap iterations, with additional checks including +/-10% dimensional sensitivity and V2-V3 bump chart comparisons. Results show integrated weights: Economy 35-40%, Military 20-25%, Diplomacy about 20%, Socio-Technology about 15%. The regional landscape exhibits a one-strong, two-medium, three-stable, and multiple-weak pattern: Indonesia, Singapore, and Malaysia lead, while Thailand, the Philippines, and Vietnam form a mid-tier competitive band. V2 and V3 rankings are highly consistent (Kendall's tau = 0.818), though small mid-tier reorderings appear (Thailand and the Philippines rise, Vietnam falls), indicating that v3 is more sensitive to structural equilibrium. ASEAN-11 average sensitivity highlights military and socio-technological dimensions as having the largest marginal effects (+/-0.002). In conclusion, SAII v3 delivers algorithmic weighting and auditable reproducibility, reveals multidimensional drivers of influence in Southeast Asia, and provides actionable quantitative evidence for resource allocation and policy prioritization by regional governments and external partners.", 'abstract_zh': '东南亚影响指数（SAII v3）：基于完全数据驱动和可重复的方法减少专家评分偏见和主观权重，描绘十一国 ASEAN 的层级权力结构', 'title_zh': '2025年东南亚十一国影响力指数报告'}
{'arxiv_id': 'arXiv:2509.19947', 'title': 'A Set of Generalized Components to Achieve Effective Poison-only Clean-label Backdoor Attacks with Collaborative Sample Selection and Triggers', 'authors': 'Zhixiao Wu, Yao Lu, Jie Wen, Hao Sun, Qi Zhou, Guangming Lu', 'link': 'https://arxiv.org/abs/2509.19947', 'abstract': "Poison-only Clean-label Backdoor Attacks aim to covertly inject attacker-desired behavior into DNNs by merely poisoning the dataset without changing the labels. To effectively implant a backdoor, multiple \\textbf{triggers} are proposed for various attack requirements of Attack Success Rate (ASR) and stealthiness. Additionally, sample selection enhances clean-label backdoor attacks' ASR by meticulously selecting ``hard'' samples instead of random samples to poison. Current methods 1) usually handle the sample selection and triggers in isolation, leading to severely limited improvements on both ASR and stealthiness. Consequently, attacks exhibit unsatisfactory performance on evaluation metrics when converted to PCBAs via a mere stacking of methods. Therefore, we seek to explore the bidirectional collaborative relations between the sample selection and triggers to address the above dilemma. 2) Since the strong specificity within triggers, the simple combination of sample selection and triggers fails to substantially enhance both evaluation metrics, with generalization preserved among various attacks. Therefore, we seek to propose a set of components to significantly improve both stealthiness and ASR based on the commonalities of attacks. Specifically, Component A ascertains two critical selection factors, and then makes them an appropriate combination based on the trigger scale to select more reasonable ``hard'' samples for improving ASR. Component B is proposed to select samples with similarities to relevant trigger implanted samples to promote stealthiness. Component C reassigns trigger poisoning intensity on RGB colors through distinct sensitivity of the human visual system to RGB for higher ASR, with stealthiness ensured by sample selection, including Component B. Furthermore, all components can be strategically integrated into diverse PCBAs.", 'abstract_zh': '仅毒药样本无标签后门攻击旨在通过污染数据集而无需更改标签来秘密植入攻击者希望的行为。为了有效植入后门，提出了多种触发器以满足不同攻击成功率（ASR）和隐蔽性要求。此外，样本选择通过精心选择“困难”样本而非随机样本来污染，以增强无标签后门攻击的ASR。当前方法通常将样本选择和触发器孤立处理，导致ASR和隐蔽性改善有限。因此，当通过简单堆叠方法转换为PCBA时，攻击在评估指标上的表现不佳。因此，我们寻求探索样本选择与触发器之间的双向协作关系以解决上述困境。由于触发器的强烈特异性，样本选择与触发器的简单组合未能实质性地提升评估指标，同时保持不同攻击间的泛化能力。因此，我们寻求提出一套基于攻击共同点的组件以显著提高隐蔽性和ASR。具体而言，组件A确定两个关键选择因素，并根据触发器的规模使它们成为适当的组合，以选择更多合理的“困难”样本，从而提高ASR。组件B提出了一种选择与相关植入触发器样本相似的样本的方法，以促进隐蔽性。组件C通过利用人类视觉系统对RGB颜色的不同敏感度重新分配触发器污染强度以提高ASR，并通过样本选择（包括组件B）确保隐蔽性。此外，所有组件可以战略性地集成到各种PCBA中。', 'title_zh': '一套通用组件以实现有效的仅毒样本干净标签后门攻击并结合协作样本选择和触发器'}
{'arxiv_id': 'arXiv:2509.19943', 'title': 'Interpreting ResNet-based CLIP via Neuron-Attention Decomposition', 'authors': 'Edmund Bu, Yossi Gandelsman', 'link': 'https://arxiv.org/abs/2509.19943', 'abstract': "We present a novel technique for interpreting the neurons in CLIP-ResNet by decomposing their contributions to the output into individual computation paths. More specifically, we analyze all pairwise combinations of neurons and the following attention heads of CLIP's attention-pooling layer. We find that these neuron-head pairs can be approximated by a single direction in CLIP-ResNet's image-text embedding space. Leveraging this insight, we interpret each neuron-head pair by associating it with text. Additionally, we find that only a sparse set of the neuron-head pairs have a significant contribution to the output value, and that some neuron-head pairs, while polysemantic, represent sub-concepts of their corresponding neurons. We use these observations for two applications. First, we employ the pairs for training-free semantic segmentation, outperforming previous methods for CLIP-ResNet. Second, we utilize the contributions of neuron-head pairs to monitor dataset distribution shifts. Our results demonstrate that examining individual computation paths in neural networks uncovers interpretable units, and that such units can be utilized for downstream tasks.", 'abstract_zh': '我们提出了一种新颖的技术，通过将CLIP-ResNet中神经元对输出的贡献分解为独立的计算路径来解释CLIP-ResNet中的神经元。具体来说，我们分析了CLIP的注意力池化层的所有两两神经元组合及其后续的注意力头。我们发现这些神经元-头对可以被CLIP-ResNet的图像-文本嵌入空间中的单一方向近似表示。利用这一洞察，我们通过将每个神经元-头对关联到文本来进行解释。此外，我们发现只有少数的神经元-头对对输出值有显著贡献，而某些神经元-头对虽然是多义性的，但代表了其对应神经元的子概念。我们利用这些观察进行了两个应用。首先，我们使用这些对进行无训练的语义分割，超越了之前针对CLIP-ResNet的方法。其次，我们利用神经元-头对的贡献来监控数据集分布的变化。我们的结果表明，在神经网络中检查独立的计算路径可以揭示可解释的单位，并且这些单位可以用于下游任务。', 'title_zh': '基于神经元注意力分解的ResNet-CLIP解析'}
{'arxiv_id': 'arXiv:2509.19941', 'title': 'CorIL: Towards Enriching Indian Language to Indian Language Parallel Corpora and Machine Translation Systems', 'authors': 'Soham Bhattacharjee, Mukund K Roy, Yathish Poojary, Bhargav Dave, Mihir Raj, Vandan Mujadia, Baban Gain, Pruthwik Mishra, Arafat Ahsan, Parameswari Krishnamurthy, Ashwath Rao, Gurpreet Singh Josan, Preeti Dubey, Aadil Amin Kak, Anna Rao Kulkarni, Narendra VG, Sunita Arora, Rakesh Balbantray, Prasenjit Majumdar, Karunesh K Arora, Asif Ekbal, Dipti Mishra Sharma', 'link': 'https://arxiv.org/abs/2509.19941', 'abstract': "India's linguistic landscape is one of the most diverse in the world, comprising over 120 major languages and approximately 1,600 additional languages, with 22 officially recognized as scheduled languages in the Indian Constitution. Despite recent progress in multilingual neural machine translation (NMT), high-quality parallel corpora for Indian languages remain scarce, especially across varied domains. In this paper, we introduce a large-scale, high-quality annotated parallel corpus covering 11 of these languages : English, Telugu, Hindi, Punjabi, Odia, Kashmiri, Sindhi, Dogri, Kannada, Urdu, and Gujarati comprising a total of 772,000 bi-text sentence pairs. The dataset is carefully curated and systematically categorized into three key domains: Government, Health, and General, to enable domain-aware machine translation research and facilitate effective domain adaptation. To demonstrate the utility of CorIL and establish strong benchmarks for future research, we fine-tune and evaluate several state-of-the-art NMT models, including IndicTrans2, NLLB, and BhashaVerse. Our analysis reveals important performance trends and highlights the corpus's value in probing model capabilities. For instance, the results show distinct performance patterns based on language script, with massively multilingual models showing an advantage on Perso-Arabic scripts (Urdu, Sindhi) while other models excel on Indic scripts. This paper provides a detailed domain-wise performance analysis, offering insights into domain sensitivity and cross-script transfer learning. By publicly releasing CorIL, we aim to significantly improve the availability of high-quality training data for Indian languages and provide a valuable resource for the machine translation research community.", 'abstract_zh': '印度的语言景观是世界上最为多元的之一，包含超过120种主要语言和大约1,600种其他语言，其中22种被印度宪法正式列为官方语言。尽管近期多语言神经机器翻译（NMT）取得了进展，但印度语言的高质量并行语料库仍然稀缺，尤其是在不同领域之间。本文介绍了一个大规模、高质量的标注并行语料库，覆盖了11种语言：英语、泰卢固语、印地语、旁遮普语、奥里亚语、克什米尔语、信德语、狗拉语、卡纳达语、乌尔都语和 Gujarati，包含共计772,000个双文本句对。该数据集经过精心编纂，并系统地分为三大关键领域：政府、健康和通用，以促进领域感知机器翻译研究，并促进有效的领域适应。为了展示CorIL的实用性和为未来研究建立强大的基准，我们对几种最先进的NMT模型进行了微调和评估，包括IndicTrans2、NLLB和BhashaVerse。我们的分析揭示了重要的性能趋势，并突显了该语料库在探究模型能力方面的价值。例如，结果表明基于语言书写系统的不同性能模式，海量多语言模型在波斯-阿拉伯书写系统（乌尔都语、信德语）上表现出优势，而在印度语书写系统上则其他模型表现出色。本文提供了详细的领域性能分析，为领域敏感性和跨书写系统迁移学习提供了见解。通过公开发布CorIL，我们旨在显著提高印度语言高质量训练数据的可用性，并为机器翻译研究社区提供有价值的资源。', 'title_zh': 'CorIL: 向印度语言平行语料库和机器翻译系统丰富印度语言的研究'}
{'arxiv_id': 'arXiv:2509.19927', 'title': 'TABFAIRGDT: A Fast Fair Tabular Data Generator using Autoregressive Decision Trees', 'authors': 'Emmanouil Panagiotou, Benoît Ronval, Arjun Roy, Ludwig Bothmann, Bernd Bischl, Siegfried Nijssen, Eirini Ntoutsi', 'link': 'https://arxiv.org/abs/2509.19927', 'abstract': 'Ensuring fairness in machine learning remains a significant challenge, as models often inherit biases from their training data. Generative models have recently emerged as a promising approach to mitigate bias at the data level while preserving utility. However, many rely on deep architectures, despite evidence that simpler models can be highly effective for tabular data. In this work, we introduce TABFAIRGDT, a novel method for generating fair synthetic tabular data using autoregressive decision trees. To enforce fairness, we propose a soft leaf resampling technique that adjusts decision tree outputs to reduce bias while preserving predictive performance. Our approach is non-parametric, effectively capturing complex relationships between mixed feature types, without relying on assumptions about the underlying data distributions. We evaluate TABFAIRGDT on benchmark fairness datasets and demonstrate that it outperforms state-of-the-art (SOTA) deep generative models, achieving better fairness-utility trade-off for downstream tasks, as well as higher synthetic data quality. Moreover, our method is lightweight, highly efficient, and CPU-compatible, requiring no data pre-processing. Remarkably, TABFAIRGDT achieves a 72% average speedup over the fastest SOTA baseline across various dataset sizes, and can generate fair synthetic data for medium-sized datasets (10 features, 10K samples) in just one second on a standard CPU, making it an ideal solution for real-world fairness-sensitive applications.', 'abstract_zh': '确保机器学习中的公平性仍然是一个重大挑战，因为模型往往会继承其训练数据中的偏见。生成模型最近 emerges as a promising approach to mitigate偏见 at the data level while preserving utility.然而，许多生成模型依赖于深度架构，尽管有证据表明，对于表格数据来说，更简单的模型可以非常有效。在本工作中，我们引入了TABFAIRGDT，这是一种使用自回归决策树生成公平合成表格数据的新型方法。为了确保公平性，我们提出了一种软叶重采样技术，该技术调整决策树输出以减少偏见，同时保持预测性能。我们的方法是非参数的，有效地捕捉了混合特征类型之间的复杂关系，而不需要关于底层数据分布的假设。我们在基准公平性数据集上评估了TABFAIRGDT，并证明它超过最先进的深度生成模型，对于下游任务实现了更好的公平性与实用性权衡，以及更高的合成数据质量。此外，我们的方法具有轻量级、高效率和CPU兼容性，无需数据预处理。令人惊讶的是，TABFAIRGDT在各种数据集大小下相对于最快的最先进的基线实现了72%的平均加速，并且在标准CPU上仅需一秒即可生成中型数据集（10个特征，10,000个样本）的公平合成数据，使其成为现实世界公平敏感应用的理想解决方案。', 'title_zh': 'TABFAIRGDT：基于自回归决策树的快速公平表结构数据生成器'}
{'arxiv_id': 'arXiv:2509.19885', 'title': 'Towards Self-Supervised Foundation Models for Critical Care Time Series', 'authors': 'Katja Naasunnguaq Jagd, Rachael DeVries, Ole Winther', 'link': 'https://arxiv.org/abs/2509.19885', 'abstract': 'Domain-specific foundation models for healthcare have expanded rapidly in recent years, yet foundation models for critical care time series remain relatively underexplored due to the limited size and availability of datasets. In this work, we introduce an early-stage pre-trained foundation model for critical care time-series based on the Bi-Axial Transformer (BAT), trained on pooled electronic health record datasets. We demonstrate effective transfer learning by fine-tuning the model on a dataset distinct from the training sources for mortality prediction, where it outperforms supervised baselines, particularly for small datasets ($<5,000$). These contributions highlight the potential of self-supervised foundation models for critical care times series to support generalizable and robust clinical applications in resource-limited settings.', 'abstract_zh': '基于Bi-Axial Transformer的早期训练基础模型在重症监护时序数据中的应用：支持资源受限环境下的通用和稳健临床应用', 'title_zh': '面向重症监护时间序列的自监督基础模型研究'}
{'arxiv_id': 'arXiv:2509.19883', 'title': 'CoMelSinger: Discrete Token-Based Zero-Shot Singing Synthesis With Structured Melody Control and Guidance', 'authors': 'Junchuan Zhao, Wei Zeng, Tianle Lyu, Ye Wang', 'link': 'https://arxiv.org/abs/2509.19883', 'abstract': 'Singing Voice Synthesis (SVS) aims to generate expressive vocal performances from structured musical inputs such as lyrics and pitch sequences. While recent progress in discrete codec-based speech synthesis has enabled zero-shot generation via in-context learning, directly extending these techniques to SVS remains non-trivial due to the requirement for precise melody control. In particular, prompt-based generation often introduces prosody leakage, where pitch information is inadvertently entangled within the timbre prompt, compromising controllability. We present CoMelSinger, a zero-shot SVS framework that enables structured and disentangled melody control within a discrete codec modeling paradigm. Built on the non-autoregressive MaskGCT architecture, CoMelSinger replaces conventional text inputs with lyric and pitch tokens, preserving in-context generalization while enhancing melody conditioning. To suppress prosody leakage, we propose a coarse-to-fine contrastive learning strategy that explicitly regularizes pitch redundancy between the acoustic prompt and melody input. Furthermore, we incorporate a lightweight encoder-only Singing Voice Transcription (SVT) module to align acoustic tokens with pitch and duration, offering fine-grained frame-level supervision. Experimental results demonstrate that CoMelSinger achieves notable improvements in pitch accuracy, timbre consistency, and zero-shot transferability over competitive baselines.', 'abstract_zh': '歌唱语音合成（SVS）的目标是从结构化的音乐输入（如歌词和音高序列）中生成富有表现力的 vocal 表演。尽管基于离散编解码器的语音合成技术在上下文学习中实现了零样本生成，但由于严格的音高控制要求，将这些技术直接扩展到SVS仍然具有挑战性。特别是，基于提示的生成往往会引入语调泄漏，其中音高信息无意中与音色提示交织在一起，损害了可控性。我们提出了一种零样本SVS框架——CoMelSinger，它在离散编解码器建模范式中实现了结构化和分离的音高控制。基于非自回归MaskGCT架构，CoMelSinger用歌词和音高令牌替代了常规文本输入，保持了上下文泛化能力的同时增强了音高的条件控制。为抑制语调泄漏，我们提出了一种从细到粗的对比学习策略，明确定义了声学提示和音高输入之间的音高冗余正则化。此外，我们引入了一个轻量级的仅编码器歌唱语音转录（SVT）模块，将声学令牌与音高和时长对齐，提供细粒度的帧级监督。实验结果表明，CoMelSinger在音高准确性、音色一致性和零样本可迁移性方面优于竞争 baseline。', 'title_zh': 'CoMelSinger：基于离散令牌的零样本唱歌合成及其结构化旋律控制与指导'}
{'arxiv_id': 'arXiv:2509.19877', 'title': 'Advancing Universal Deep Learning for Electronic-Structure Hamiltonian Prediction of Materials', 'authors': 'Shi Yin, Zujian Dai, Xinyang Pan, Lixin He', 'link': 'https://arxiv.org/abs/2509.19877', 'abstract': 'Deep learning methods for electronic-structure Hamiltonian prediction has offered significant computational efficiency advantages over traditional DFT methods, yet the diversity of atomic types, structural patterns, and the high-dimensional complexity of Hamiltonians pose substantial challenges to the generalization performance. In this work, we contribute on both the methodology and dataset sides to advance universal deep learning paradigm for Hamiltonian prediction. On the method side, we propose NextHAM, a neural E(3)-symmetry and expressive correction method for efficient and generalizable materials electronic-structure Hamiltonian prediction. First, we introduce the zeroth-step Hamiltonians, which can be efficiently constructed by the initial charge density of DFT, as informative descriptors of neural regression model in the input level and initial estimates of the target Hamiltonian in the output level, so that the regression model directly predicts the correction terms to the target ground truths, thereby significantly simplifying the input-output mapping for learning. Second, we present a neural Transformer architecture with strict E(3)-Symmetry and high non-linear expressiveness for Hamiltonian prediction. Third, we propose a novel training objective to ensure the accuracy performance of Hamiltonians in both real space and reciprocal space, preventing error amplification and the occurrence of "ghost states" caused by the large condition number of the overlap matrix. On the dataset side, we curate a high-quality broad-coverage large benchmark, namely Materials-HAM-SOC, comprising 17,000 material structures spanning 68 elements from six rows of the periodic table and explicitly incorporating SOC effects. Experimental results on Materials-HAM-SOC demonstrate that NextHAM achieves excellent accuracy and efficiency in predicting Hamiltonians and band structures.', 'abstract_zh': '深度学习方法在电子结构哈密顿量预测中的应用提供了比传统密度泛函理论方法显著的计算效率优势，但原子类型多样性、结构模式的复杂性和哈密顿量的高维复杂性给泛化性能带来了重大挑战。在此项工作中，我们在方法和数据集两个方面推进了适用于哈密顿量预测的通用深度学习范式。在方法方面，我们提出了一种名为NextHAM的神经网络模型，该模型结合了E(3)-对称性和表达性校正方法，以实现高效和泛化能力强的材料电子结构哈密顿量预测。首先，我们引入了零步哈密顿量，可以通过DFT的初始电荷密度高效构建，作为神经回归模型的输入级信息描述符和目标哈密顿量的初始估计值，使得回归模型可以直接预测目标地面真实值的校正项，从而显著简化了输入与输出映射的复杂性。其次，我们提出了一种严格保持E(3)-对称性并具有高非线性表达性的神经Transformer架构，用于哈密顿量预测。第三，我们提出了一种新的训练目标，以确保哈密顿量在实际空间和倒易空间中的准确性，防止误差放大和“幽灵态”的出现，由于重叠矩阵的条件数较大所引起的上述现象。在数据集方面，我们整理了一个高质量且覆盖面广的大规模基准数据集，即Materials-HAM-SOC，包含17,000种材料结构，覆盖周期表六行中的68种元素，并明确包含了自旋轨道耦合作用。基于Materials-HAM-SOC的数据实验结果表明，NextHAM在预测哈密顿量和能带结构方面表现出色且高效。', 'title_zh': '推进适用于材料电子结构哈密顿量预测的通用深度学习方法'}
{'arxiv_id': 'arXiv:2509.19849', 'title': 'Analyzing Generalization in Pre-Trained Symbolic Regression', 'authors': 'Henrik Voigt, Paul Kahlmeyer, Kai Lawonn, Michael Habeck, Joachim Giesen', 'link': 'https://arxiv.org/abs/2509.19849', 'abstract': 'Symbolic regression algorithms search a space of mathematical expressions for formulas that explain given data. Transformer-based models have emerged as a promising, scalable approach shifting the expensive combinatorial search to a large-scale pre-training phase. However, the success of these models is critically dependent on their pre-training data. Their ability to generalize to problems outside of this pre-training distribution remains largely unexplored. In this work, we conduct a systematic empirical study to evaluate the generalization capabilities of pre-trained, transformer-based symbolic regression. We rigorously test performance both within the pre-training distribution and on a series of out-of-distribution challenges for several state of the art approaches. Our findings reveal a significant dichotomy: while pre-trained models perform well in-distribution, the performance consistently degrades in out-of-distribution scenarios. We conclude that this generalization gap is a critical barrier for practitioners, as it severely limits the practical use of pre-trained approaches for real-world applications.', 'abstract_zh': '基于变压器的预训练符号回归算法的泛化能力研究', 'title_zh': '分析预训练符号回归中的泛化能力'}
{'arxiv_id': 'arXiv:2509.19830', 'title': 'On the Rate of Convergence of Kolmogorov-Arnold Network Regression Estimators', 'authors': 'Wei Liu, Eleni Chatzi, Zhilu Lai', 'link': 'https://arxiv.org/abs/2509.19830', 'abstract': 'Kolmogorov-Arnold Networks (KANs) offer a structured and interpretable framework for multivariate function approximation by composing univariate transformations through additive or multiplicative aggregation. This paper establishes theoretical convergence guarantees for KANs when the univariate components are represented by B-splines. We prove that both additive and hybrid additive-multiplicative KANs attain the minimax-optimal convergence rate $O(n^{-2r/(2r+1)})$ for functions in Sobolev spaces of smoothness $r$. We further derive guidelines for selecting the optimal number of knots in the B-splines. The theory is supported by simulation studies that confirm the predicted convergence rates. These results provide a theoretical foundation for using KANs in nonparametric regression and highlight their potential as a structured alternative to existing methods.', 'abstract_zh': 'Kolmogorov-Arnold网络(KANs)通过加性或乘性聚合单变量变换提供了多变量函数逼近的结构化和可解释框架。当单变量组件由B样条表示时，本文建立了KANs的理论收敛保证。我们证明了加性及加-乘混合KANs对于光滑性为$r$的Sobolev空间中的函数实现了最优的最小最大收敛率$O(n^{-2r/(2r+1)})$。我们进一步推导了选择B样条最优节点数的准则。理论结果通过模拟研究得到了验证，确认了预测的收敛率。这些结果为在非参数回归中使用KANs提供了理论基础，并突显了它们作为现有方法结构化替代方案的潜力。', 'title_zh': '柯尔莫哥罗夫-阿诺尔德网络回归估计收敛速度的研究'}
{'arxiv_id': 'arXiv:2509.19814', 'title': 'Causal Inference under Threshold Manipulation: Bayesian Mixture Modeling and Heterogeneous Treatment Effects', 'authors': 'Kohsuke Kubota, Shonosuke Sugasawa', 'link': 'https://arxiv.org/abs/2509.19814', 'abstract': 'Many marketing applications, including credit card incentive programs, offer rewards to customers who exceed specific spending thresholds to encourage increased consumption. Quantifying the causal effect of these thresholds on customers is crucial for effective marketing strategy design. Although regression discontinuity design is a standard method for such causal inference tasks, its assumptions can be violated when customers, aware of the thresholds, strategically manipulate their spending to qualify for the rewards. To address this issue, we propose a novel framework for estimating the causal effect under threshold manipulation. The main idea is to model the observed spending distribution as a mixture of two distributions: one representing customers strategically affected by the threshold, and the other representing those unaffected. To fit the mixture model, we adopt a two-step Bayesian approach consisting of modeling non-bunching customers and fitting a mixture model to a sample around the threshold. We show posterior contraction of the resulting posterior distribution of the causal effect under large samples. Furthermore, we extend this framework to a hierarchical Bayesian setting to estimate heterogeneous causal effects across customer subgroups, allowing for stable inference even with small subgroup sample sizes. We demonstrate the effectiveness of our proposed methods through simulation studies and illustrate their practical implications using a real-world marketing dataset.', 'abstract_zh': '基于阈值操纵的因果效应估计新框架', 'title_zh': '阈值操纵下的因果推理：贝叶斯混合模型与异质治疗效应'}
{'arxiv_id': 'arXiv:2509.19773', 'title': 'Sobolev acceleration for neural networks', 'authors': 'Jong Kwon Oh, Hanbaek Lyu, Hwijae Son', 'link': 'https://arxiv.org/abs/2509.19773', 'abstract': 'Sobolev training, which integrates target derivatives into the loss functions, has been shown to accelerate convergence and improve generalization compared to conventional $L^2$ training. However, the underlying mechanisms of this training method remain only partially understood. In this work, we present the first rigorous theoretical framework proving that Sobolev training accelerates the convergence of Rectified Linear Unit (ReLU) networks. Under a student-teacher framework with Gaussian inputs and shallow architectures, we derive exact formulas for population gradients and Hessians, and quantify the improvements in conditioning of the loss landscape and gradient-flow convergence rates. Extensive numerical experiments validate our theoretical findings and show that the benefits of Sobolev training extend to modern deep learning tasks.', 'abstract_zh': 'Sobolev训练通过将目标导数整合到损失函数中，已被证明能加快收敛速度并提高泛化能力，相比于传统的$L^2$训练。然而，这种方法的背后机制仍部分未知。在本文中，我们首次提供了一个严格的理论框架，证明Sobolev训练能够加速Rectified Linear Unit（ReLU）网络的收敛。在具有高斯输入和浅层架构的学生-教师框架下，我们推导出了群体梯度和海森矩阵的精确公式，并量化了损失景观条件性的改进和梯度流动收敛率的提高。广泛的数值实验验证了我们的理论发现，并表明Sobolev训练的好处适用于现代深度学习任务。', 'title_zh': 'Sobolev加速度神经网络'}
{'arxiv_id': 'arXiv:2509.19771', 'title': 'Frictional Q-Learning', 'authors': 'Hyunwoo Kim, Hyo Kyung Lee', 'link': 'https://arxiv.org/abs/2509.19771', 'abstract': "We draw an analogy between static friction in classical mechanics and extrapolation error in off-policy RL, and use it to formulate a constraint that prevents the policy from drifting toward unsupported actions. In this study, we present Frictional Q-learning, a deep reinforcement learning algorithm for continuous control, which extends batch-constrained reinforcement learning. Our algorithm constrains the agent's action space to encourage behavior similar to that in the replay buffer, while maintaining a distance from the manifold of the orthonormal action space. The constraint preserves the simplicity of batch-constrained, and provides an intuitive physical interpretation of extrapolation error. Empirically, we further demonstrate that our algorithm is robustly trained and achieves competitive performance across standard continuous control benchmarks.", 'abstract_zh': '我们将经典力学中的静摩擦与离策政策RL中的外推误差类比，并利用这一类比提出一个约束条件，防止策略向不支持的动作漂移。在本研究中，我们提出摩擦Q学习算法，这是一种适用于连续控制的深度强化学习算法，扩展了批量约束强化学习。该算法约束智能体的动作空间，鼓励行为类似于回放缓冲区中的行为，同时保持与正交动作空间流形的距离。该约束保留了批量约束的简单性，并提供了对外推误差的直观物理解释。实证上，我们进一步证明了该算法具有鲁棒性，并在标准连续控制基准测试中取得了竞争性的性能。', 'title_zh': '摩擦性Q学习'}
{'arxiv_id': 'arXiv:2509.19767', 'title': 'FusedANN: Convexified Hybrid ANN via Attribute-Vector Fusion', 'authors': 'Alireza Heidari, Wei Zhang, Ying Xiong', 'link': 'https://arxiv.org/abs/2509.19767', 'abstract': 'Vector search powers transformers technology, but real-world use demands hybrid queries that combine vector similarity with attribute filters (e.g., "top document in category X, from 2023"). Current solutions trade off recall, speed, and flexibility, relying on fragile index hacks that don\'t scale. We introduce FusedANN (Fused Attribute-Vector Nearest Neighbor), a geometric framework that elevates filtering to ANN optimization constraints and introduces a convex fused space via a Lagrangian-like relaxation. Our method jointly embeds attributes and vectors through transformer-based convexification, turning hard filters into continuous, weighted penalties that preserve top-k semantics while enabling efficient approximate search. We prove that FusedANN reduces to exact filtering under high selectivity, gracefully relaxes to semantically nearest attributes when exact matches are insufficient, and preserves downstream ANN alpha-approximation guarantees. Empirically, FusedANN improves query throughput by eliminating brittle filtering stages, achieving superior recall-latency tradeoffs on standard hybrid benchmarks without specialized index hacks, delivering up to 3 times higher throughput and better recall than state-of-the-art hybrid and graph-based systems. Theoretically, we provide explicit error bounds and parameter selection rules that make FusedANN practical for production. This establishes a principled, scalable, and verifiable bridge between symbolic constraints and vector similarity, unlocking a new generation of filtered retrieval systems for large, hybrid, and dynamic NLP/ML workloads.', 'abstract_zh': '融合属性向量最近邻搜索：FusedANN及其在混合查询优化中的应用', 'title_zh': 'FusedANN：通过属性向量融合的凸优化混合ANN'}
{'arxiv_id': 'arXiv:2509.19766', 'title': 'Dynamicasome: a molecular dynamics-guided and AI-driven pathogenicity prediction catalogue for all genetic mutations', 'authors': 'Naeyma N Islam, Mathew A Coban, Jessica M Fuller, Caleb Weber, Rohit Chitale, Benjamin Jussila, Trisha J. Brock, Cui Tao, Thomas R Caulfield', 'link': 'https://arxiv.org/abs/2509.19766', 'abstract': 'Advances in genomic medicine accelerate the identi cation of mutations in disease-associated genes, but the pathogenicity of many mutations remains unknown, hindering their use in diagnostics and clinical decision-making. Predictive AI models are generated to combat this issue, but current tools display low accuracy when tested against functionally validated datasets. We show that integrating detailed conformational data extracted from molecular dynamics simulations (MDS) into advanced AI-based models increases their predictive power. We carry out an exhaustive mutational analysis of the disease gene PMM2 and subject structural models of each variant to MDS. AI models trained on this dataset outperform existing tools when predicting the known pathogenicity of mutations. Our best performing model, a neuronal networks model, also predicts the pathogenicity of several PMM2 mutations currently considered of unknown signi cance. We believe this model helps alleviate the burden of unknown variants in genomic medicine.', 'abstract_zh': '基因组医学的进步加速了与疾病相关基因突变的识别，但许多突变的致病性仍不明朗，阻碍了其在诊断和临床决策中的应用。为了解决这一问题，生成了预测AI模型，但现有工具在验证功能性数据集上的准确性较低。我们展示了一种将详细的构象数据集成到高级基于AI的模型中可以提高其预测能力的方法。我们对疾病基因PMM2进行了详尽的突变分析，并对每个变异体的结构模型进行了分子动力学模拟（MDS）。基于此数据集训练的AI模型在预测已知致病性突变方面优于现有工具。我们表现最佳的模型，神经网络模型，还能预测几个目前被认为意义不明的PMM2突变的致病性。我们相信该模型有助于减轻基因组医学中未知变异体的负担。', 'title_zh': '基于分子动力学引导和AI驱动的遗传变异致病性预测目录'}
{'arxiv_id': 'arXiv:2509.19757', 'title': 'ARCADE: A Real-Time Data System for Hybrid and Continuous Query Processing across Diverse Data Modalities', 'authors': 'Jingyi Yang, Songsong Mo, Jiachen Shi, Zihao Yu, Kunhao Shi, Xuchen Ding, Gao Cong', 'link': 'https://arxiv.org/abs/2509.19757', 'abstract': 'The explosive growth of multimodal data - spanning text, image, video, spatial, and relational modalities, coupled with the need for real-time semantic search and retrieval over these data - has outpaced the capabilities of existing multimodal and real-time database systems, which either lack efficient ingestion and continuous query capability, or fall short in supporting expressive hybrid analytics. We introduce ARCADE, a real-time data system that efficiently supports high-throughput ingestion and expressive hybrid and continuous query processing across diverse data types. ARCADE introduces unified disk-based secondary index on LSM-based storage for vector, spatial, and text data modalities, a comprehensive cost-based query optimizer for hybrid queries, and an incremental materialized view framework for efficient continuous queries. Built on open-source RocksDB storage and MySQL query engine, ARCADE outperforms leading multimodal data systems by up to 7.4x on read-heavy and 1.4x on write-heavy workloads.', 'abstract_zh': '多模态数据的爆炸性增长及其对实时语义搜索和检索的需求超出了现有多模态和实时数据库系统的能力，这些系统要么缺乏高效的摄入和连续查询能力，要么在支持表达性强的混合分析方面有所欠缺。我们提出ARCADE，这是一种能够高效支持高吞吐量数据摄入和跨多种数据类型进行表达性强的混合和连续查询处理的实时数据系统。ARCADE引入了一种适用于LSM存储的统一磁盘二级索引，用于向量、空间和文本数据模态，全面的成本基量子查询优化器，以及增量物化视图框架，以实现高效的连续查询。基于开源RocksDB存储和MySQL查询引擎，ARCADE在读密集型工作负载上性能比领先多模态数据系统高出7.4倍，在写密集型工作负载上高出1.4倍。', 'title_zh': 'ARCADE: 一种跨异构数据模态的实时数据系统，支持混合查询与连续查询处理'}
{'arxiv_id': 'arXiv:2509.19753', 'title': 'ExpFace: Exponential Angular Margin Loss for Deep Face Recognition', 'authors': 'Jinhui Zheng, Xueyuan Gong', 'link': 'https://arxiv.org/abs/2509.19753', 'abstract': 'Face recognition is an open-set problem requiring high discriminative power to ensure that intra-class distances remain smaller than inter-class distances. Margin-based softmax losses, such as SphereFace, CosFace, and ArcFace, have been widely adopted to enhance intra-class compactness and inter-class separability, yet they overlook the impact of noisy samples. By examining the distribution of samples in the angular space, we observe that clean samples predominantly cluster in the center region, whereas noisy samples tend to shift toward the peripheral region. Motivated by this observation, we propose the Exponential Angular Margin Loss (ExpFace), which introduces an angular exponential term as the margin. This design applies a larger penalty in the center region and a smaller penalty in the peripheral region within the angular space, thereby emphasizing clean samples while suppressing noisy samples. We present a unified analysis of ExpFace and classical margin-based softmax losses in terms of margin embedding forms, similarity curves, and gradient curves, showing that ExpFace not only avoids the training instability of SphereFace and the non-monotonicity of ArcFace, but also exhibits a similarity curve that applies penalties in the same manner as the decision boundary in the angular space. Extensive experiments demonstrate that ExpFace achieves state-of-the-art performance. To facilitate future research, we have released the source code at: this https URL.', 'abstract_zh': '基于指数角边际损失的面部识别（ExpFace：一种基于指数角边际损失的面部识别方法）', 'title_zh': 'ExpFace: 指数视角.margin 损失函数用于深度面部识别'}
{'arxiv_id': 'arXiv:2509.19750', 'title': 'Cuffless Blood Pressure Prediction from Speech Sentences using Deep Learning Methods', 'authors': 'Kainat', 'link': 'https://arxiv.org/abs/2509.19750', 'abstract': 'This research presents a novel method for noninvasive arterial blood pressure ABP prediction using speech signals employing a BERT based regression model Arterial blood pressure is a vital indicator of cardiovascular health and accurate monitoring is essential in preventing hypertension related complications Traditional cuff based methods often yield inconsistent results due to factors like whitecoat and masked hypertension Our approach leverages the acoustic characteristics of speech capturing voice features to establish correlations with blood pressure levels Utilizing advanced deep learning techniques we analyze speech signals to extract relevant patterns enabling real time monitoring without the discomfort of conventional methods In our study we employed a dataset comprising recordings from 95 participants ensuring diverse representation The BERT model was fine tuned on extracted features from speech leading to impressive performance metrics achieving a mean absolute error MAE of 136 mmHg for systolic blood pressure SBP and 124 mmHg for diastolic blood pressure DBP with R scores of 099 and 094 respectively These results indicate the models robustness in accurately predicting blood pressure levels Furthermore the training and validation loss analysis demonstrates effective learning and minimal overfitting Our findings suggest that integrating deep learning with speech analysis presents a viable alternative for blood pressure monitoring paving the way for improved applications in telemedicine and remote health monitoring By providing a user friendly and accurate method for blood pressure assessment this research has significant implications for enhancing patient care and proactive management of cardiovascular health', 'abstract_zh': '本研究提出了一种使用基于BERT的回归模型并通过语音信号预测无创动脉血压的新方法 动脉血压是心血管健康的重要指标，准确监测对于预防与高血压相关并发症至关重要 传统袖带方法往往因白大衣高血压和隐匿性高血压等因素导致结果不一致 我们的方法利用语音的声学特征，捕获声音特征并与血压水平建立关联 利用先进的深度学习技术，分析语音信号以提取相关模式，实现无不适的实时监测 在我们的研究中，我们使用了一个由95名参与者提供的数据集，确保了多样性的代表 总结报告的BERT模型在提取的语音特征上进行了微调，获得了出色的性能指标，收缩压SBP的平均绝对误差MAE为13.6 mmHg，舒张压DBP的MAE为12.4 mmHg，相关系数R分别为0.99和0.94 这些结果表明，该模型在准确预测血压方面具有很强的稳健性 通过训练和验证损失分析，展示了有效的学习和轻度过拟合 我们的研究结果表明，将深度学习与语音分析结合起来，为血压监测提供了一种可行的替代方案，为远程医疗和远程健康管理提供了改进的应用前景 通过提供一种用户友好且准确的血压评估方法，本研究对提高患者护理和主动管理心血管健康具有重要意义', 'title_zh': '基于深度学习方法的无袖带血压预测从语音句子出发'}
{'arxiv_id': 'arXiv:2509.19742', 'title': 'HiCoLoRA: Addressing Context-Prompt Misalignment via Hierarchical Collaborative LoRA for Zero-Shot DST', 'authors': 'Shuyu Zhang, Yifan Wei, Xinru Wang, Yanmin Zhu, Yangfan He, Yixuan Weng, Bin Li', 'link': 'https://arxiv.org/abs/2509.19742', 'abstract': 'Zero-shot Dialog State Tracking (zs-DST) is essential for enabling Task-Oriented Dialog Systems (TODs) to generalize to new domains without costly data annotation. A central challenge lies in the semantic misalignment between dynamic dialog contexts and static prompts, leading to inflexible cross-layer coordination, domain interference, and catastrophic forgetting. To tackle this, we propose Hierarchical Collaborative Low-Rank Adaptation (HiCoLoRA), a framework that enhances zero-shot slot inference through robust prompt alignment. It features a hierarchical LoRA architecture for dynamic layer-specific processing (combining lower-layer heuristic grouping and higher-layer full interaction), integrates Spectral Joint Domain-Slot Clustering to identify transferable associations (feeding an Adaptive Linear Fusion Mechanism), and employs Semantic-Enhanced SVD Initialization (SemSVD-Init) to preserve pre-trained knowledge. Experiments on multi-domain datasets MultiWOZ and SGD show that HiCoLoRA outperforms baselines, achieving SOTA in zs-DST. Code is available at this https URL.', 'abstract_zh': '零样本对话状态跟踪（zs-DST）对于使面向任务的对话系统（TODs）能够在无需昂贵数据标注的情况下泛化到新领域至关重要。该方法的关键挑战在于动态对话上下文与静态提示之间的语义不匹配，导致跨层协调僵化、领域干扰和灾难性遗忘。为此，我们提出了一种分层协作低秩适应（HiCoLoRA）框架，该框架通过稳健的提示对齐来增强零样本插槽推理。该框架包含一种分层LoRA架构，进行动态层特定处理（结合下层启发式分组和上层全方位交互）、整合光谱联合领域-插槽聚类以识别可转移的关联（为自适应线性融合机制提供支持）以及采用语义增强SVD初始化（SemSVD-Init）以保留预训练知识。在多领域数据集MultiWOZ和SGD上的实验表明，HiCoLoRA在零样本对话状态跟踪（zs-DST）中优于基线方法，达到最佳效果。代码见此链接。', 'title_zh': 'HiCoLoRA：通过分层协作LoRA解决上下文提示不匹配问题的零样本对话状态跟踪'}
{'arxiv_id': 'arXiv:2509.19715', 'title': 'SMILES-Inspired Transfer Learning for Quantum Operators in Generative Quantum Eigensolver', 'authors': 'Zhi Yin, Xiaoran Li, Shengyu Zhang, Xin Li, Xiaojin Zhang', 'link': 'https://arxiv.org/abs/2509.19715', 'abstract': 'Given the inherent limitations of traditional Variational Quantum Eigensolver(VQE) algorithms, the integration of deep generative models into hybrid quantum-classical frameworks, specifically the Generative Quantum Eigensolver(GQE), represents a promising innovative approach. However, taking the Unitary Coupled Cluster with Singles and Doubles(UCCSD) ansatz which is widely used in quantum chemistry as an example, different molecular systems require constructions of distinct quantum operators. Considering the similarity of different molecules, the construction of quantum operators utilizing the similarity can reduce the computational cost significantly. Inspired by the SMILES representation method in computational chemistry, we developed a text-based representation approach for UCCSD quantum operators by leveraging the inherent representational similarities between different molecular systems. This framework explores text pattern similarities in quantum operators and employs text similarity metrics to establish a transfer learning framework. Our approach with a naive baseline setting demonstrates knowledge transfer between different molecular systems for ground-state energy calculations within the GQE paradigm. This discovery offers significant benefits for hybrid quantum-classical computation of molecular ground-state energies, substantially reducing computational resource requirements.', 'abstract_zh': '基于深度生成模型的生成量子本征值求解器在混合量子-经典框架中的应用：利用分子相似性减少量子操作构造成本', 'title_zh': '基于SMILES的转移学习在生成型量子本证求解器中的应用'}
{'arxiv_id': 'arXiv:2509.19708', 'title': "Intuition to Evidence: Measuring AI's True Impact on Developer Productivity", 'authors': 'Anand Kumar, Vishal Khare, Deepak Sharma, Satyam Kumar, Vijay Saini, Anshul Yadav, Sachendra Jain, Ankit Rana, Pratham Verma, Vaibhav Meena, Avinash Edubilli', 'link': 'https://arxiv.org/abs/2509.19708', 'abstract': 'We present a comprehensive real-world evaluation of AI-assisted software development tools deployed at enterprise scale. Over one year, 300 engineers across multiple teams integrated an in-house AI platform (DeputyDev) that combines code generation and automated review capabilities into their daily workflows. Through rigorous cohort analysis, our study demonstrates statistically significant productivity improvements, including an overall 31.8% reduction in PR review cycle time.\nDeveloper adoption was strong, with 85% satisfaction for code review features and 93% expressing a desire to continue using the platform. Adoption patterns showed systematic scaling from 4% engagement in month 1 to 83% peak usage by month 6, stabilizing at 60% active engagement. Top adopters achieved a 61% increase in code volume pushed to production, contributing to approximately 30 to 40% of code shipped to production through this tool, accounting for an overall 28% increase in code shipment volume.\nUnlike controlled benchmark evaluations, our longitudinal analysis provides empirical evidence from production environments, revealing both the transformative potential and practical deployment challenges of integrating AI into enterprise software development workflows.', 'abstract_zh': '我们对企业规模部署的AI辅助软件开发工具进行了全面的实际评价。在一年的时间里，多个团队中的300名工程师整合了一个内部AI平台（DeputyDev），该平台结合了代码生成和自动化审查能力，应用于日常工作中。通过严格的群体分析，我们的研究证明了统计上显著的生产力提升，包括总体上将代码审查循环时间减少了31.8%。开发者对代码审查功能的采用率很高，85%的开发者表示满意，并希望继续使用该平台。采用模式显示了系统化的规模化，从第一个月的4%参与度增加到第六个月的83%峰值使用率，稳定在60%的活跃参与度。主要采用者将代码推送至生产环境的数量增加了61%，并通过该工具贡献了约30%到40%的代码，导致整体代码推送量增加了28%。与受控基准评估不同，我们的 longitudinal 分析提供了来自生产环境的实证证据，揭示了将AI整合到企业软件开发工作流中具有变革性的潜力及其实际部署挑战。', 'title_zh': '直觉到证据：衡量AI对开发者 productivity 的真正影响'}
{'arxiv_id': 'arXiv:2509.19705', 'title': 'Causal Machine Learning for Surgical Interventions', 'authors': 'J. Ben Tamo, Nishant S. Chouhan, Micky C. Nnamdi, Yining Yuan, Shreya S. Chivilkar, Wenqi Shi, Steven W. Hwang, B. Randall Brenn, May D. Wang', 'link': 'https://arxiv.org/abs/2509.19705', 'abstract': 'Surgical decision-making is complex and requires understanding causal relationships between patient characteristics, interventions, and outcomes. In high-stakes settings like spinal fusion or scoliosis correction, accurate estimation of individualized treatment effects (ITEs) remains limited due to the reliance on traditional statistical methods that struggle with complex, heterogeneous data. In this study, we develop a multi-task meta-learning framework, X-MultiTask, for ITE estimation that models each surgical decision (e.g., anterior vs. posterior approach, surgery vs. no surgery) as a distinct task while learning shared representations across tasks. To strengthen causal validity, we incorporate the inverse probability weighting (IPW) into the training objective. We evaluate our approach on two datasets: (1) a public spinal fusion dataset (1,017 patients) to assess the effect of anterior vs. posterior approaches on complication severity; and (2) a private AIS dataset (368 patients) to analyze the impact of posterior spinal fusion (PSF) vs. non-surgical management on patient-reported outcomes (PROs). Our model achieves the highest average AUC (0.84) in the anterior group and maintains competitive performance in the posterior group (0.77). It outperforms baselines in treatment effect estimation with the lowest overall $\\epsilon_{\\text{NN-PEHE}}$ (0.2778) and $\\epsilon_{\\text{ATE}}$ (0.0763). Similarly, when predicting PROs in AIS, X-MultiTask consistently shows superior performance across all domains, with $\\epsilon_{\\text{NN-PEHE}}$ = 0.2551 and $\\epsilon_{\\text{ATE}}$ = 0.0902. By providing robust, patient-specific causal estimates, X-MultiTask offers a powerful tool to advance personalized surgical care and improve patient outcomes. The code is available at this https URL.', 'abstract_zh': '多任务元学习框架X-MultiTask在个体治疗效果估计中的应用', 'title_zh': '因果机器学习在手术干预中的应用'}
{'arxiv_id': 'arXiv:2509.19702', 'title': 'Linear Transformers Implicitly Discover Unified Numerical Algorithms', 'authors': 'Patrick Lutz, Aditya Gangrade, Hadi Daneshmand, Venkatesh Saligrama', 'link': 'https://arxiv.org/abs/2509.19702', 'abstract': 'We train a linear attention transformer on millions of masked-block matrix completion tasks: each prompt is masked low-rank matrix whose missing block may be (i) a scalar prediction target or (ii) an unseen kernel slice of Nyström extrapolation. The model sees only input-output pairs and a mean-squared loss; it is given no normal equations, no handcrafted iterations, and no hint that the tasks are related. Surprisingly, after training, algebraic unrolling reveals the same parameter-free update rule across three distinct computational regimes (full visibility, rank-limited updates, and distributed computation). We prove that this rule achieves second-order convergence on full-batch problems, cuts distributed iteration complexity, and remains accurate with rank-limited attention. Thus, a transformer trained solely to patch missing blocks implicitly discovers a unified, resource-adaptive iterative solver spanning prediction, estimation, and Nyström extrapolation, highlighting a powerful capability of in-context learning.', 'abstract_zh': '我们训练了一个线性注意变换器在数百万个遮蔽块矩阵完成任务上：每个提示是一个被遮蔽的低秩矩阵，其缺失的块可能是（i）一个标量预测目标或（ii）Nyström外推的未见内核切片。模型仅看到输入-输出对和均方损失；它没有得到正规方程、手工设计的迭代步骤，也没有被告知这些任务是相关的。令人惊讶的是，训练后，代数展开揭示了三个不同的计算范式（全视图、秩受限更新和分布式计算）下相同的无参数更新规则。我们证明，在批量问题上，该规则实现了二阶收敛，在分布式迭代复杂性上进行了削减，并能够使用秩受限注意保持准确性。因此，仅用于修补缺失块的变换器隐式发现了一个统一的、资源自适应的迭代求解器，适用于预测、估计和Nyström外推，突显了上下文学习的强大能力。', 'title_zh': '线性变压器隐式发现统一数值算法'}
{'arxiv_id': 'arXiv:2509.19698', 'title': 'A Unified Noise-Curvature View of Loss of Trainability', 'authors': 'Gunbir Singh Baveja, Mark Schmidt', 'link': 'https://arxiv.org/abs/2509.19698', 'abstract': 'Loss of trainability (LoT) in continual learning occurs when gradient steps no longer yield improvement as tasks evolve, so accuracy stalls or degrades despite adequate capacity and supervision. We analyze LoT incurred with Adam through an optimization lens and find that single indicators such as Hessian rank, sharpness level, weight or gradient norms, gradient-to-parameter ratios, and unit-sign entropy are not reliable predictors. Instead we introduce two complementary criteria: a batch-size-aware gradient-noise bound and a curvature volatility-controlled bound that combine into a per-layer predictive threshold that anticipates trainability behavior. Using this threshold, we build a simple per-layer scheduler that keeps each layers effective step below a safe limit, stabilizing training and improving accuracy across concatenated ReLU (CReLU), Wasserstein regularization, and L2 weight decay, with learned learning-rate trajectories that mirror canonical decay.', 'abstract_zh': '连续学习中训练能力的丧失（Loss of Trainability，LoT）发生在随任务演进梯度步长不再带来改善的情况下，因此准确度停滞或恶化，尽管具有足够的能力和监督。通过优化视角分析Adam引起的训练能力丧失，我们发现单一指标如海森矩阵秩、尖度水平、权重或梯度范数、梯度-参数比以及单位符号熵不可靠。相反，我们引入了两个互补的标准：批量大小感知的梯度噪声界限和曲率波动控制界限，它们结合成每层预测阈值，以预见训练能力行为。利用该阈值，我们构建了一个简单的每层调度器，使每层的有效步骤保持在安全限制以下，稳定训练并提高跨ReLU、Wasserstein正则化和L2权重衰减的准确度，伴随学习率轨迹模仿标准衰减。', 'title_zh': '统一的噪声-曲率视角下的训练可学性丧失'}
{'arxiv_id': 'arXiv:2509.19695', 'title': 'DyBBT: Dynamic Balance via Bandit inspired Targeting for Dialog Policy with Cognitive Dual-Systems', 'authors': 'Shuyu Zhang, Yifan Wei, Jialuo Yuan, Xinru Wang, Yanmin Zhu, Bin Li', 'link': 'https://arxiv.org/abs/2509.19695', 'abstract': 'Task oriented dialog systems often rely on static exploration strategies that do not adapt to dynamic dialog contexts, leading to inefficient exploration and suboptimal performance. We propose DyBBT, a novel dialog policy learning framework that formalizes the exploration challenge through a structured cognitive state space capturing dialog progression, user uncertainty, and slot dependency. DyBBT proposes a bandit inspired meta-controller that dynamically switches between a fast intuitive inference (System 1) and a slow deliberative reasoner (System 2) based on real-time cognitive states and visitation counts. Extensive experiments on single- and multi-domain benchmarks show that DyBBT achieves state-of-the-art performance in success rate, efficiency, and generalization, with human evaluations confirming its decisions are well aligned with expert judgment. Code is available at this https URL.', 'abstract_zh': '面向任务的对话系统 often 依赖于静态探索策略，这些策略不能适应动态对话上下文，导致探索效率低下和性能不佳。我们提出了 DyBBT，一种通过结构化认知状态空间形式化探索挑战的新对话策略学习框架，该空间捕获对话进程、用户不确定性以及槽位依赖关系。DyBBT 建议了一个基于多臂bandit的元控制器，该控制器根据实时认知状态和访问次数动态切换快速直观推理（系统1）和缓慢的详细推理器（系统2）。在单域和多域基准测试中的 extensive 实验显示，DyBBT 在成功率、效率和泛化能力方面均达到最新水平，人类评估进一步证实其决策与专家判断高度一致。代码可在以下链接获取：this https URL。', 'title_zh': 'DyBBT：基于 bandit 启发式目标的认知双系统对话策略动态平衡方法'}
{'arxiv_id': 'arXiv:2509.19676', 'title': 'Thinking While Listening: Simple Test Time Scaling For Audio Classification', 'authors': 'Prateek Verma, Mert Pilanci', 'link': 'https://arxiv.org/abs/2509.19676', 'abstract': 'We propose a framework that enables neural models to "think while listening" to everyday sounds, thereby enhancing audio classification performance. Motivated by recent advances in the reasoning capabilities of large language models, we address two central questions: (i) how can thinking be incorporated into existing audio classification pipelines to enable reasoning in the category space and improve performance, and (ii) can a new architecture be designed from the ground up to support both thinking and test-time scaling? We demonstrate that in both settings, our models exhibit improved classification accuracy. Leveraging test-time scaling, we observe consistent gains as the number of sampled traces increases. Furthermore, we evaluate two open-source reasoning models, GPT-OSS-20B and Qwen3-14B, showing that while such models are capable of zero-shot reasoning, a lightweight approach--retraining only the embedding matrix of a frozen, smaller model like GPT-2--can surpass the performance of billion-parameter text-based reasoning models.', 'abstract_zh': '我们提出了一种框架，使神经模型能够在聆听日常声音时进行“思考”，从而提高音频分类性能。受大型语言模型推理能力近期进展的启发，我们探讨了两个核心问题：(i) 如何将“思考”纳入现有的音频分类管道中，以在类别空间中进行推理并提高性能，以及(ii) 是否可以从头开始设计一种新的架构，以支持同时进行“思考”和测试时的扩展？我们证明，在这两种设置下，我们的模型都显示出了改进的分类准确性。利用测试时的扩展，我们观察到，随着采样轨迹数量的增加，持续观察到性能改进。此外，我们评估了两个开源推理模型GPT-OSS-20B和Qwen3-14B，结果显示，虽然这些模型能够进行零样本推理，但一种轻量级的方法——仅重新训练冻结的小型模型（如GPT-2）的嵌入矩阵——可以超越基于数十亿参数文本的推理模型的性能。', 'title_zh': '思考while倾听：简单的测试时延调整方法用于音频分类'}
{'arxiv_id': 'arXiv:2509.19669', 'title': 'Games Are Not Equal: Classifying Cloud Gaming Contexts for Effective User Experience Measurement', 'authors': 'Yifan Wang, Minzhao Lyu, Vijay Sivaraman', 'link': 'https://arxiv.org/abs/2509.19669', 'abstract': 'To tap into the growing market of cloud gaming, whereby game graphics is rendered in the cloud and streamed back to the user as a video feed, network operators are creating monetizable assurance services that dynamically provision network resources. However, without accurately measuring cloud gaming user experience, they cannot assess the effectiveness of their provisioning methods. Basic measures such as bandwidth and frame rate by themselves do not suffice, and can only be interpreted in the context of the game played and the player activity within the game. This paper equips the network operator with a method to obtain a real-time measure of cloud gaming experience by analyzing network traffic, including contextual factors such as the game title and player activity stage. Our method is able to classify the game title within the first five seconds of game launch, and continuously assess the player activity stage as being active, passive, or idle. We deploy it in an ISP hosting NVIDIA cloud gaming servers for the region. We provide insights from hundreds of thousands of cloud game streaming sessions over a three-month period into the dependence of bandwidth consumption and experience level on the gameplay contexts.', 'abstract_zh': '利用网络流量分析方法实时评估云游戏体验：基于游戏标题和玩家活动阶段的分类方法', 'title_zh': '游戏并非平等：基于有效用户体验测量的游戏云环境分类'}
{'arxiv_id': 'arXiv:2509.19668', 'title': 'Selective Classifier-free Guidance for Zero-shot Text-to-speech', 'authors': 'John Zheng, Farhad Maleki', 'link': 'https://arxiv.org/abs/2509.19668', 'abstract': 'In zero-shot text-to-speech, achieving a balance between fidelity to the target speaker and adherence to text content remains a challenge. While classifier-free guidance (CFG) strategies have shown promising results in image generation, their application to speech synthesis are underexplored. Separating the conditions used for CFG enables trade-offs between different desired characteristics in speech synthesis. In this paper, we evaluate the adaptability of CFG strategies originally developed for image generation to speech synthesis and extend separated-condition CFG approaches for this domain. Our results show that CFG strategies effective in image generation generally fail to improve speech synthesis. We also find that we can improve speaker similarity while limiting degradation of text adherence by applying standard CFG during early timesteps and switching to selective CFG only in later timesteps. Surprisingly, we observe that the effectiveness of a selective CFG strategy is highly text-representation dependent, as differences between the two languages of English and Mandarin can lead to different results even with the same model.', 'abstract_zh': '零样本文本到语音合成中，如何在忠于目标说话人和遵循文本内容之间取得平衡仍然是一个挑战。尽管无分类器引导（CFG）策略在图像生成中显示出有前景的结果，但其在语音合成中的应用仍待探索。通过对用于CFG的条件进行分离，可以在语音合成中实现不同期望特征之间的权衡。在本文中，我们评估了最初为图像生成设计的CFG策略在语音合成中的适应性，并扩展了分离条件的CFG方法适用于此领域。我们的结果表明，有效的CFG策略通常无法改善语音合成。我们还发现，在早期时间步长应用标准CFG，并在后期时间步长切换为选择性CFG，可以在限制文本一致性退化的同时改善说话人相似度。令人惊讶的是，我们观察到选择性CFG策略的有效性高度依赖于文本表示，不同语言（如英语和 Mandarin）之间的差异即使在相同模型下也会导致不同结果。', 'title_zh': '零样本文本到语音的选择性无分类器引导'}
{'arxiv_id': 'arXiv:2509.19664', 'title': 'MoTiC: Momentum Tightness and Contrast for Few-Shot Class-Incremental Learning', 'authors': 'Zeyu He, Shuai Huang, Yuwu Lu, Ming Zhao', 'link': 'https://arxiv.org/abs/2509.19664', 'abstract': "Few-Shot Class-Incremental Learning (FSCIL) must contend with the dual challenge of learning new classes from scarce samples while preserving old class knowledge. Existing methods use the frozen feature extractor and class-averaged prototypes to mitigate against catastrophic forgetting and overfitting. However, new-class prototypes suffer significant estimation bias due to extreme data scarcity, whereas base-class prototypes benefit from sufficient data. In this work, we theoretically demonstrate that aligning the new-class priors with old-class statistics via Bayesian analysis reduces variance and improves prototype accuracy. Furthermore, we propose large-scale contrastive learning to enforce cross-category feature tightness. To further enrich feature diversity and inject prior information for new-class prototypes, we integrate momentum self-supervision and virtual categories into the Momentum Tightness and Contrast framework (MoTiC), constructing a feature space with rich representations and enhanced interclass cohesion. Experiments on three FSCIL benchmarks produce state-of-the-art performances, particularly on the fine-grained task CUB-200, validating our method's ability to reduce estimation bias and improve incremental learning robustness.", 'abstract_zh': 'Few-Shot Class-Incremental Learning via Bayesian Analysis and Large-Scale Contrastive Learning', 'title_zh': 'MoTiC: 动量紧致性和对比度在少量样本类别增量学习中的应用'}
{'arxiv_id': 'arXiv:2509.19646', 'title': 'Where 6G Stands Today: Evolution, Enablers, and Research Gaps', 'authors': 'Salma Tika, Abdelkrim Haqiq, Essaid Sabir, Elmahdi Driouch', 'link': 'https://arxiv.org/abs/2509.19646', 'abstract': 'As the fifth-generation (5G) mobile communication system continues its global deployment, both industry and academia have started conceptualizing the 6th generation (6G) to address the growing need for a progressively advanced and digital society. Even while 5G offers considerable advancements over LTE, it could struggle to be sufficient to meet all of the requirements, including ultra-high reliability, seamless automation, and ubiquitous coverage. In response, 6G is supposed to bring out a highly intelligent, automated, and ultra-reliable communication system that can handle a vast number of connected devices. This paper offers a comprehensive overview of 6G, beginning with its main stringent requirements while focusing on key enabling technologies such as terahertz (THz) communications, intelligent reflecting surfaces, massive MIMO and AI-driven networking that will shape the 6G networks. Furthermore, the paper lists various 6G applications and usage scenarios that will benefit from these advancements. At the end, we outline the potential challenges that must be addressed to achieve the 6G promises.', 'abstract_zh': '随着第五代（5G）移动通信系统的全球部署继续进行，产业和学术界已经开始构想第六代（6G）通信系统，以应对日益复杂和数字化社会的需求。尽管5G相比LTE提供了显著的进步，但在超高的可靠性和无缝自动化等方面可能仍然难以满足所有需求。为此，6G旨在构建一个高度智能化、自动化和 ultra-reliable 的通信系统，能够处理大量连接设备。本文提供了对6G的全面概述，重点介绍了其主要严格的规范要求，并着重讨论了太赫兹（THz）通信、智能反射表面、大规模MIMO和基于AI的网络等关键技术，这些技术将塑造6G网络。此外，本文还列出了将受益于这些进步的各种6G应用和使用场景。最后，我们概述了实现6G承诺时可能需要应对的潜在挑战。', 'title_zh': '当前6G的发展状况：演进、使能技术与研究空白'}
{'arxiv_id': 'arXiv:2509.19599', 'title': 'Knowledge Base-Aware Orchestration: A Dynamic, Privacy-Preserving Method for Multi-Agent Systems', 'authors': 'Danilo Trombino, Vincenzo Pecorella, Alessandro de Giulii, Davide Tresoldi', 'link': 'https://arxiv.org/abs/2509.19599', 'abstract': "Multi-agent systems (MAS) are increasingly tasked with solving complex, knowledge-intensive problems where effective agent orchestration is critical. Conventional orchestration methods rely on static agent descriptions, which often become outdated or incomplete. This limitation leads to inefficient task routing, particularly in dynamic environments where agent capabilities continuously evolve. We introduce Knowledge Base-Aware (KBA) Orchestration, a novel approach that augments static descriptions with dynamic, privacy-preserving relevance signals derived from each agent's internal knowledge base (KB). In the proposed framework, when static descriptions are insufficient for a clear routing decision, the orchestrator prompts the subagents in parallel. Each agent then assesses the task's relevance against its private KB, returning a lightweight ACK signal without exposing the underlying data. These collected signals populate a shared semantic cache, providing dynamic indicators of agent suitability for future queries. By combining this novel mechanism with static descriptions, our method achieves more accurate and adaptive task routing preserving agent autonomy and data confidentiality. Benchmarks show that our KBA Orchestration significantly outperforms static description-driven methods in routing precision and overall system efficiency, making it suitable for large-scale systems that require higher accuracy than standard description-driven routing.", 'abstract_zh': '基于知识库意识的多-agent系统编排', 'title_zh': '知识库意识型编排：多智能体系统的动态隐私保护方法'}
{'arxiv_id': 'arXiv:2509.19586', 'title': 'A Foundation Chemical Language Model for Comprehensive Fragment-Based Drug Discovery', 'authors': 'Alexander Ho, Sukyeong Lee, Francis T.F. Tsai', 'link': 'https://arxiv.org/abs/2509.19586', 'abstract': 'We introduce FragAtlas-62M, a specialized foundation model trained on the largest fragment dataset to date. Built on the complete ZINC-22 fragment subset comprising over 62 million molecules, it achieves unprecedented coverage of fragment chemical space. Our GPT-2 based model (42.7M parameters) generates 99.90% chemically valid fragments. Validation across 12 descriptors and three fingerprint methods shows generated fragments closely match the training distribution (all effect sizes < 0.4). The model retains 53.6% of known ZINC fragments while producing 22% novel structures with practical relevance. We release FragAtlas-62M with training code, preprocessed data, documentation, and model weights to accelerate adoption.', 'abstract_zh': '我们介绍FragAtlas-62M，这是一种专门训练于迄今最大片段数据集的基础模型。基于完整的ZINC-22片段子集（包含超过62百万吨子分子），该模型实现了前所未有的片段化学空间覆盖范围。基于GPT-2的模型（42.7M参数）生成了99.90%的化学有效的片段。在12个描述符和三种指纹方法的验证中，生成的片段与训练分布高度一致（所有效应大小<0.4）。该模型保留了53.6%已知的ZINC片段，同时生成了具有实际意义的22%的新结构。我们发布了FragAtlas-62M的训练代码、预处理数据、文档和模型权重，以加速其应用。', 'title_zh': '全面片段基于药物发现的基础化学语言模型'}
{'arxiv_id': 'arXiv:2509.19554', 'title': 'Learning Dynamics of Deep Learning -- Force Analysis of Deep Neural Networks', 'authors': 'Yi Ren', 'link': 'https://arxiv.org/abs/2509.19554', 'abstract': "This thesis explores how deep learning models learn over time, using ideas inspired by force analysis. Specifically, we zoom in on the model's training procedure to see how one training example affects another during learning, like analyzing how forces move objects. We break this influence into two parts: how similar the two examples are, and how strong the updating force is. This framework helps us understand a wide range of the model's behaviors in different real systems. For example, it explains why certain examples have non-trivial learning paths, why (and why not) some LLM finetuning methods work, and why simpler, more structured patterns tend to be learned more easily. We apply this approach to various learning tasks and uncover new strategies for improving model training. While the method is still developing, it offers a new way to interpret models' behaviors systematically.", 'abstract_zh': '基于力分析思想探索深度学习模型随时间的学习机制', 'title_zh': '深度学习的学习动力学——深度神经网络的力分析'}
{'arxiv_id': 'arXiv:2509.19515', 'title': 'A Longitudinal Randomized Control Study of Companion Chatbot Use: Anthropomorphism and Its Mediating Role on Social Impacts', 'authors': 'Rose E. Guingrich, Michael S. A. Graziano', 'link': 'https://arxiv.org/abs/2509.19515', 'abstract': "Relationships with social artificial intelligence (AI) agents are on the rise. People report forming friendships, mentorships, and romantic partnerships with chatbots such as Replika, a type of social AI agent that is designed specifically for companionship. Concerns that companion chatbot relationships may harm or replace human ones have been raised, but whether and how these social consequences occur remains unclear. Prior research suggests that people's states of social need and their anthropomorphism of the AI agent may play a role in how human-AI interaction impacts human-human interaction. In this longitudinal study (N = 183), participants were randomly assigned to converse with a companion chatbot over text or to play text-based word games for 10 minutes a day for 21 consecutive days. During these 21 days, participants also completed four surveys and two audio-recorded interviews. We found that people's social health and relationships were not significantly impacted by interacting with a companion chatbot across 21 days compared to the control group. However, people who had a higher desire to socially connect anthropomorphized the chatbot more. Those who anthropomorphized the chatbot more indicated that the human-chatbot interaction had greater impacts on their social interactions and relationships with family and friends. A mediation analysis suggested that the impact of human-AI interaction on human-human social outcomes was mediated by the extent to which people anthropomorphized the AI agent, which itself was related to the desire to socially connect.", 'abstract_zh': '伴随社会人工智能代理的关系正在兴起：以Replika为代表的伴侣聊天机器人对人类关系的Impact及其介导机制研究', 'title_zh': '同伴聊天机器人使用的时间序列随机对照研究：拟人化及其在社会影响中的调节作用'}
{'arxiv_id': 'arXiv:2509.19512', 'title': 'The Heterogeneous Multi-Agent Challenge', 'authors': 'Charles Dansereau, Junior-Samuel Lopez-Yepez, Karthik Soma, Antoine Fagette', 'link': 'https://arxiv.org/abs/2509.19512', 'abstract': 'Multi-Agent Reinforcement Learning (MARL) is a growing research area which gained significant traction in recent years, extending Deep RL applications to a much wider range of problems. A particularly challenging class of problems in this domain is Heterogeneous Multi-Agent Reinforcement Learning (HeMARL), where agents with different sensors, resources, or capabilities must cooperate based on local information. The large number of real-world situations involving heterogeneous agents makes it an attractive research area, yet underexplored, as most MARL research focuses on homogeneous agents (e.g., a swarm of identical robots). In MARL and single-agent RL, standardized environments such as ALE and SMAC have allowed to establish recognized benchmarks to measure progress. However, there is a clear lack of such standardized testbed for cooperative HeMARL. As a result, new research in this field often uses simple environments, where most algorithms perform near optimally, or uses weakly heterogeneous MARL environments.', 'abstract_zh': '多代理强化学习（MARL）是近年来迅速发展的研究领域，将深度强化学习（Deep RL）的应用扩展到更广泛的问题。此领域中一个尤其具有挑战性的问题类别是异构多代理强化学习（HeMARL），其中具有不同传感器、资源或能力的代理基于局部信息进行合作。由于涉及异构代理的实际应用场景众多，这使得它成为一个很有吸引力但尚未深入探索的研究领域，因为大多数MARL研究主要集中在同质代理（例如一群彼此相同机器人）上。在MARL和单代理强化学习中，标准化环境如ALE和SMAC使得建立公认的基准以衡量进展成为可能。然而，对于合作型HeMARL，缺乏这样的标准化测试平台。因此，该领域的研究成果往往使用简单的环境，大多数算法在这种环境中能接近最优表现，或者使用弱异质的MARL环境。', 'title_zh': '异质多智能体挑战'}
{'arxiv_id': 'arXiv:2509.19509', 'title': 'AIRwaves at CheckThat! 2025: Retrieving Scientific Sources for Implicit Claims on Social Media with Dual Encoders and Neural Re-Ranking', 'authors': 'Cem Ashbaugh, Leon Baumgärtner, Tim Gress, Nikita Sidorov, Daniel Werner', 'link': 'https://arxiv.org/abs/2509.19509', 'abstract': 'Linking implicit scientific claims made on social media to their original publications is crucial for evidence-based fact-checking and scholarly discourse, yet it is hindered by lexical sparsity, very short queries, and domain-specific language. Team AIRwaves ranked second in Subtask 4b of the CLEF-2025 CheckThat! Lab with an evidence-retrieval approach that markedly outperforms the competition baseline. The optimized sparse-retrieval baseline(BM25) achieves MRR@5 = 0.5025 on the gold label blind test set. To surpass this baseline, a two-stage retrieval pipeline is introduced: (i) a first stage that uses a dual encoder based on E5-large, fine-tuned using in-batch and mined hard negatives and enhanced through chunked tokenization and rich document metadata; and (ii) a neural re-ranking stage using a SciBERT cross-encoder. Replacing purely lexical matching with neural representations lifts performance to MRR@5 = 0.6174, and the complete pipeline further improves to MRR@5 = 0.6828. The findings demonstrate that coupling dense retrieval with neural re-rankers delivers a powerful and efficient solution for tweet-to-study matching and provides a practical blueprint for future evidence-retrieval pipelines.', 'abstract_zh': '将社交媒体上隐含的科学断言与其原始出版物链接对于基于证据的事实核查和学术讨论至关重要，但这一过程受到词汇稀疏性、非常短的查询和领域特定语言的阻碍。Team AIRwaves 在 CLEF-2025 CheckThat! Lab 的 Subtask 4b 中凭借证据检索方法获得第二名，该方法显著优于竞争 baseline。优化的稀疏检索 baseline（BM25）在黄金标签盲测试集上达到 MRR@5 = 0.5025。为了超越这一 baseline，引入了一种两阶段检索管道：（i）第一阶段使用基于 E5-large 的双编码器，采用批次内和挖掘的难以负样本进行微调，并通过分块令牌化和丰富的文档元数据进行增强；以及（ii）神经再排序阶段使用 SciBERT 混合编码器。用神经表示替换纯词典匹配将性能提升到 MRR@5 = 0.6174，完整管道进一步提高到 MRR@5 = 0.6828。研究结果表明，结合密集检索和神经再排序器为推文与研究匹配提供了强大而高效的解决方案，并为未来证据检索管道提供了实用的蓝图。', 'title_zh': 'AIRwaves在CheckThat! 2025: 使用双编码器和神经重排序检索社交媒体中的隐含声明科学来源'}
{'arxiv_id': 'arXiv:2509.19497', 'title': 'Generative AI as a catalyst for democratic Innovation: Enhancing citizen engagement in participatory budgeting', 'authors': 'Italo Alberto do Nascimento Sousa, Jorge Machado, Jose Carlos Vaz', 'link': 'https://arxiv.org/abs/2509.19497', 'abstract': 'This research examines the role of Generative Artificial Intelligence (AI) in enhancing citizen engagement in participatory budgeting. In response to challenges like declining civic participation and increased societal polarization, the study explores how online political participation can strengthen democracy and promote social equity. By integrating Generative AI into public consultation platforms, the research aims to improve citizen proposal formulation and foster effective dialogue between citizens and government. It assesses the capacities governments need to implement AI-enhanced participatory tools, considering technological dependencies and vulnerabilities. Analyzing technological structures, actors, interests, and strategies, the study contributes to understanding how technological advancements can reshape participatory institutions to better facilitate citizen involvement. Ultimately, the research highlights how Generative AI can transform participatory institutions, promoting inclusive, democratic engagement and empowering citizens.', 'abstract_zh': '这项研究探讨了生成型人工智能（AI）在增强公民在参与式预算中参与作用中的角色。面对如公民参与下降和社会极化加剧等挑战，研究探索了在线政治参与如何强化民主并促进社会公平。通过将生成型AI整合到公众咨询平台中，研究旨在改进公民提案的形成并促进公民与政府之间的有效对话。研究评估了政府实施增强型参与工具所需的能力，考虑了技术依赖性和脆弱性。通过对技术和结构、行动者、利益和策略的分析，研究为理解技术进步如何重塑参与机构以更好地促进公民参与提供了见解。最终，研究突出了生成型AI如何转变参与机构，促进包容性的民主参与并赋能公民。', 'title_zh': 'Generative AI作为民主创新的催化剂：增强公民参与式预算中的参与程度'}
{'arxiv_id': 'arXiv:2509.19495', 'title': 'ArtiFree: Detecting and Reducing Generative Artifacts in Diffusion-based Speech Enhancement', 'authors': 'Bhawana Chhaglani, Yang Gao, Julius Richter, Xilin Li, Syavosh Zadissa, Tarun Pruthi, Andrew Lovitt', 'link': 'https://arxiv.org/abs/2509.19495', 'abstract': 'Diffusion-based speech enhancement (SE) achieves natural-sounding speech and strong generalization, yet suffers from key limitations like generative artifacts and high inference latency. In this work, we systematically study artifact prediction and reduction in diffusion-based SE. We show that variance in speech embeddings can be used to predict phonetic errors during inference. Building on these findings, we propose an ensemble inference method guided by semantic consistency across multiple diffusion runs. This technique reduces WER by 15% in low-SNR conditions, effectively improving phonetic accuracy and semantic plausibility. Finally, we analyze the effect of the number of diffusion steps, showing that adaptive diffusion steps balance artifact suppression and latency. Our findings highlight semantic priors as a powerful tool to guide generative SE toward artifact-free outputs.', 'abstract_zh': '基于扩散的语音增强中的噪声与延迟权衡研究', 'title_zh': 'ArtiFree：检测与减少基于扩散的语音增强中的生成性-artifacts'}
{'arxiv_id': 'arXiv:2509.19465', 'title': 'A Realistic Evaluation of Cross-Frequency Transfer Learning and Foundation Forecasting Models', 'authors': 'Kin G. Olivares, Malcolm Wolff, Tatiana Konstantinova, Shankar Ramasubramanian, Andrew Gordon Wilson, Andres Potapczynski, Willa Potosnak, Mengfei Cao, Boris Oreshkin, Dmitry Efimov', 'link': 'https://arxiv.org/abs/2509.19465', 'abstract': "Cross-frequency transfer learning (CFTL) has emerged as a popular framework for curating large-scale time series datasets to pre-train foundation forecasting models (FFMs). Although CFTL has shown promise, current benchmarking practices fall short of accurately assessing its performance. This shortcoming stems from many factors: an over-reliance on small-scale evaluation datasets; inadequate treatment of sample size when computing summary statistics; reporting of suboptimal statistical models; and failing to account for non-negligible risks of overlap between pre-training and test datasets. To address these limitations, we introduce a unified reimplementation of widely-adopted neural forecasting networks, adapting them for the CFTL setup; we pre-train only on proprietary and synthetic data, being careful to prevent test leakage; and we evaluate on 15 large, diverse public forecast competition datasets. Our empirical analysis reveals that statistical models' accuracy is frequently underreported. Notably, we confirm that statistical models and their ensembles consistently outperform existing FFMs by more than 8.2% in sCRPS, and by more than 20% MASE, across datasets. However, we also find that synthetic dataset pre-training does improve the accuracy of a FFM by 7% percent.", 'abstract_zh': '跨频率迁移学习（CFTL）已成为为预训练基础预测模型（FFMs）编撰大规模时间序列数据集的一种流行框架。', 'title_zh': '跨频域迁移学习和基础预测模型的实际评价'}
{'arxiv_id': 'arXiv:2509.19419', 'title': 'Probabilistic Runtime Verification, Evaluation and Risk Assessment of Visual Deep Learning Systems', 'authors': 'Birk Torpmann-Hagen, Pål Halvorsen, Michael A. Riegler, Dag Johansen', 'link': 'https://arxiv.org/abs/2509.19419', 'abstract': 'Despite achieving excellent performance on benchmarks, deep neural networks often underperform in real-world deployment due to sensitivity to minor, often imperceptible shifts in input data, known as distributional shifts. These shifts are common in practical scenarios but are rarely accounted for during evaluation, leading to inflated performance metrics. To address this gap, we propose a novel methodology for the verification, evaluation, and risk assessment of deep learning systems. Our approach explicitly models the incidence of distributional shifts at runtime by estimating their probability from outputs of out-of-distribution detectors. We combine these estimates with conditional probabilities of network correctness, structuring them in a binary tree. By traversing this tree, we can compute credible and precise estimates of network accuracy. We assess our approach on five different datasets, with which we simulate deployment conditions characterized by differing frequencies of distributional shift. Our approach consistently outperforms conventional evaluation, with accuracy estimation errors typically ranging between 0.01 and 0.1. We further showcase the potential of our approach on a medical segmentation benchmark, wherein we apply our methods towards risk assessment by associating costs with tree nodes, informing cost-benefit analyses and value-judgments. Ultimately, our approach offers a robust framework for improving the reliability and trustworthiness of deep learning systems, particularly in safety-critical applications, by providing more accurate performance estimates and actionable risk assessments.', 'abstract_zh': '尽管深度神经网络在基准测试中表现出色，但在实际部署中往往由于对输入数据微小、通常难以察觉的变化（称为分布移位）的敏感性而表现不佳。这些移位在实际场景中很常见，但在评估过程中却很少考虑到，导致夸大了性能指标。为解决这一问题，我们提出了一种新的方法论，用于深度学习系统的验证、评估和风险评估。我们的方法在运行时明确模型分布移位的发生情况，通过分布外检测器的输出估计其概率。我们将这些估计值与网络正确性的条件概率相结合，结构化为二叉树。通过遍历该树，我们可以计算出网络准确性的有说服力且精确的估计。我们在五个不同的数据集上评估了我们的方法，在这些数据集上模拟了不同分布移位频率的部署条件。我们的方法在准确性估计误差方面始终优于传统评估方法，误差范围通常在0.01到0.1之间。我们进一步展示了该方法在医学分割基准上的潜在应用，其中我们通过将成本与树节点关联，将其应用到风险评估中，以支持成本效益分析和价值判断。最终，我们的方法提供了一个 robust 的框架，通过提供更准确的性能估计和可行的风险评估来提高深度学习系统的可靠性和可信度，特别是在安全关键应用中。', 'title_zh': '视觉深度学习系统概率运行时验证、评估与风险评估'}
{'arxiv_id': 'arXiv:2509.19412', 'title': 'EngravingGNN: A Hybrid Graph Neural Network for End-to-End Piano Score Engraving', 'authors': 'Emmanouil Karystinaios, Francesco Foscarin, Gerhard Widmer', 'link': 'https://arxiv.org/abs/2509.19412', 'abstract': 'This paper focuses on automatic music engraving, i.e., the creation of a humanly-readable musical score from musical content. This step is fundamental for all applications that include a human player, but it remains a mostly unexplored topic in symbolic music processing. In this work, we formalize the problem as a collection of interdependent subtasks, and propose a unified graph neural network (GNN) framework that targets the case of piano music and quantized symbolic input. Our method employs a multi-task GNN to jointly predict voice connections, staff assignments, pitch spelling, key signature, stem direction, octave shifts, and clef signs. A dedicated postprocessing pipeline generates print-ready MusicXML/MEI outputs. Comprehensive evaluation on two diverse piano corpora (J-Pop and DCML Romantic) demonstrates that our unified model achieves good accuracy across all subtasks, compared to existing systems that only specialize in specific subtasks. These results indicate that a shared GNN encoder with lightweight task-specific decoders in a multi-task setting offers a scalable and effective solution for automatic music engraving.', 'abstract_zh': '本文专注于自动音乐雕刻，即从音乐内容生成人类可读的乐谱。这一步骤是所有包含人类演奏者的应用的基础，但在符号音乐处理中仍然是一个未被充分探索的主题。在本工作中，我们将问题正式化为一组相互依赖的子任务，并提出一个针对钢琴音乐和量化符号输入的统一图神经网络（GNN）框架。我们的方法使用一个多任务GNN联合预测声部连接、五线谱分配、音高记写、键签名、音符方向、八度移位和谱号标识。专用的后处理管道生成可打印的MusicXML/MEI输出。在两个不同的钢琴语料库（J-Pop和DCML浪漫主义）上的全面评估表明，我们的统一模型在所有子任务上的准确性都优于仅专注于特定子任务的现有系统。这些结果表明，在多任务设置中使用一个共享的GNN编码器和轻量级的任务特定解码器提供了一种可扩展且有效的自动音乐雕刻解决方案。', 'title_zh': 'EngravingGNN：一种端到端钢琴乐谱 engraving 的混合图神经网络'}
{'arxiv_id': 'arXiv:2509.19406', 'title': 'TimeMosaic: Temporal Heterogeneity Guided Time Series Forecasting via Adaptive Granularity Patch and Segment-wise Decoding', 'authors': 'Kuiye Ding, Fanda Fan, Chunyi Hou, Zheya Wang, Lei Wang, Zhengxin Yang, Jianfeng Zhan', 'link': 'https://arxiv.org/abs/2509.19406', 'abstract': 'Multivariate time series forecasting is essential in domains such as finance, transportation, climate, and energy. However, existing patch-based methods typically adopt fixed-length segmentation, overlooking the heterogeneity of local temporal dynamics and the decoding heterogeneity of forecasting. Such designs lose details in information-dense regions, introduce redundancy in stable segments, and fail to capture the distinct complexities of short-term and long-term horizons. We propose TimeMosaic, a forecasting framework that aims to address temporal heterogeneity. TimeMosaic employs adaptive patch embedding to dynamically adjust granularity according to local information density, balancing motif reuse with structural clarity while preserving temporal continuity. In addition, it introduces segment-wise decoding that treats each prediction horizon as a related subtask and adapts to horizon-specific difficulty and information requirements, rather than applying a single uniform decoder. Extensive evaluations on benchmark datasets demonstrate that TimeMosaic delivers consistent improvements over existing methods, and our model trained on the large-scale corpus with 321 billion observations achieves performance competitive with state-of-the-art TSFMs.', 'abstract_zh': '多变量时间序列 forecasting 在金融、交通、气候和能源等领域至关重要。然而，现有的基于块的方法通常采用固定长度的分割，忽略了局部时间动态的异质性以及 forecasting 的解码异质性。这种设计在信息密集区域丢失了细节，在稳定段引入了冗余，并未能捕捉短期和长期视角下的独特复杂性。我们提出 TimeMosaic，一种旨在解决时间异质性的 forecasting 框架。TimeMosaic 使用自适应块嵌入动态调整粒度，根据局部信息密度进行调整，平衡模式重用与结构清晰度，同时保持时间连续性。此外，它引入了块级解码，将每个预测视角视为相关的子任务，并适应视角特定的难度和信息需求，而非采用单一统一的解码器。在基准数据集上的广泛评估表明，TimeMosaic 在多种场景中提供了持续改进，并且在包含 3210 亿观察值的大型语料库上训练的模型达到了与最新时间序列 forecasting 模型相当的性能。', 'title_zh': '时空拼图：基于适应粒度补丁和段落级解码的时间序列预测技术引导的时间异质性'}
{'arxiv_id': 'arXiv:2509.19405', 'title': 'Improving Outdoor Multi-cell Fingerprinting-based Positioning via Mobile Data Augmentation', 'authors': 'Tony Chahoud, Lorenzo Mario Amorosa, Riccardo Marini, Luca De Nardis', 'link': 'https://arxiv.org/abs/2509.19405', 'abstract': 'Accurate outdoor positioning in cellular networks is hindered by sparse, heterogeneous measurement collections and the high cost of exhaustive site surveys. This paper introduces a lightweight, modular mobile data augmentation framework designed to enhance multi-cell fingerprinting-based positioning using operator-collected minimization of drive test (MDT) records. The proposed approach decouples spatial and radio-feature synthesis: kernel density estimation (KDE) models the empirical spatial distribution to generate geographically coherent synthetic locations, while a k-nearest-neighbor (KNN)-based block produces augmented per-cell radio fingerprints. The architecture is intentionally training-free, interpretable, and suitable for distributed or on-premise operator deployments, supporting privacy-aware workflows. We both validate each augmentation module independently and assess its end-to-end impact on fingerprinting-based positioning using a real-world MDT dataset provided by an Italian mobile network operator across diverse urban and peri-urban scenarios. Results show that the proposed KDE-KNN augmentation consistently improves positioning performance, with the largest benefits in sparsely sampled or structurally complex regions; we also observe region-dependent saturation effects as augmentation increases. The framework offers a practical, low-complexity path to enhance operator positioning services using existing mobile data traces.', 'abstract_zh': '基于运营商采集最小化路测记录的轻量级模块化移动数据增强框架：提升蜂窝网络多小区指纹定位精度', 'title_zh': '基于移动数据增强的室外多小区指纹定位改进方法'}
{'arxiv_id': 'arXiv:2509.19403', 'title': 'Online Adaptation via Dual-Stage Alignment and Self-Supervision for Fast-Calibration Brain-Computer Interfaces', 'authors': 'Sheng-Bin Duan, Jian-Long Hao, Tian-Yu Xiang, Xiao-Hu Zhou, Mei-Jiang Gui, Xiao-Liang Xie, Shi-Qi Liu, Zeng-Guang Hou', 'link': 'https://arxiv.org/abs/2509.19403', 'abstract': 'Individual differences in brain activity hinder the online application of electroencephalogram (EEG)-based brain computer interface (BCI) systems. To overcome this limitation, this study proposes an online adaptation algorithm for unseen subjects via dual-stage alignment and self-supervision. The alignment process begins by applying Euclidean alignment in the EEG data space and then updates batch normalization statistics in the representation space. Moreover, a self-supervised loss is designed to update the decoder. The loss is computed by soft pseudo-labels derived from the decoder as a proxy for the unknown ground truth, and is calibrated by Shannon entropy to facilitate self-supervised training. Experiments across five public datasets and seven decoders show the proposed algorithm can be integrated seamlessly regardless of BCI paradigm and decoder architecture. In each iteration, the decoder is updated with a single online trial, which yields average accuracy gains of 4.9% on steady-state visual evoked potentials (SSVEP) and 3.6% on motor imagery. These results support fast-calibration operation and show that the proposed algorithm has great potential for BCI applications.', 'abstract_zh': '基于脑电图的脑机接口系统中未见个体的大脑活动差异 hindering 其在线应用：一种双阶段对齐与自监督的在线自适应算法', 'title_zh': '基于双重阶段对齐和自我监督的在线自适应快速校准脑机接口'}
{'arxiv_id': 'arXiv:2509.19398', 'title': 'FedOC: Multi-Server FL with Overlapping Client Relays in Wireless Edge Networks', 'authors': 'Yun Ji, Zeyu Chen, Xiaoxiong Zhong, Yanan Ma, Sheng Zhang, Yuguang Fang', 'link': 'https://arxiv.org/abs/2509.19398', 'abstract': 'Multi-server Federated Learning (FL) has emerged as a promising solution to mitigate communication bottlenecks of single-server FL. We focus on a typical multi-server FL architecture, where the regions covered by different edge servers (ESs) may overlap. A key observation of this architecture is that clients located in the overlapping areas can access edge models from multiple ESs. Building on this insight, we propose FedOC (Federated learning with Overlapping Clients), a novel framework designed to fully exploit the potential of these overlapping clients. In FedOC, overlapping clients could serve dual roles: (1) as Relay Overlapping Clients (ROCs), they forward edge models between neighboring ESs in real time to facilitate model sharing among different ESs; and (2) as Normal Overlapping Clients (NOCs), they dynamically select their initial model for local training based on the edge model delivery time, which enables indirect data fusion among different regions of ESs. The overall FedOC workflow proceeds as follows: in every round, each client trains local model based on the earliest received edge model and transmits to the respective ESs for model aggregation. Then each ES transmits the aggregated edge model to neighboring ESs through ROC relaying. Upon receiving the relayed models, each ES performs a second aggregation and subsequently broadcasts the updated model to covered clients. The existence of ROCs enables the model of each ES to be disseminated to the other ESs in a decentralized manner, which indirectly achieves intercell model and speeding up the training process, making it well-suited for latency-sensitive edge environments. Extensive experimental results show remarkable performance gains of our scheme compared to existing methods.', 'abstract_zh': '多服务器联邦学习（FL）已成为解决单服务器FL通信瓶颈的一种有前途的解决方案。我们专注于一种典型的多服务器FL架构，其中不同边缘服务器（ESs）覆盖区域可能重叠。这一架构的关键观察是，位于重叠区域的客户端可以从多个ESs访问边缘模型。基于这一洞察，我们提出了一种新的框架FedOC（具有重叠客户端的联邦学习），旨在充分利用这些重叠客户端的潜力。在FedOC中，重叠客户端可以承担双重角色：（1）作为 Relay Overlapping Clients（ROCs），它们实时转发相邻ESs之间的边缘模型以促进不同ESs之间的模型共享；（2）作为 Normal Overlapping Clients（NOCs），它们根据边缘模型传输时间动态选择其初始模型进行本地训练，从而实现不同ESs区域间间接数据融合。FedOC的整体工作流如下：每一轮中，每个客户端基于最早接收到的边缘模型训练本地模型，并将模型传输给相应的ESs进行模型聚合。然后每个ESs通过ROCs的转发将聚合后的边缘模型传输给相邻的ESs。当每个ESs接收到转发的模型后，它们执行第二次聚合，并随后将更新后的模型广播给覆盖区域内的客户端。ROCs的存在使得每个ESs的模型能够以去中心化的方式传播到其他ESs，从而间接实现小区间模型的融合，加速训练过程，使其非常适合延迟敏感的边缘环境。实验结果表明，与现有方法相比，我们的方案具有显著的性能提升。', 'title_zh': '联邦OC：无线边缘网络中具有重叠客户端中继的多服务器联邦学习'}
{'arxiv_id': 'arXiv:2509.19397', 'title': 'Self-Alignment Learning to Improve Myocardial Infarction Detection from Single-Lead ECG', 'authors': 'Jiarui Jin, Xiaocheng Fang, Haoyu Wang, Jun Li, Che Liu, Donglin Xie, Hongyan Li, Shenda Hong', 'link': 'https://arxiv.org/abs/2509.19397', 'abstract': 'Myocardial infarction is a critical manifestation of coronary artery disease, yet detecting it from single-lead electrocardiogram (ECG) remains challenging due to limited spatial information. An intuitive idea is to convert single-lead into multiple-lead ECG for classification by pre-trained models, but generative methods optimized at the signal level in most cases leave a large latent space gap, ultimately degrading diagnostic performance. This naturally raises the question of whether latent space alignment could help. However, most prior ECG alignment methods focus on learning transformation invariance, which mismatches the goal of single-lead detection. To address this issue, we propose SelfMIS, a simple yet effective alignment learning framework to improve myocardial infarction detection from single-lead ECG. Discarding manual data augmentations, SelfMIS employs a self-cutting strategy to pair multiple-lead ECG with their corresponding single-lead segments and directly align them in the latent space. This design shifts the learning objective from pursuing transformation invariance to enriching the single-lead representation, explicitly driving the single-lead ECG encoder to learn a representation capable of inferring global cardiac context from the local signal. Experimentally, SelfMIS achieves superior performance over baseline models across nine myocardial infarction types while maintaining a simpler architecture and lower computational overhead, thereby substantiating the efficacy of direct latent space alignment. Our code and checkpoint will be publicly available after acceptance.', 'abstract_zh': '基于自我切割的单导联心电图隐空间对齐方法以改善 myocardial infarction 检测', 'title_zh': '自我对齐学习以提高单导联ECG心肌梗死检测'}
{'arxiv_id': 'arXiv:2509.19396', 'title': 'OmniFed: A Modular Framework for Configurable Federated Learning from Edge to HPC', 'authors': 'Sahil Tyagi, Andrei Cozma, Olivera Kotevska, Feiyi Wang', 'link': 'https://arxiv.org/abs/2509.19396', 'abstract': 'Federated Learning (FL) is critical for edge and High Performance Computing (HPC) where data is not centralized and privacy is crucial. We present OmniFed, a modular framework designed around decoupling and clear separation of concerns for configuration, orchestration, communication, and training logic. Its architecture supports configuration-driven prototyping and code-level override-what-you-need customization. We also support different topologies, mixed communication protocols within a single deployment, and popular training algorithms. It also offers optional privacy mechanisms including Differential Privacy (DP), Homomorphic Encryption (HE), and Secure Aggregation (SA), as well as compression strategies. These capabilities are exposed through well-defined extension points, allowing users to customize topology and orchestration, learning logic, and privacy/compression plugins, all while preserving the integrity of the core system. We evaluate multiple models and algorithms to measure various performance metrics. By unifying topology configuration, mixed-protocol communication, and pluggable modules in one stack, OmniFed streamlines FL deployment across heterogeneous environments. Github repository is available at this https URL.', 'abstract_zh': '联邦学习（FL）对于边缘计算和高性能计算（HPC）至关重要，尤其是在数据未集中且隐私至关重要的情况下。我们提出了OmniFed，一个模块化框架，其设计理念是解耦和清晰分离配置、 orchestration、通信和训练逻辑。其架构支持配置驱动的原型设计和代码级按需定制。同时，它支持不同的拓扑结构、单一部署中的混合通信协议以及流行的训练算法。它还提供了包括差分隐私（DP）、同态加密（HE）和安全聚合（SA）在内的可选隐私机制，以及压缩策略。这些功能通过明确定义的扩展点暴露出来，允许用户定制拓扑结构和orchestration、学习逻辑以及隐私/压缩插件，同时保持核心系统的完整性。我们评估了多种模型和算法以衡量各种性能指标。通过在一个栈中统一拓扑配置、混合协议通信和可插拔模块，OmniFed 简化了跨异构环境的联邦学习部署。GitHub仓库可通过此链接访问。', 'title_zh': '全地域联邦学习：从边缘到HPC的可配置模块化框架'}
{'arxiv_id': 'arXiv:2509.19391', 'title': 'TensLoRA: Tensor Alternatives for Low-Rank Adaptation', 'authors': 'Axel Marmoret, Reda Bensaid, Jonathan Lys, Vincent Gripon, François Leduc-Primeau', 'link': 'https://arxiv.org/abs/2509.19391', 'abstract': 'Low-Rank Adaptation (LoRA) is widely used to efficiently adapt Transformers by adding trainable low-rank matrices to attention projections. While effective, these matrices are considered independent for each attention projection (Query, Key, and Value) and each layer. Recent extensions have considered joint, tensor-based adaptations, but only in limited forms and without a systematic framework. We introduce TensLoRA, a unified framework that aggregates LoRA updates into higher-order tensors and models a broad family of tensor-based low-rank adaptations. Our formulation generalizes existing tensor-based methods and enables mode-specific compression rates, allowing parameter budgets to be tailored according to the modality and task. Experiments on vision and language benchmarks reveal that the tensor construction directly impacts performance, sometimes better than standard LoRA under similar parameter counts.', 'abstract_zh': 'TensLoRA: 一种统一的张量基低秩适应框架', 'title_zh': 'TensLoRA: 张量视角下的低秩适应'}
{'arxiv_id': 'arXiv:2509.19384', 'title': 'Data-Driven Reconstruction of Significant Wave Heights from Sparse Observations', 'authors': 'Hongyuan Shi, Yilin Zhai, Ping Dong, Zaijin You, Chao Zhan, Qing Wang', 'link': 'https://arxiv.org/abs/2509.19384', 'abstract': "Reconstructing high-resolution regional significant wave height fields from sparse and uneven buoy observations remains a core challenge for ocean monitoring and risk-aware operations. We introduce AUWave, a hybrid deep learning framework that fuses a station-wise sequence encoder (MLP) with a multi-scale U-Net enhanced by a bottleneck self-attention layer to recover 32$\\times$32 regional SWH fields. A systematic Bayesian hyperparameter search with Optuna identifies the learning rate as the dominant driver of generalization, followed by the scheduler decay and the latent dimension. Using NDBC buoy observations and ERA5 reanalysis over the Hawaii region, AUWave attains a minimum validation loss of 0.043285 and a slightly right-skewed RMSE distribution. Spatial errors are lowest near observation sites and increase with distance, reflecting identifiability limits under sparse sampling. Sensitivity experiments show that AUWave consistently outperforms a representative baseline in data-richer configurations, while the baseline is only marginally competitive in the most underdetermined single-buoy cases. The architecture's multi-scale and attention components translate into accuracy gains when minimal but non-trivial spatial anchoring is available. Error maps and buoy ablations reveal key anchor stations whose removal disproportionately degrades performance, offering actionable guidance for network design. AUWave provides a scalable pathway for gap filling, high-resolution priors for data assimilation, and contingency reconstruction.", 'abstract_zh': '基于稀疏不均匀浮标观测的高分辨率区域显著波高场重建仍然是海洋监测和风险感知操作中的核心挑战。我们引入了AUWave，这是一种结合站级序列编码器（MLP）并与带有瓶颈自注意力层的多尺度U-Net相结合的混合深度学习框架，用于恢复32×32区域显著波高场（SWH）。通过使用Optuna进行系统性的贝叶斯超参数搜索，确定了学习率是泛化能力的主导因素，其次是调度器衰减和潜在维度。使用夏威夷地区的NDBC浮标观测和ERA5再分析数据，AUWave达到最小验证损失0.043285，并显示出轻微右偏的RMSE分布。空间误差在观测站点附近最低，随距离增加而增加，反映了在稀疏采样下可识别性的限制。敏感性实验表明，在数据更丰富的情况下，AUWave始终优于一个代表性基线，而在最欠定的单浮标案例中，基线仅略具竞争力。该架构的多尺度和注意力机制在仅提供少量但非琐碎的空间锚定情况下转化为准确性的提升。错误图和浮标消融实验揭示了关键锚定点，其移除会对性能产生不成比例的负面影响，为网络设计提供了可行的指导。AUWave提供了一种可扩展的路径，用于填补数据缺口、为数据同化提供高分辨率先验以及进行应急重建。', 'title_zh': '基于数据驱动的稀疏观测显著波高重构'}
{'arxiv_id': 'arXiv:2509.19376', 'title': 'Solving Freshness in RAG: A Simple Recency Prior and the Limits of Heuristic Trend Detection', 'authors': 'Matthew Grofsky', 'link': 'https://arxiv.org/abs/2509.19376', 'abstract': 'We address temporal failures in RAG systems using two methods on cybersecurity data. A simple recency prior achieved an accuracy of 1.00 on freshness tasks. In contrast, a clustering heuristic for topic evolution failed (0.08 F1-score), showing trend detection requires methods beyond simple heuristics.', 'abstract_zh': '我们使用两种方法处理RAG系统中的时间失败问题，并应用于网络安全数据。简单的时效性先验在新鲜度任务中达到了0.99的准确率。相比之下，用于主题演变的聚类启发式方法失败了（F1分数为0.08），表明趋势检测需要超出简单启发式的方法。', 'title_zh': '解决RAG中的新鲜度问题：一个简单的近期优先级和启发式趋势检测的局限性'}
{'arxiv_id': 'arXiv:2509.19372', 'title': 'Representation-based Broad Hallucination Detectors Fail to Generalize Out of Distribution', 'authors': 'Zuzanna Dubanowska, Maciej Żelaszczyk, Michał Brzozowski, Paolo Mandica, Michał Karpowicz', 'link': 'https://arxiv.org/abs/2509.19372', 'abstract': 'We critically assess the efficacy of the current SOTA in hallucination detection and find that its performance on the RAGTruth dataset is largely driven by a spurious correlation with data. Controlling for this effect, state-of-the-art performs no better than supervised linear probes, while requiring extensive hyperparameter tuning across datasets. Out-of-distribution generalization is currently out of reach, with all of the analyzed methods performing close to random. We propose a set of guidelines for hallucination detection and its evaluation.', 'abstract_zh': '我们批判性地评估了当前领先研究成果在幻觉检测方面的有效性，并发现其在RAGTruth数据集上的 performance 大部分是由与数据之间的虚假相关性驱动的。在控制这一效应后，最先进的方法的表现并不优于监督线性探针，同时还需要在不同数据集上进行广泛的超参数调整。目前，异常分布外的泛化能力仍然无法实现，所有分析的方法的表现都接近随机。我们提出了一套幻觉检测及其评估的指导原则。', 'title_zh': '基于表示的广泛幻觉检测器无法泛化到分布外数据'}
{'arxiv_id': 'arXiv:2509.19366', 'title': 'Unsupervised Outlier Detection in Audit Analytics: A Case Study Using USA Spending Data', 'authors': 'Buhe Li, Berkay Kaplan, Maksym Lazirko, Aleksandr Kogan', 'link': 'https://arxiv.org/abs/2509.19366', 'abstract': 'This study investigates the effectiveness of unsupervised outlier detection methods in audit analytics, utilizing USA spending data from the U.S. Department of Health and Human Services (DHHS) as a case example. We employ and compare multiple outlier detection algorithms, including Histogram-based Outlier Score (HBOS), Robust Principal Component Analysis (PCA), Minimum Covariance Determinant (MCD), and K-Nearest Neighbors (KNN) to identify anomalies in federal spending patterns. The research addresses the growing need for efficient and accurate anomaly detection in large-scale governmental datasets, where traditional auditing methods may fall short. Our methodology involves data preparation, algorithm implementation, and performance evaluation using precision, recall, and F1 scores. Results indicate that a hybrid approach, combining multiple detection strategies, enhances the robustness and accuracy of outlier identification in complex financial data. This study contributes to the field of audit analytics by providing insights into the comparative effectiveness of various outlier detection models and demonstrating the potential of unsupervised learning techniques in improving audit quality and efficiency. The findings have implications for auditors, policymakers, and researchers seeking to leverage advanced analytics in governmental financial oversight and risk management.', 'abstract_zh': '本研究探讨了无监督异常检测方法在审计数据分析中的有效性，以美国卫生与人类服务部（DHHS）的美国支出数据为例进行分析。我们采用了多个异常检测算法，包括基于直方图的异常评分（HBOS）、鲁棒主成分分析（RPCA）、最小 covariance 确定（MCD）和 K-最近邻（KNN），以识别联邦支出模式中的异常。研究解决了在大规模政府数据集中高效准确地检测异常日益增长的需求，而传统的审计方法可能难以满足这一需求。我们的方法包括数据准备、算法实现以及使用精确度、召回率和F1分数进行性能评估。研究结果表明，结合多种检测策略的混合方法可以提高复杂金融数据中异常识别的稳健性和准确性。本研究通过提供各种异常检测模型的比较有效性见解，并展示了无监督学习技术在提高审计质量和效率方面的潜力，为审计分析领域做出了贡献。研究结果对审计人员、政策制定者和研究人员利用先进的数据分析技术进行政府财务监督和风险管理具有重要意义。', 'title_zh': '审计分析中无监督异常检测：基于USA Spending数据的案例研究'}
{'arxiv_id': 'arXiv:2509.19363', 'title': 'Analyzing the Impact of Credit Card Fraud on Economic Fluctuations of American Households Using an Adaptive Neuro-Fuzzy Inference System', 'authors': 'Zhuqi Wang, Qinghe Zhang, Zhuopei Cheng', 'link': 'https://arxiv.org/abs/2509.19363', 'abstract': 'Credit card fraud is assuming growing proportions as a major threat to the financial position of American household, leading to unpredictable changes in household economic behavior. To solve this problem, in this paper, a new hybrid analysis method is presented by using the Enhanced ANFIS. The model proposes several advances of the conventional ANFIS framework and employs a multi-resolution wavelet decomposition module and a temporal attention mechanism. The model performs discrete wavelet transformations on historical transaction data and macroeconomic indicators to generate localized economic shock signals. The transformed features are then fed into a deep fuzzy rule library which is based on Takagi-Sugeno fuzzy rules with adaptive Gaussian membership functions. The model proposes a temporal attention encoder that adaptively assigns weights to multi-scale economic behavior patterns, increasing the effectiveness of relevance assessment in the fuzzy inference stage and enhancing the capture of long-term temporal dependencies and anomalies caused by fraudulent activities. The proposed method differs from classical ANFIS which has fixed input-output relations since it integrates fuzzy rule activation with the wavelet basis selection and the temporal correlation weights via a modular training procedure. Experimental results show that the RMSE was reduced by 17.8% compared with local neuro-fuzzy models and conventional LSTM models.', 'abstract_zh': '信用卡欺诈正日益成为美国家庭财务状况的主要威胁，导致家庭经济行为出现不可预测的变化。为了解决这一问题，本文提出了一种基于Enhanced ANFIS的新型混合分析方法。该模型在传统ANFIS框架的基础上进行了多项改进，并采用了多分辨率小波分解模块和时间注意力机制。模型对历史交易数据和宏观经济指标进行了离散小波变换，生成局部经济冲击信号。变换后的特征输入基于Takagi-Sugeno模糊规则且具有自适应高斯隶属函数的深度模糊规则库。模型提出了一种时间注意力编码器，能够自适应地为多尺度经济行为模式分配权重，增强了模糊推理阶段的相关性评估效果，并增强了对长期时间依赖性和欺诈活动引起的异常的捕捉能力。与经典的固定输入-输出关系的ANFIS相比，该方法通过模块化训练过程将模糊规则激活、小波基选择和时间相关权重相结合。实验结果表明，该方法的RMSE相比局部神经模糊模型和传统的LSTM模型降低了17.8%。', 'title_zh': '基于自适应神经模糊 inference 系统分析信用卡欺诈对美国家庭经济波动的影响'}
{'arxiv_id': 'arXiv:2509.19362', 'title': 'DeepACTIF: Efficient Feature Attribution via Activation Traces in Neural Sequence Models', 'authors': 'Benedikt W. Hosp', 'link': 'https://arxiv.org/abs/2509.19362', 'abstract': 'Feature attribution is essential for interpreting deep learning models, particularly in time-series domains such as healthcare, biometrics, and human-AI interaction. However, standard attribution methods, such as Integrated Gradients or SHAP, are computationally intensive and not well-suited for real-time applications. We present DeepACTIF, a lightweight and architecture-aware feature attribution method that leverages internal activations of sequence models to estimate feature importance efficiently. Focusing on LSTM-based networks, we introduce an inverse-weighted aggregation scheme that emphasises stability and magnitude of activations across time steps. Our evaluation across three biometric gaze datasets shows that DeepACTIF not only preserves predictive performance under severe feature reduction (top 10% of features) but also significantly outperforms established methods, including SHAP, IG, and DeepLIFT, in terms of both accuracy and statistical robustness. Using Wilcoxon signed-rank tests and effect size analysis, we demonstrate that DeepACTIF yields more informative feature rankings with significantly lower error across all top-k conditions (10 - 40%). Our experiments demonstrate that DeepACTIF not only reduces computation time and memory usage by orders of magnitude but also preserves model accuracy when using only top-ranked features. That makes DeepACTIF a viable solution for real-time interpretability on edge devices such as mobile XR headsets or embedded health monitors.', 'abstract_zh': 'DeepACTIF：一种针对序列模型的轻量化且架构感知的特征 attribution 方法及其在生物识别凝视数据集上的应用', 'title_zh': 'DeepACTIF: 通过神经序列模型激活轨迹进行高效特征归因'}
{'arxiv_id': 'arXiv:2509.19359', 'title': 'Anti-Money Laundering Systems Using Deep Learning', 'authors': 'Mashkhal Abdalwahid Sidiq, Yimamu Kirubel Wondaferew', 'link': 'https://arxiv.org/abs/2509.19359', 'abstract': "In this paper, we focused on using deep learning methods for detecting money laundering in financial transaction networks, in order to demonstrate that it can be used as a complement or instead of the more commonly used rule-based systems and conventional Anti-Money Laundering (AML) systems. The paper explores the pivotal role played by Anti-Money Laundering (AML) activities in the global financial industry. It underscores the drawbacks of conventional AML systems, which exhibit high rates of false positives and lack the sophistication to uncover intricate money laundering schemes. To tackle these challenges, the paper proposes an advanced AML system that capitalizes on link analysis using deep learning techniques. At the heart of this system lies the utilization of centrality algorithms like Degree Centrality, Closeness Centrality, Betweenness Centrality, and PageRank. These algorithms enhance the system's capability to identify suspicious activities by examining the influence and interconnections within networks of financial transactions. The significance of Anti-Money Laundering (AML) efforts within the global financial sector is discussed in this paper. It highlights the limitations of traditional AML systems. The results showed the practicality and superiority of the new implementation of the GCN model, which is a preferable method for connectively structured data, meaning that a transaction or account is analyzed in the context of its financial environment. In addition, the paper delves into the prospects of Anti-Money Laundering (AML) efforts, proposing the integration of emerging technologies such as deep learning and centrality algorithms. This integration holds promise for enhancing the effectiveness of AML systems by refining their capabilities.", 'abstract_zh': '基于深度学习的金融交易网络洗钱检测方法研究：传统反洗钱系统的补充或替代', 'title_zh': '使用深度学习的反洗钱系统'}
{'arxiv_id': 'arXiv:2509.19351', 'title': 'The Impact of Structural Changes on Learning Capacity in the Fly Olfactory Neural Circuit', 'authors': 'Katherine Xie, Gabriel Koch Ocker', 'link': 'https://arxiv.org/abs/2509.19351', 'abstract': "The Drosophila mushroom body (MB) is known to be involved in olfactory learning and memory; the synaptic plasticity of the Kenyon cell (KC) to mushroom body output neuron (MBON) synapses plays a key role in the learning process. Previous research has focused on projection neuron (PN) to Kenyon cell (KC) connectivity within the MB; we examine how perturbations to the mushroom body circuit structure and changes in connectivity, specifically within the KC to mushroom body output neuron (MBON) neural circuit, affect the MBONs' ability to distinguish between odor classes. We constructed a neural network that incorporates the connectivity between PNs, KCs, and MBONs. To train our model, we generated ten artificial input classes, which represent the projection neuron activity in response to different odors. We collected data on the number of KC-to-MBON connections, MBON error rates, and KC-to-MBON synaptic weights, among other metrics. We observed that MBONs with very few presynaptic KCs consistently performed worse than others in the odor classification task. The developmental types of KCs also played a significant role in each MBON's output. We performed random and targeted KC ablation and observed that ablating developmentally mature KCs had a greater negative impact on MBONs' learning capacity than ablating immature KCs. Random and targeted pruning of KC-MBON synaptic connections yielded results largely consistent with the ablation experiments. To further explore the various types of KCs, we also performed rewiring experiments in the PN to KC circuit. Our study furthers our understanding of olfactory neuroplasticity and provides important clues to understanding learning and memory in general. Understanding how the olfactory circuits process and learn can also have potential applications in artificial intelligence and treatments for neurodegenerative diseases.", 'abstract_zh': '果蝇蘑菇体在嗅觉学习和记忆中的作用；肯yon细胞到蘑菇体输出神经元突触可塑性的变化在学习过程中的关键作用：探究蘑菇体电路结构紊乱和突触连接变化对蘑菇体输出神经元区分不同气味类别的影响及其机制。', 'title_zh': '结构变化对苍蝇嗅觉神经回路学习能力的影响'}
{'arxiv_id': 'arXiv:2509.19345', 'title': 'SCORE: A Semantic Evaluation Framework for Generative Document Parsing', 'authors': 'Renyu Li, Antonio Jimeno Yepes, Yao You, Kamil Pluciński, Maximilian Operlejn, Crag Wolfe', 'link': 'https://arxiv.org/abs/2509.19345', 'abstract': 'Multi-modal generative document parsing systems challenge traditional evaluation: unlike deterministic OCR or layout models, they often produce semantically correct yet structurally divergent outputs. Conventional metrics-CER, WER, IoU, or TEDS-misclassify such diversity as error, penalizing valid interpretations and obscuring system behavior.\nWe introduce SCORE (Structural and COntent Robust Evaluation), an interpretation-agnostic framework that integrates (i) adjusted edit distance for robust content fidelity, (ii) token-level diagnostics to distinguish hallucinations from omissions, (iii) table evaluation with spatial tolerance and semantic alignment, and (iv) hierarchy-aware consistency checks. Together, these dimensions enable evaluation that embraces representational diversity while enforcing semantic rigor.\nAcross 1,114 pages spanning a holistic benchmark and a field dataset, SCORE consistently revealed cross-dataset performance patterns missed by standard metrics. In 2-5% of pages with ambiguous table structures, traditional metrics penalized systems by 12-25% on average, leading to distorted rankings. SCORE corrected these cases, recovering equivalence between alternative but valid interpretations. Moreover, by normalizing generative outputs into a format-agnostic representation, SCORE reproduces traditional scores (e.g., table F1 up to 0.93) without requiring object-detection pipelines, demonstrating that generative parsing alone suffices for comprehensive evaluation.\nBy exposing how interpretive diversity impacts evaluation outcomes and providing multi-dimensional, interpretable diagnostics, SCORE establishes foundational principles for semantically grounded, fair, and practical benchmarking of modern document parsing systems.', 'abstract_zh': '多模态生成文档解析系统挑战传统评估：与确定性的OCR或布局模型不同，它们 often  produce semantically correct yet structurally divergent outputs. Conventional metrics-CER, WER, IoU, or TEDS-misclassify such diversity as error, penalizing valid interpretations and obscuring system behavior.\n\n我们引入了 SCORE（结构和内容稳健评估）框架，这是一个无偏见的解释框架，整合了 (i) 调整后的编辑距离以保证内容的稳健性，(ii) 词元级别诊断以区分幻觉与遗漏，(iii) 带有空间容差和语义对齐的表评估，以及 (iv) 层次感知的一致性检查。这些维度一起，使得评估能够接纳表示多样性的同时，保证语义严谨。\n\n在涵盖从综合基准到领域数据集的1,114 页中，SCORE 一致揭示了标准度量所忽略的跨数据集性能模式。在2-5% 结构模糊的表格页面中，传统度量平均惩罚系统12-25%，导致排名失真。SCORE 纠正了这些情况，使替代但有效的解释恢复了等效性。此外，通过将生成的输出规范化为格式无关表示，SCORE 在无需对象检测管道的情况下再现了传统得分（例如，表F1高达0.93），证明了仅生成解析即可实现全面评估。\n\n通过揭示解释多样性对评估结果的影响，并提供多维度、可解释的诊断，SCORE 为现代文档解析系统建立了坚实的基础原则，以确保语义驱动、公平和实用的基准测试。', 'title_zh': 'SCORE：生成文档解析的语义评估框架'}
{'arxiv_id': 'arXiv:2509.19343', 'title': 'Part-of-speech tagging for Nagamese Language using CRF', 'authors': 'Alovi N Shohe, Chonglio Khiamungam, Teisovi Angami', 'link': 'https://arxiv.org/abs/2509.19343', 'abstract': 'This paper investigates part-of-speech tagging, an important task in Natural Language Processing (NLP) for the Nagamese language. The Nagamese language, a.k.a. Naga Pidgin, is an Assamese-lexified Creole language developed primarily as a means of communication in trade between the Nagas and people from Assam in northeast India. A substantial amount of work in part-of-speech-tagging has been done for resource-rich languages like English, Hindi, etc. However, no work has been done in the Nagamese language. To the best of our knowledge, this is the first attempt at part-of-speech tagging for the Nagamese Language. The aim of this work is to identify the part-of-speech for a given sentence in the Nagamese language. An annotated corpus of 16,112 tokens is created and applied machine learning technique known as Conditional Random Fields (CRF). Using CRF, an overall tagging accuracy of 85.70%; precision, recall of 86%, and f1-score of 85% is achieved.\nKeywords. Nagamese, NLP, part-of-speech, machine learning, CRF.', 'abstract_zh': 'This paper investigates part-of-speech tagging for the Nagamese language in Natural Language Processing (NLP).', 'title_zh': '使用CRF的纳加梅语词性标注'}
{'arxiv_id': 'arXiv:2509.19341', 'title': 'Fine-Grained AI Model Caching and Downloading With Coordinated Multipoint Broadcasting in Multi-Cell Edge Networks', 'authors': 'Yang Fu, Peng Qin, Yueyue Zhang, Yifei Wang', 'link': 'https://arxiv.org/abs/2509.19341', 'abstract': '6G networks are envisioned to support on-demand AI model downloading to accommodate diverse inference requirements of end users. By proactively caching models at edge nodes, users can retrieve the requested models with low latency for on-device AI inference. However, the substantial size of contemporary AI models poses significant challenges for edge caching under limited storage capacity, as well as for the concurrent delivery of heterogeneous models over wireless channels. To address these challenges, we propose a fine-grained AI model caching and downloading system that exploits parameter reusability, stemming from the common practice of fine-tuning task-specific models from a shared pre-trained model with frozen parameters. This system selectively caches model parameter blocks (PBs) at edge nodes, eliminating redundant storage of reusable parameters across different cached models. Additionally, it incorporates coordinated multipoint (CoMP) broadcasting to simultaneously deliver reusable PBs to multiple users, thereby enhancing downlink spectrum utilization. Under this arrangement, we formulate a model downloading delay minimization problem to jointly optimize PB caching, migration (among edge nodes), and broadcasting beamforming. To tackle this intractable problem, we develop a distributed multi-agent learning framework that enables edge nodes to explicitly learn mutual influence among their actions, thereby facilitating cooperation. Furthermore, a data augmentation approach is proposed to adaptively generate synthetic training samples through a predictive model, boosting sample efficiency and accelerating policy learning. Both theoretical analysis and simulation experiments validate the superior convergence performance of the proposed learning framework.', 'abstract_zh': '6G网络设想支持按需下载AI模型以适应终端用户多变的推理需求。通过在边缘节点上主动缓存模型，用户可以以低延迟的方式在设备上获取所需的模型进行AI推理。然而，现代AI模型的庞大体积给在存储容量有限的边缘节点上进行缓存带来了巨大挑战，并且也对通过无线信道同时传输异构模型提出了挑战。为了解决这些问题，我们提出了一种细粒度的AI模型缓存和下载系统，该系统利用参数重用性，这是从共享的预训练模型中精调特定任务模型的一种常见做法。该系统选择性地在边缘节点上缓存模型参数块（PB），消除不同缓存模型之间可重用参数的冗余存储。此外，系统还结合了协作多点（CoMP）广播，同时向多个用户传输可重用的参数块，从而提高下行链路频谱利用率。在该配置下，我们构建了一个模型下载延迟最小化问题，以联合优化参数块缓存、迁移（在边缘节点之间）和广播波束形成。为了解决这一难以处理的问题，我们开发了一个分布式多代理学习框架，使边缘节点能够明确学习彼此行为的影响，从而促进合作。此外，我们提出了一种数据增强方法，通过预测模型自适应地生成合成训练样本，提升样本效率并加速策略学习。理论分析和仿真实验均验证了所提出的学习框架的优越收敛性能。', 'title_zh': '多小区边缘网络中协调多点广播下的细粒度AI模型缓存与下载'}
{'arxiv_id': 'arXiv:2509.19340', 'title': 'Joint Channel Estimation and Computation Offloading in Fluid Antenna-assisted MEC Networks', 'authors': 'Ying Ju, Mingdong Li, Haoyu Wang, Lei Liu, Youyang Qu, Mianxiong Dong, Victor C. M. Leung, Chau Yuen', 'link': 'https://arxiv.org/abs/2509.19340', 'abstract': 'With the emergence of fluid antenna (FA) in wireless communications, the capability to dynamically adjust port positions offers substantial benefits in spatial diversity and spectrum efficiency, which are particularly valuable for mobile edge computing (MEC) systems. Therefore, we propose an FA-assisted MEC offloading framework to minimize system delay. This framework faces two severe challenges, which are the complexity of channel estimation due to dynamic port configuration and the inherent non-convexity of the joint optimization problem. Firstly, we propose Information Bottleneck Metric-enhanced Channel Compressed Sensing (IBM-CCS), which advances FA channel estimation by integrating information relevance into the sensing process and capturing key features of FA channels effectively. Secondly, to address the non-convex and high-dimensional optimization problem in FA-assisted MEC systems, which includes FA port selection, beamforming, power control, and resource allocation, we propose a game theory-assisted Hierarchical Twin-Dueling Multi-agent Algorithm (HiTDMA) based offloading scheme, where the hierarchical structure effectively decouples and coordinates the optimization tasks between the user side and the base station side. Crucially, the game theory effectively reduces the dimensionality of power control variables, allowing deep reinforcement learning (DRL) agents to achieve improved optimization efficiency. Numerical results confirm that the proposed scheme significantly reduces system delay and enhances offloading performance, outperforming benchmarks. Additionally, the IBM-CCS channel estimation demonstrates superior accuracy and robustness under varying port densities, contributing to efficient communication under imperfect CSI.', 'abstract_zh': '基于流体天线的移动边缘计算卸载框架：复杂信道估计与联合优化难题的解决方案', 'title_zh': '液体天线辅助MEC网络中的联合信道估计算法与计算卸载'}
{'arxiv_id': 'arXiv:2509.19339', 'title': 'Multi-population Ensemble Genetic Programming via Cooperative Coevolution and Multi-view Learning for Classification', 'authors': 'Mohammad Sadegh Khorshidi, Navid Yazdanjue, Hassan Gharoun, Mohammad Reza Nikoo, Fang Chen, Amir H. Gandomi', 'link': 'https://arxiv.org/abs/2509.19339', 'abstract': 'This paper introduces Multi-population Ensemble Genetic Programming (MEGP), a computational intelligence framework that integrates cooperative coevolution and the multiview learning paradigm to address classification challenges in high-dimensional and heterogeneous feature spaces. MEGP decomposes the input space into conditionally independent feature subsets, enabling multiple subpopulations to evolve in parallel while interacting through a dynamic ensemble-based fitness mechanism. Each individual encodes multiple genes whose outputs are aggregated via a differentiable softmax-based weighting layer, enhancing both model interpretability and adaptive decision fusion. A hybrid selection mechanism incorporating both isolated and ensemble-level fitness promotes inter-population cooperation while preserving intra-population diversity. This dual-level evolutionary dynamic facilitates structured search exploration and reduces premature convergence. Experimental evaluations across eight benchmark datasets demonstrate that MEGP consistently outperforms a baseline GP model in terms of convergence behavior and generalization performance. Comprehensive statistical analyses validate significant improvements in Log-Loss, Precision, Recall, F1 score, and AUC. MEGP also exhibits robust diversity retention and accelerated fitness gains throughout evolution, highlighting its effectiveness for scalable, ensemble-driven evolutionary learning. By unifying population-based optimization, multi-view representation learning, and cooperative coevolution, MEGP contributes a structurally adaptive and interpretable framework that advances emerging directions in evolutionary machine learning.', 'abstract_zh': '多群体集成遗传编程：面向高维异构特征空间分类挑战的计算智能框架', 'title_zh': '基于协同进化和多视图学习的多群体集成遗传编程分类方法'}
{'arxiv_id': 'arXiv:2509.19337', 'title': 'Radio Propagation Modelling: To Differentiate or To Deep Learn, That Is The Question', 'authors': 'Stefanos Bakirtzis, Paul Almasan, José Suárez-Varela, Gabriel O. Ferreira, Michail Kalntis, André Felipe Zanella, Ian Wassell, Andra Lutu', 'link': 'https://arxiv.org/abs/2509.19337', 'abstract': 'Differentiable ray tracing has recently challenged the status quo in radio propagation modelling and digital twinning. Promising unprecedented speed and the ability to learn from real-world data, it offers a real alternative to conventional deep learning (DL) models. However, no experimental evaluation on production-grade networks has yet validated its assumed scalability or practical benefits. This leaves mobile network operators (MNOs) and the research community without clear guidance on its applicability. In this paper, we fill this gap by employing both differentiable ray tracing and DL models to emulate radio coverage using extensive real-world data collected from the network of a major MNO, covering 13 cities and more than 10,000 antennas. Our results show that, while differentiable ray-tracing simulators have contributed to reducing the efficiency-accuracy gap, they struggle to generalize from real-world data at a large scale, and they remain unsuitable for real-time applications. In contrast, DL models demonstrate higher accuracy and faster adaptation than differentiable ray-tracing simulators across urban, suburban, and rural deployments, achieving accuracy gains of up to 3 dB. Our experimental results aim to provide timely insights into a fundamental open question with direct implications on the wireless ecosystem and future research.', 'abstract_zh': '可微光线追踪在射频传播建模和数字孪生中的最新进展挑战了传统格局，提供了前所未有的速度，并能够从真实世界数据中学习，为无线通信系统提供了与传统深度学习模型相媲美的实际替代方案。然而，尚无针对生产级网络的实验评估验证其假设的可扩展性和实用优势。这使得移动网络运营商和研究社区在实际应用方面缺乏明确指导。在本文中，我们通过结合使用可微光线追踪和深度学习模型，利用来自一家主要移动网络运营商的广泛真实世界数据，覆盖了13个城市和超过10,000个天线，来填补这一空白。实验结果表明，尽管可微光线追踪模拟器在提高效率-精度折衷方面有所贡献，但在大规模从真实世界数据中泛化方面存在困难，不适用于实时应用。相比之下，深度学习模型在城市、郊区和农村部署中展示了更高的准确性和更快的适应性，实现了高达3 dB的精度提升。我们的实验结果旨在为无线生态系统和未来研究提供及时的、具有直接影响的基本开放问题的见解。', 'title_zh': '无线电波传播建模：是区别建模还是深度学习，这是一个问题。'}
{'arxiv_id': 'arXiv:2509.19335', 'title': 'CSIYOLO: An Intelligent CSI-based Scatter Sensing Framework for Integrated Sensing and Communication Systems', 'authors': 'Xudong Zhang, Jingbo Tan, Zhizhen Ren, Jintao Wang, Yihua Ma, Jian Song', 'link': 'https://arxiv.org/abs/2509.19335', 'abstract': 'ISAC is regarded as a promising technology for next-generation communication systems, enabling simultaneous data transmission and target sensing. Among various tasks in ISAC, scatter sensing plays a crucial role in exploiting the full potential of ISAC and supporting applications such as autonomous driving and low-altitude economy. However, most existing methods rely on either waveform and hardware modifications or traditional signal processing schemes, leading to poor compatibility with current communication systems and limited sensing accuracy. To address these challenges, we propose CSIYOLO, a framework that performs scatter localization only using estimated CSI from a single base station-user equipment pair. This framework comprises two main components: anchor-based scatter parameter detection and CSI-based scatter localization. First, by formulating scatter parameter extraction as an image detection problem, we propose an anchor-based scatter parameter detection method inspired by You Only Look Once architectures. After that, a CSI-based localization algorithm is derived to determine scatter locations with extracted parameters. Moreover, to improve localization accuracy and implementation efficiency, we design an extendable network structure with task-oriented optimizations, enabling multi-scale anchor detection and better adaptation to CSI characteristics. A noise injection training strategy is further designed to enhance robustness against channel estimation errors. Since the proposed framework operates solely on estimated CSI without modifying waveforms or signal processing pipelines, it can be seamlessly integrated into existing communication systems as a plugin. Experiments show that our proposed method can significantly outperform existing methods in scatter localization accuracy with relatively low complexities under varying numbers of scatters and estimation errors.', 'abstract_zh': 'CSIYOLO：基于估计CSI的散射定位框架', 'title_zh': 'CSIYOLO：一种基于智能信道状态信息的散射感知框架用于整合感知与通信系统'}
{'arxiv_id': 'arXiv:2509.19332', 'title': 'Quantifying Compositionality of Classic and State-of-the-Art Embeddings', 'authors': 'Zhijin Guo, Chenhao Xue, Zhaozhen Xu, Hongbo Bo, Yuxuan Ye, Janet B. Pierrehumbert, Martha Lewis', 'link': 'https://arxiv.org/abs/2509.19332', 'abstract': 'For language models to generalize correctly to novel expressions, it is critical that they exploit access compositional meanings when this is justified. Even if we don\'t know what a "pelp" is, we can use our knowledge of numbers to understand that "ten pelps" makes more pelps than "two pelps". Static word embeddings such as Word2vec made strong, indeed excessive, claims about compositionality. The SOTA generative, transformer models and graph models, however, go too far in the other direction by providing no real limits on shifts in meaning due to context. To quantify the additive compositionality, we formalize a two-step, generalized evaluation that (i) measures the linearity between known entity attributes and their embeddings via canonical correlation analysis, and (ii) evaluates additive generalization by reconstructing embeddings for unseen attribute combinations and checking reconstruction metrics such as L2 loss, cosine similarity, and retrieval accuracy. These metrics also capture failure cases where linear composition breaks down. Sentences, knowledge graphs, and word embeddings are evaluated and tracked the compositionality across all layers and training stages. Stronger compositional signals are observed in later training stages across data modalities, and in deeper layers of the transformer-based model before a decline at the top layer. Code is available at this https URL.', 'abstract_zh': '语言模型要正确泛化到新颖表达，必须在适当情况下利用组合意义。即使不知道“pelp”是什么，我们也可以利用对数字的认识理解“十种pelp比两种pelp多”。静态词嵌入如Word2vec对组合性的声明过于强硬，过度夸大了其可能性。然而，当前最先进的生成式transformer模型和图模型则在另一个方向上走得过远，提供了极不现实的意义转化限制。为了量化加性组合性，我们提出了一个两步方法的通用评估框架，即(i)利用典型相关分析测量已知实体属性与其嵌入之间的线性关系，和(ii)通过重构未见属性组合的嵌入并检查重构度量（如L2损失、余弦相似度和检索精度）来评估加性泛化。这些度量也捕捉了线性组合失效的情况。句子、知识图谱和词嵌入在所有层和训练阶段被评估和跟踪其组合性。观察到在训练后期和数据模态中更强的组合性信号，并在基于transformer的模型的深层中出现，在顶层则有所下降。代码详见此链接。', 'title_zh': '经典和当今最先进嵌入表示的组合性量化'}
{'arxiv_id': 'arXiv:2509.19328', 'title': 'Human Activity Recognition Based on Electrocardiogram Data Only', 'authors': 'Sina Montazeri, Waltenegus Dargie, Yunhe Feng, Kewei Sha', 'link': 'https://arxiv.org/abs/2509.19328', 'abstract': 'Human activity recognition is critical for applications such as early intervention and health analytics. Traditional activity recognition relies on inertial measurement units (IMUs), which are resource intensive and require calibration. Although electrocardiogram (ECG)-based methods have been explored, these have typically served as supplements to IMUs or have been limited to broad categorical classification such as fall detection or active vs. inactive in daily activities. In this paper, we advance the field by demonstrating, for the first time, robust recognition of activity only with ECG in six distinct activities, which is beyond the scope of previous work. We design and evaluate three new deep learning models, including a CNN classifier with Squeeze-and-Excitation blocks for channel-wise feature recalibration, a ResNet classifier with dilated convolutions for multiscale temporal dependency capture, and a novel CNNTransformer hybrid combining convolutional feature extraction with attention mechanisms for long-range temporal relationship modeling. Tested on data from 54 subjects for six activities, all three models achieve over 94% accuracy for seen subjects, while CNNTransformer hybrid reaching the best accuracy of 72% for unseen subjects, a result that can be further improved by increasing the training population. This study demonstrates the first successful ECG-only activity classification in multiple physical activities, offering significant potential for developing next-generation wearables capable of simultaneous cardiac monitoring and activity recognition without additional motion sensors.', 'abstract_zh': '仅基于心电图的人类活动识别对于早期干预和健康数据分析至关重要。', 'title_zh': '基于心电图数据的人体活动识别'}
{'arxiv_id': 'arXiv:2509.19323', 'title': 'Magnitude Matters: a Superior Class of Similarity Metrics for Holistic Semantic Understanding', 'authors': 'V.S. Raghu Parupudi', 'link': 'https://arxiv.org/abs/2509.19323', 'abstract': 'Vector comparison in high dimensions is a fundamental task in NLP, yet it is dominated by two baselines: the raw dot product, which is unbounded and sensitive to vector norms, and the cosine similarity, which discards magnitude information entirely. This paper challenges both standards by proposing and rigorously evaluating a new class of parameter-free, magnitude-aware similarity metrics. I introduce two such functions, Overlap Similarity (OS) and Hyperbolic Tangent Similarity (HTS), designed to integrate vector magnitude and alignment in a more principled manner. To ensure that my findings are robust and generalizable, I conducted a comprehensive evaluation using four state-of-the-art sentence embedding models (all-MiniLM-L6-v2, all-mpnet-base-v2, paraphrase-mpnet-base-v2, and BAAI/bge-large-en-v1.5) across a diverse suite of eight standard NLP benchmarks, including STS-B, SICK, Quora, and PAWS. Using the Wilcoxon signed-rank test for statistical significance, my results are definitive: on the tasks requiring holistic semantic understanding (paraphrase and inference), both OS and HTS provide a statistically significant improvement in Mean Squared Error over both the raw dot product and cosine similarity, regardless of the underlying embedding this http URL, my findings delineate the specific domain of advantage for these metrics: for tasks requiring holistic semantic understanding like paraphrase and inference, my magnitude-aware metrics offer a statistically superior alternative. This significant improvement was not observed on benchmarks designed to test highly nuanced compositional semantics (SICK, STS-B), identifying the challenge of representing compositional text as a distinct and important direction for future work.', 'abstract_zh': '高维度向量比较在NLP中是一个基本任务，但主要受两种基线的支配：未加权的点积，其无界且对向量范数敏感，和余弦相似度，其完全忽略了向量的幅度信息。本文通过提出并严格评估一个新的参数自由、幅度感知相似度度量类别，挑战了这两种标准。文中介绍了两种此类函数，重叠相似度（OS）和双曲正切相似度（HTS），旨在以更为合理的方式整合向量幅度和对齐信息。为确保研究结果的稳健性和普遍适用性，研究使用四种当前最先进的句子嵌入模型（all-MiniLM-L6-v2、all-mpnet-base-v2、paraphrase-mpnet-base-v2 和 BAAI/bge-large-en-v1.5）在八个标准NLP基准测试（包括STS-B、SICK、Quora 和 PAWS）上进行了全面评估。利用Wilcoxon符号秩检验统计显著性，研究结果明确显示：在需要整体语义理解的任务（如改写和推理）中，OS 和 HTS 在均方误差方面相对于未加权的点积和余弦相似度提供了统计显著的改进，无论底层嵌入如何。本研究明确了这些度量的具体适用领域：对于需要整体语义理解的任务（如改写和推理），我的幅度感知度量提供了统计上更优的替代方案。这种显著改进未在旨在测试高度细腻组成语义的基准测试（SICK、STS-B）中观察到，这表明表示组成性文本的不同和重要的研究方向。', 'title_zh': '量纲很重要：一种优于整体语义理解的相似度度量类别'}
{'arxiv_id': 'arXiv:2509.19312', 'title': 'E2E Learning Massive MIMO for Multimodal Semantic Non-Orthogonal Transmission and Fusion', 'authors': 'Minghui Wu, Zhen Gao', 'link': 'https://arxiv.org/abs/2509.19312', 'abstract': 'Massive multiple-input multiple-output (MIMO) promises high spectral efficiency but also leads to high-dimensional downlink channel state information (CSI), which complicates real-time channel acquisition and precoding. To address this, we propose an end-to-end (E2E) uplink-downlink CSI fusion precoding network that jointly models downlink CSI reference signal (CSI-RS) design, CSI feedback, and base-station (BS) precoding within a single E2E neural architecture. Concretely, a projection network built on the MAXIM architecture takes uplink sounding reference signals (SRS) as input and outputs frequency-, beam-, and port-domain projection matrices for designing downlink CSI-RS. User equipment (UE) then compresses/quantizes the resulting CSI-RS observations and feeds back a compact representation. At the base station (BS), two complementary branches produce candidate precoders: one is a feedback-only precoding network driven by quantized downlink observations, and the other is an SRS-only precoding network driven by uplink SRS. These candidate precoders are subsequently combined by a fusion precoding network to yield the final transmit precoder. All the modules are trained with a spectral-efficiency-oriented loss under a three-stage schedule. Simulation results show that the proposed approach effectively harnesses both SRS-derived information and UE feedback, achieving markedly better performance than conventional baselines.', 'abstract_zh': '大规模多输入多输出(MIMO) promises高频谱效率但同时也导致了高维下行信道状态信息(CSI)复杂化，这使得实时信道获取和预编码复杂化。为了解决这一问题，我们提出了一种端到端(E2E)上行-下行CSI融合预编码网络，该网络在一个完整的E2E神经架构中联合建模了下行CSI参考信号(CSI-RS)设计、CSI反馈和基站(BS)预编码。具体而言，基于MAXIM架构构建的投影网络以上行探测参考信号(SRS)作为输入，并输出用于设计下行CSI-RS的频域、波束域和端口域投影矩阵。用户设备(UE)随后压缩/量化所得的CSI-RS观测值，并反馈一个紧凑的表示。在基站(BS)，两个互补分支产生候选预编码器：一个由量化下行观测值驱动的反馈仅预编码网络，另一个由上行SRS驱动的SRS仅预编码网络。这些候选预编码器随后由融合预编码网络结合，以生成最终的传输预编码器。所有模块在三阶段训练计划下使用以频谱效率为导向的损失函数进行训练。仿真结果表明，所提出的方法有效地利用了SRS信息和UE反馈，显著优于传统的baseline方法。', 'title_zh': '端到端学习大规模MIMO多模态语义非正交传输与融合'}
{'arxiv_id': 'arXiv:2509.19306', 'title': 'A Federated Fine-Tuning Paradigm of Foundation Models in Heterogenous Wireless Networks', 'authors': 'Jingyi Wang, Zhongyuan Zhao, Qingtian Wang, Zexu Li, Yue Wang, Tony Q. S. Quek', 'link': 'https://arxiv.org/abs/2509.19306', 'abstract': 'Edge intelligence has emerged as a promising strategy to deliver low-latency and ubiquitous services for mobile devices. Recent advances in fine-tuning mechanisms of foundation models have enabled edge intelligence by integrating low-rank adaptation (LoRA) with federated learning. However, in wireless networks, the device heterogeneity and resource constraints on edge devices pose great threats to the performance of federated fine-tuning. To tackle these issues, we propose to optimize federated fine-tuning in heterogenous wireless networks via online learning. First, the framework of switching-based federated fine-tuning in wireless networks is provided. The edge devices switches to LoRA modules dynamically for federated fine-tuning with base station to jointly mitigate the impact of device heterogeneity and transmission unreliability. Second, a tractable upper bound on the inference risk gap is derived based on theoretical analysis. To improve the generalization capability, we formulate a non-convex mixed-integer programming problem with long-term constraints, and decouple it into model switching, transmit power control, and bandwidth allocation subproblems. An online optimization algorithm is developed to solve the problems with polynomial computational complexity. Finally, the simulation results on the SST-2 and QNLI data sets demonstrate the performance gains in test accuracy and energy efficiency.', 'abstract_zh': '基于无线网络异构性的联邦微调在线优化', 'title_zh': '基础模型在异构无线网络中的联邦微调范式'}
