{'arxiv_id': 'arXiv:2505.22599', 'title': 'VR-Based Control of Multi-Copter Operation', 'authors': 'Jack T. Hughes, Mohammad Ghufran, Hossein Rastgoftar', 'link': 'https://arxiv.org/abs/2505.22599', 'abstract': 'We aim to use virtual reality (VR) to improve the spatial awareness of pilots by real-time scanning of the environment around the drone using onboard sensors, live streaming of this environment to a VR headset, and rendering a virtual representation of the drone and its environment for the pilot. This way, the pilot can see the immediate environment of the drone up close from a third-person perspective, as opposed to the first-person perspective that most drone cameras provide. This provides much more information about the drone surroundings for the pilot while operating the drone than existing teleoperation solutions. Previous solutions using VR have relied upon pre-made designs of the environment, which makes it difficult to adapt to changing environments. Our solution, in contrast, scans the environment as you fly, making it much more flexible for use in unknown environments.', 'abstract_zh': '我们旨在通过机载传感器实时扫描无人机周围的环境、将该环境实时传送到VR头显，并为飞行员渲染无人机及其环境的虚拟表示，以利用虚拟现实（VR）提高飞行员的空间意识。这样，飞行员可以从第三人称视角近距离查看无人机的即时环境，而非目前大多数无人机摄像头提供的第一人称视角。这为操作无人机提供了比现有远程操控解决方案更多的环境信息。之前的VR解决方案依赖预先设计的环境设计，难以适应变化的环境。相比之下，我们的解决方案在飞行过程中扫描环境，使其在未知环境中使用更加灵活。', 'title_zh': '基于VR的多旋翼飞行控制'}
{'arxiv_id': 'arXiv:2505.22258', 'title': 'LiDAR Based Semantic Perception for Forklifts in Outdoor Environments', 'authors': 'Benjamin Serfling, Hannes Reichert, Lorenzo Bayerlein, Konrad Doll, Kati Radkhah-Lens', 'link': 'https://arxiv.org/abs/2505.22258', 'abstract': 'In this study, we present a novel LiDAR-based semantic segmentation framework tailored for autonomous forklifts operating in complex outdoor environments. Central to our approach is the integration of a dual LiDAR system, which combines forward-facing and downward-angled LiDAR sensors to enable comprehensive scene understanding, specifically tailored for industrial material handling tasks. The dual configuration improves the detection and segmentation of dynamic and static obstacles with high spatial precision. Using high-resolution 3D point clouds captured from two sensors, our method employs a lightweight yet robust approach that segments the point clouds into safety-critical instance classes such as pedestrians, vehicles, and forklifts, as well as environmental classes such as driveable ground, lanes, and buildings. Experimental validation demonstrates that our approach achieves high segmentation accuracy while satisfying strict runtime requirements, establishing its viability for safety-aware, fully autonomous forklift navigation in dynamic warehouse and yard environments.', 'abstract_zh': '本研究提出了一种针对复杂户外环境下的自主叉车设计的新型LiDAR语义分割框架。该方法的核心是结合使用前后向和下倾角LiDAR传感器的双LiDAR系统，以实现针对工业物料搬运任务的全面场景理解。双配置提高了对动态和静态障碍物的检测和分割精度，同时保持高空间分辨率。通过两个传感器捕获的高分辨率3D点云，我们的方法采用一种轻量级且 robust 的方法将点云分割为行人、车辆、叉车等关键安全实例类以及道路可通行地面、车道和建筑物等环境类。实验验证表明，该方法在满足严格的实时要求下实现了高分割精度，证明了其在动态仓库和作业环境下的安全性感知自主导航的可行性。', 'title_zh': '基于LiDAR的叉车室外环境语义感知'}
{'arxiv_id': 'arXiv:2505.22094', 'title': 'ReinFlow: Fine-tuning Flow Matching Policy with Online Reinforcement Learning', 'authors': 'Tonghe Zhang, Yu Chao, Sicang Su, Yu Wang', 'link': 'https://arxiv.org/abs/2505.22094', 'abstract': "We propose ReinFlow, a simple yet effective online reinforcement learning (RL) framework that fine-tunes a family of flow matching policies for continuous robotic control. Derived from rigorous RL theory, ReinFlow injects learnable noise into a flow policy's deterministic path, converting the flow into a discrete-time Markov Process for exact and straightforward likelihood computation. This conversion facilitates exploration and ensures training stability, enabling ReinFlow to fine-tune diverse flow model variants, including Rectified Flow [35] and Shortcut Models [19], particularly at very few or even one denoising step. We benchmark ReinFlow in representative locomotion and manipulation tasks, including long-horizon planning with visual input and sparse reward. The episode reward of Rectified Flow policies obtained an average net growth of 135.36% after fine-tuning in challenging legged locomotion tasks while saving denoising steps and 82.63% of wall time compared to state-of-the-art diffusion RL fine-tuning method DPPO [43]. The success rate of the Shortcut Model policies in state and visual manipulation tasks achieved an average net increase of 40.34% after fine-tuning with ReinFlow at four or even one denoising step, whose performance is comparable to fine-tuned DDIM policies while saving computation time for an average of 23.20%. Project Webpage: this https URL", 'abstract_zh': '我们提出ReinFlow，一种简单有效的在线强化学习框架，用于细化一类流匹配策略以实现连续机器人控制。', 'title_zh': 'ReinFlow：基于在线强化学习的流匹配策略微调'}
{'arxiv_id': 'arXiv:2505.21992', 'title': 'Soft Electrothermal Meta-Actuator for Robust Multifunctional Control', 'authors': 'Hanseong Jo, Pavel Shafirin, Christopher Le, Caden Chan, Artur Davoyan', 'link': 'https://arxiv.org/abs/2505.21992', 'abstract': "Soft electrothermal actuators are of great interest in diverse application domains for their simplicity, compliance, and ease of control. However, the very nature of thermally induced mechanical actuation sets inherent operation constraints: unidirectional motion, environmental sensitivity, and slow response times limited by passive cooling. To overcome these constraints, we propose a meta-actuator architecture, which uses engineered heat transfer in thin films to achieve multifunctional operation. We demonstrate electrically selectable bidirectional motion with large deflection ($ \\geq $28% of actuator length at 0.75 W), suppressed thermal sensitivity to ambient temperature changes when compared to conventional actuators (>100$ \\times $ lower), and actively forced return to the rest state, which is 10 times faster than that with passive cooling. We further show that our meta-actuator approach enables extended ranges of motions for manipulating complex objects. Versatile soft gripper operations highlight the meta-actuator's potential for soft robotics and devices.", 'abstract_zh': '软电热执行器由于其简单性、柔顺性和易于控制而在多个应用领域引起了极大的兴趣。然而，由热引起的机械运动的本质设置了固有的操作限制：单向运动、环境敏感性和受限于被动冷却的缓慢响应时间。为克服这些限制，我们提出了一种元执行器架构，该架构利用薄层中的工程化热传递来实现多功能操作。我们展示了可电选的双向大行程运动（在0.75 W时 ≥28%的执行器长度）、与传统执行器相比热环境敏感性降低了100倍以上、以及快速主动返回原始状态，其速度比被动冷却快10倍。此外，我们进一步表明，我们的元执行器方法能够扩展用于操控复杂对象的运动范围。多功能软夹持器操作突显了元执行器在软机器人和设备领域的潜力。', 'title_zh': '软电热元驱动器用于 robust 的多功能控制'}
{'arxiv_id': 'arXiv:2505.22404', 'title': 'Efficient Precision-Scalable Hardware for Microscaling (MX) Processing in Robotics Learning', 'authors': 'Stef Cuyckens, Xiaoling Yi, Nitish Satya Murthy, Chao Fang, Marian Verhelst', 'link': 'https://arxiv.org/abs/2505.22404', 'abstract': 'Autonomous robots require efficient on-device learning to adapt to new environments without cloud dependency. For this edge training, Microscaling (MX) data types offer a promising solution by combining integer and floating-point representations with shared exponents, reducing energy consumption while maintaining accuracy. However, the state-of-the-art continuous learning processor, namely Dacapo, faces limitations with its MXINT-only support and inefficient vector-based grouping during backpropagation. In this paper, we present, to the best of our knowledge, the first work that addresses these limitations with two key innovations: (1) a precision-scalable arithmetic unit that supports all six MX data types by exploiting sub-word parallelism and unified integer and floating-point processing; and (2) support for square shared exponent groups to enable efficient weight handling during backpropagation, removing storage redundancy and quantization overhead. We evaluate our design against Dacapo under iso-peak-throughput on four robotics workloads in TSMC 16nm FinFET technology at 500MHz, reaching a 25.6% area reduction, a 51% lower memory footprint, and 4x higher effective training throughput while achieving comparable energy-efficiency, enabling efficient robotics continual learning at the edge.', 'abstract_zh': '自主机器人需要高效的设备端学习以在无需云依赖的情况下适应新环境。为此边缘训练需求，Microscaling (MX) 数据类型通过结合整数和浮点表示并共享指数，提供了 promising 的解决方案，同时减少能耗并保持准确度。然而，最先进的连续学习处理器 Dacapo 受限于其仅支持 MXINT 并且在反向传播期间向量基分组效率低下。本文提出了我们所知的首个解决这些限制的方法，提出了两项关键技术创新：(1) 一种精度可扩展的算术单元，通过利用子词并行性和统一的整数和浮点处理，支持所有六种 MX 数据类型；(2) 支持方形共享指数分组，以在反向传播期间实现高效权重处理，移除存储冗余和量化开销。我们在 TSMC 16nm FinFET 技术下以500MHz的等峰值吞吐量对我们的设计与 Dacapo 进行评估，实现了 25.6% 的面积缩减，51% 更低的内存占用，并且有效训练吞吐量提高4倍，同时保持可比拟的能效，从而在边缘实现高效的机器人持续学习。', 'title_zh': '适用于机器人学习的微缩处理(MX)高效可扩展精度硬件'}
