{'arxiv_id': 'arXiv:2509.03436', 'title': 'Cost-Optimized Systems Engineering for IoT-Enabled Robot Nurse in Infectious Pandemic Management', 'authors': 'Md Mhamud Hussen Sifat, Md Maruf, Md Rokunuzzaman', 'link': 'https://arxiv.org/abs/2509.03436', 'abstract': "The utilization of robotic technology has gained traction in healthcare facilities due to progress in the field that enables time and cost savings, minimizes waste, and improves patient care. Digital healthcare technologies that leverage automation, such as robotics and artificial intelligence, have the potential to enhance the sustainability and profitability of healthcare systems in the long run. However, the recent COVID-19 pandemic has amplified the need for cyber-physical robots to automate check-ups and medication administration. A robot nurse is controlled by the Internet of Things (IoT) and can serve as an automated medical assistant while also allowing supervisory control based on custom commands. This system helps reduce infection risk and improves outcomes in pandemic settings. This research presents a test case with a nurse robot that can assess a patient's health status and take action accordingly. We also evaluate the system's performance in medication administration, health-status monitoring, and life-cycle considerations.", 'abstract_zh': '机器人技术在医疗设施中的应用由于能够节省时间与成本、减少浪费并改善患者护理而逐渐受到重视。利用自动化技术的数字 healthcare 技术，如机器人和人工智能，有潜力在长期内提高 healthcare 系统的可持续性和盈利能力。然而，近期的 COVID-19 大流行放大了对用于自动化检查和药物管理的网络物理机器人的需求。一种由物联网（IoT）控制的机器人护士可以作为自动化医疗助手，并允许基于自定义命令的监督控制。该系统有助于减少感染风险并在大流行环境中改善结果。本研究介绍了一个护士机器人测试案例，该机器人能够评估患者健康状况并相应采取行动。我们还评估了该系统在药物管理、健康状况监测和生命周期考虑方面的性能。', 'title_zh': '物联网赋能感染性疫情管理中成本优化的护理机器人系统工程'}
{'arxiv_id': 'arXiv:2509.03261', 'title': 'Parallel-Constraint Model Predictive Control: Exploiting Parallel Computation for Improving Safety', 'authors': 'Elias Fontanari, Gianni Lunardi, Matteo Saveriano, Andrea Del Prete', 'link': 'https://arxiv.org/abs/2509.03261', 'abstract': 'Ensuring constraint satisfaction is a key requirement for safety-critical systems, which include most robotic platforms. For example, constraints can be used for modeling joint position/velocity/torque limits and collision avoidance. Constrained systems are often controlled using Model Predictive Control, because of its ability to naturally handle constraints, relying on numerical optimization. However, ensuring constraint satisfaction is challenging for nonlinear systems/constraints. A well-known tool to make controllers safe is the so-called control-invariant set (a.k.a. safe set). In our previous work, we have shown that safety can be improved by letting the safe-set constraint recede along the MPC horizon. In this paper, we push that idea further by exploiting parallel computation to improve safety. We solve several MPC problems at the same time, where each problem instantiates the safe-set constraint at a different time step along the horizon. Finally, the controller can select the best solution according to some user-defined criteria. We validated this idea through extensive simulations with a 3-joint robotic arm, showing that significant improvements can be achieved in terms of safety and performance, even using as little as 4 computational cores.', 'abstract_zh': '确保约束满足是安全关键系统的关键要求，这些系统包括大多数机器人平台。例如，约束可用于建模关节位置/速度/扭矩限制和避碰。对于非线性系统/约束，确保约束满足具有挑战性。一种使控制器安全的已知工具是所谓的不变控制集（又称安全集）。在我们之前的工作中，我们已经展示了通过让安全集约束沿MPC时间轴退化来提高安全性。在本文中，我们通过利用并行计算进一步推进了这一理念，通过同时求解多个MPC问题，每个问题在时间轴上的不同时间步长实例化安全集约束。最后，控制器可以根据一些用户定义的标准选择最佳解决方案。我们通过广泛的仿真（使用一个3关节机器人臂）验证了这一理念，即使仅使用4个计算内核，也能在安全性和性能方面取得显著改进。', 'title_zh': '并行约束模型预测控制：利用并行计算提高安全性'}
{'arxiv_id': 'arXiv:2509.03238', 'title': 'Vibration Damping in Underactuated Cable-suspended Artwork -- Flying Belt Motion Control', 'authors': 'Martin Goubej, Lauria Clarke, Martin Hrabačka, David Tolar', 'link': 'https://arxiv.org/abs/2509.03238', 'abstract': 'This paper presents a comprehensive refurbishment of the interactive robotic art installation Standards and Double Standards by Rafael Lozano-Hemmer. The installation features an array of belts suspended from the ceiling, each actuated by stepper motors and dynamically oriented by a vision-based tracking system that follows the movements of exhibition visitors. The original system was limited by oscillatory dynamics, resulting in torsional and pendulum-like vibrations that constrained rotational speed and reduced interactive responsiveness. To address these challenges, the refurbishment involved significant upgrades to both hardware and motion control algorithms. A detailed mathematical model of the flying belt system was developed to accurately capture its dynamic behavior, providing a foundation for advanced control design. An input shaping method, formulated as a convex optimization problem, was implemented to effectively suppress vibrations, enabling smoother and faster belt movements. Experimental results demonstrate substantial improvements in system performance and audience interaction. This work exemplifies the integration of robotics, control engineering, and interactive art, offering new solutions to technical challenges in real-time motion control and vibration damping for large-scale kinetic installations.', 'abstract_zh': '本文对Rafael Lozano-Hemmer的互动机器人艺术装置《标准与双重标准》进行了全面修复。该装置由悬挂于天花板下的传送带阵列组成，每条传送带由步进电机驱动，并通过基于视觉的跟踪系统动态定向，该系统跟踪展览参观者的运动。原始系统受限于振荡动态，导致扭曲和摆动般的振动，限制了旋转速度并降低了交互响应性。为解决这些挑战，修复工作包括硬件和运动控制算法的重大升级。开发了飞带系统的详细数学模型，以准确捕捉其动态行为，为先进的控制设计提供了基础。实施了一种作为凸优化问题形式的输入 shaping 方法，有效地抑制了振动，使传送带的运动更加平滑和快速。实验结果表明系统性能和观众互动有了显著改进。这项工作体现了机器人学、控制工程和互动艺术的整合，提供了实时运动控制和大型动态装置振动抑制的技术解决方案。', 'title_zh': '无动作冗余的悬索艺术品减振——飞行带运动控制'}
{'arxiv_id': 'arXiv:2509.03119', 'title': 'Forbal: Force Balanced 2-5 Degree of Freedom Robot Manipulator Built from a Five Bar Linkage', 'authors': 'Yash Vyas, Matteo Bottin', 'link': 'https://arxiv.org/abs/2509.03119', 'abstract': 'A force balanced manipulator design based on the closed chain planar five bar linkage is developed and experimentally validated. We present 2 variants as a modular design: Forbal-2, a planar 2-DOF manipulator, and its extension to 5-DOF spatial motion called Forbal-5. The design considerations in terms of geometric, kinematic, and dynamic design that fulfill the force balance conditions while maximizing workspace are discussed. Then, the inverse kinematics of both variants are derived from geometric principles.\nWe validate the improvements from force balancing the manipulator through comparative experiments with counter mass balanced and unbalanced configurations. The results show how the balanced configuration yields a reduction in the average reaction moments of up to 66\\%, a reduction of average joint torques of up to 79\\%, as well as a noticeable reduction in position error for Forbal-2. For Forbal-5, which has a higher end effector payload mass, the joint torques are reduced up to 84\\% for the balanced configuration. Experimental results validate that the balanced manipulator design is suitable for applications where the reduction of joint torques and reaction forces/moments helps achieve millimeter level precision.', 'abstract_zh': '基于闭链平面五连杆的力平衡 manipulator 设计及实验验证：Forbal-2 和 Forbal-5 的模块化设计与逆运动学分析及其力平衡配置的优势验证', 'title_zh': 'Forbal：基于五杆机构的二至五自由度力平衡机器人 manipulator'}
{'arxiv_id': 'arXiv:2509.02983', 'title': 'DUViN: Diffusion-Based Underwater Visual Navigation via Knowledge-Transferred Depth Features', 'authors': 'Jinghe Yang, Minh-Quan Le, Mingming Gong, Ye Pu', 'link': 'https://arxiv.org/abs/2509.02983', 'abstract': 'Autonomous underwater navigation remains a challenging problem due to limited sensing capabilities and the difficulty of constructing accurate maps in underwater environments. In this paper, we propose a Diffusion-based Underwater Visual Navigation policy via knowledge-transferred depth features, named DUViN, which enables vision-based end-to-end 4-DoF motion control for underwater vehicles in unknown environments. DUViN guides the vehicle to avoid obstacles and maintain a safe and perception awareness altitude relative to the terrain without relying on pre-built maps. To address the difficulty of collecting large-scale underwater navigation datasets, we propose a method that ensures robust generalization under domain shifts from in-air to underwater environments by leveraging depth features and introducing a novel model transfer strategy. Specifically, our training framework consists of two phases: we first train the diffusion-based visual navigation policy on in-air datasets using a pre-trained depth feature extractor. Secondly, we retrain the extractor on an underwater depth estimation task and integrate the adapted extractor into the trained navigation policy from the first step. Experiments in both simulated and real-world underwater environments demonstrate the effectiveness and generalization of our approach. The experimental videos are available at this https URL.', 'abstract_zh': '基于知识迁移深度特征的自主水下视觉导航政策：DUViN', 'title_zh': 'DUViN：基于扩散的知识转移深度特征 underwater视觉导航'}
{'arxiv_id': 'arXiv:2509.02870', 'title': 'Robotic 3D Flower Pose Estimation for Small-Scale Urban Farms', 'authors': 'Harsh Muriki, Hong Ray Teo, Ved Sengupta, Ai-Ping Hu', 'link': 'https://arxiv.org/abs/2509.02870', 'abstract': 'The small scale of urban farms and the commercial availability of low-cost robots (such as the FarmBot) that automate simple tending tasks enable an accessible platform for plant phenotyping. We have used a FarmBot with a custom camera end-effector to estimate strawberry plant flower pose (for robotic pollination) from acquired 3D point cloud models. We describe a novel algorithm that translates individual occupancy grids along orthogonal axes of a point cloud to obtain 2D images corresponding to the six viewpoints. For each image, 2D object detection models for flowers are used to identify 2D bounding boxes which can be converted into the 3D space to extract flower point clouds. Pose estimation is performed by fitting three shapes (superellipsoids, paraboloids and planes) to the flower point clouds and compared with manually labeled ground truth. Our method successfully finds approximately 80% of flowers scanned using our customized FarmBot platform and has a mean flower pose error of 7.7 degrees, which is sufficient for robotic pollination and rivals previous results. All code will be made available at this https URL.', 'abstract_zh': '小型城市农场和商业化的低成本机器人（如FarmBot）实现简单养护任务的自动化，为植物表型分析提供了一个可访问的平台。我们使用具有自定义相机末端执行器的FarmBot，从获取的3D点云模型中估算草莓植株花的姿态（用于机器人授粉）。我们描述了一种新颖的算法，该算法将点云沿正交轴的单个占用网格转换为对应于六个视点的2D图像。对于每张图像，使用2D物体检测模型检测花朵，并将其2D边界框转换到3D空间以提取花朵点云。姿态估计通过将三个形状（超椭球、抛物面和平面）拟合到花朵点云并与手动标注的真实标注进行比较。我们的方法成功地在自定义的FarmBot平台上扫描约80%的花朵，并且平均花朵姿态误差为7.7度，足以用于机器人授粉，且优于先前的结果。所有代码将于以下网址公开：https://this-url。', 'title_zh': '小型城市农场中基于机器人的三维花朵姿态估计'}
{'arxiv_id': 'arXiv:2509.03430', 'title': 'EclipseTouch: Touch Segmentation on Ad Hoc Surfaces using Worn Infrared Shadow Casting', 'authors': 'Vimal Mollyn, Nathan DeVrio, Chris Harrison', 'link': 'https://arxiv.org/abs/2509.03430', 'abstract': 'The ability to detect touch events on uninstrumented, everyday surfaces has been a long-standing goal for mixed reality systems. Prior work has shown that virtual interfaces bound to physical surfaces offer performance and ergonomic benefits over tapping at interfaces floating in the air. A wide variety of approaches have been previously developed, to which we contribute a new headset-integrated technique called \\systemname. We use a combination of a computer-triggered camera and one or more infrared emitters to create structured shadows, from which we can accurately estimate hover distance (mean error of 6.9~mm) and touch contact (98.0\\% accuracy). We discuss how our technique works across a range of conditions, including surface material, interaction orientation, and environmental lighting.', 'abstract_zh': '混合现实系统中对未标记日常表面的触觉事件检测能力一直是长期目标。我们贡献了一种新的头戴式集成技术\\systename，该技术利用计算机触发的摄像头和一个或多个红外发射器来创建结构化阴影，从而可以准确估计悬浮距离（平均误差6.9毫米）和触觉接触（准确率98.0%）。我们讨论了该技术在多种条件下的工作情况，包括表面材质、交互方向和环境照明。', 'title_zh': 'EclipseTouch：穿戴式红外投影像素分割adhoc表面触摸操作'}
{'arxiv_id': 'arXiv:2509.03381', 'title': 'Dependency Chain Analysis of ROS 2 DDS QoS Policies: From Lifecycle Tutorial to Static Verification', 'authors': 'Sanghoon Lee, Junha Kang, Kyung-Joon Park', 'link': 'https://arxiv.org/abs/2509.03381', 'abstract': 'Robot Operating System 2 (ROS 2) relies on the Data Distribution Service (DDS), which offers more than 20 Quality of Service (QoS) policies governing availability, reliability, and resource usage. Yet ROS 2 users lack clear guidance on safe policy combinations and validation processes prior to deployment, which often leads to trial-and-error tuning and unexpected runtime failures. To address these challenges, we analyze DDS Publisher-Subscriber communication over a life cycle divided into Discovery, Data Exchange, and Disassociation, and provide a user oriented tutorial explaining how 16 QoS policies operate in each phase. Building on this analysis, we derive a QoS dependency chain that formalizes inter-policy relationships and classifies 41 dependency violation rules, capturing constraints that commonly cause communication failures in practice. Finally, we introduce QoS Guard, a ROS 2 package that statically validates DDS XML profiles offline, flags conflicts, and enables safe, predeployment tuning without establishing a live ROS 2 session. Together, these contributions give ROS 2 users both conceptual insight and a concrete tool that enables early detection of misconfigurations, improving the reliability and resource efficiency of ROS 2 based robotic systems.', 'abstract_zh': 'ROS 2中的Data Distribution Service (DDS)提供了超过20种服务质量（QoS）策略， governs可用性、可靠性和资源使用。然而，ROS 2用户缺乏明确的策略组合和部署前验证指导，这通常导致试错调整和意外的运行时故障。为解决这些挑战，我们按生命周期划分为发现、数据交换和脱离阶段分析DDS发布者-订阅者通信，并提供面向用户的教程解释每个阶段中如何运行16种QoS策略。基于这一分析，我们推导出一种QoS依赖链，明确了策略之间的关系，并分类出41条依赖违规规则，捕捉实践中常见的通信故障限制条件。最后，我们介绍了QoS Guard，这是一个ROS 2包，可以在离线情况下静态验证DDS XML配置文件，标记冲突，并在无需建立实时ROS 2会话的情况下实现安全的部署前调整。这些贡献为ROS 2用户提供了概念性的见解和一个具体的工具，以便早期检测配置错误，提高基于ROS 2的机器人系统的可靠性和资源效率。', 'title_zh': 'ROS 2 DDS QoS策略的依赖链分析：从生命周期教程到静态验证'}
{'arxiv_id': 'arXiv:2508.19805', 'title': 'Separation of Three or More Autonomous Mobile Models under Hierarchical Schedulers', 'authors': 'Shota Naito, Tsukasa Ninomiya, Koichi Wada', 'link': 'https://arxiv.org/abs/2508.19805', 'abstract': 'Understanding the computational power of mobile robot systems is a fundamental challenge in distributed computing. While prior work has focused on pairwise separations between models, we explore how robot capabilities, light observability, and scheduler synchrony interact in more complex ways.\nWe first show that the Exponential Times Expansion (ETE) problem is solvable only in the strongest model -- fully-synchronous robots with full mutual lights ($\\mathcal{LUMT}^F$). We then introduce the Hexagonal Edge Traversal (HET) and TAR(d)* problems to demonstrate how internal memory and lights interact with synchrony: under weak synchrony, internal memory alone is insufficient, while full synchrony can substitute for both lights and memory.\nIn the asynchronous setting, we classify problems such as LP-MLCv, VEC, and ZCC to show fine-grained separations between $\\mathcal{FSTA}$ and $\\mathcal{FCOM}$ robots. We also analyze Vertex Traversal Rendezvous (VTR) and Leave Place Convergence (LP-Cv), illustrating the limitations of internal memory in symmetric settings.\nThese results extend the known separation map of 14 canonical robot models, revealing structural phenomena only visible through higher-order comparisons. Our work provides new impossibility criteria and deepens the understanding of how observability, memory, and synchrony collectively shape the computational power of mobile robots.', 'abstract_zh': '理解移动机器人系统的计算能力是分布式计算中的基本挑战。在先前的工作主要关注模型之间的成对分离时，我们探讨了机器人能力、光线可观察性和调度同步性在更复杂交互中的作用。', 'title_zh': '三种及以上自主移动模型在分层调度器下的分离方法'}
{'arxiv_id': 'arXiv:2509.02808', 'title': 'Improving the Resilience of Quadrotors in Underground Environments by Combining Learning-based and Safety Controllers', 'authors': 'Isaac Ronald Ward, Mark Paral, Kristopher Riordan, Mykel J. Kochenderfer', 'link': 'https://arxiv.org/abs/2509.02808', 'abstract': "Autonomously controlling quadrotors in large-scale subterranean environments is applicable to many areas such as environmental surveying, mining operations, and search and rescue. Learning-based controllers represent an appealing approach to autonomy, but are known to not generalize well to `out-of-distribution' environments not encountered during training. In this work, we train a normalizing flow-based prior over the environment, which provides a measure of how far out-of-distribution the quadrotor is at any given time. We use this measure as a runtime monitor, allowing us to switch between a learning-based controller and a safe controller when we are sufficiently out-of-distribution. Our methods are benchmarked on a point-to-point navigation task in a simulated 3D cave environment based on real-world point cloud data from the DARPA Subterranean Challenge Final Event Dataset. Our experimental results show that our combined controller simultaneously possesses the liveness of the learning-based controller (completing the task quickly) and the safety of the safety controller (avoiding collision).", 'abstract_zh': '自主控制大型地下环境中的四旋翼无人机适用于环境调查、采矿操作和搜救等领域。基于学习的控制器是一种有吸引力的自主控制方法，但它们在未在训练中遇到的“分布外”环境中缺乏泛化能力。在本工作中，我们训练了一个环境的标准化流先验，提供了一个衡量四旋翼无人机在任意给定时刻分布外程度的指标。我们使用此指标作为运行时监控器，允许我们在分布外程度足够高时切换到安全控制器。我们的方法基于 DARPA 地下挑战赛最终赛事数据生成的真实点云数据构建了一个3D地下洞穴模拟环境中的点到点导航任务进行基准测试。实验结果表明，我们的结合控制器同时具备基于学习控制器的活性（快速完成任务）和安全控制器的安全性（避免碰撞）。', 'title_zh': '基于学习型和安全型控制器结合的方法提高地下环境中四旋翼无人机的抗干扰能力'}
