{'arxiv_id': 'arXiv:2511.10598', 'title': 'Optimizing the flight path for a scouting Uncrewed Aerial Vehicle', 'authors': 'Raghav Adhikari, Sachet Khatiwada, Suman Poudel', 'link': 'https://arxiv.org/abs/2511.10598', 'abstract': 'Post-disaster situations pose unique navigation challenges. One of those challenges is the unstructured nature of the environment, which makes it hard to layout paths for rescue vehicles. We propose the use of Uncrewed Aerial Vehicle (UAV) in such scenario to perform reconnaissance across the environment. To accomplish this, we propose an optimization-based approach to plan a path for the UAV at optimal height where the sensors of the UAV can cover the most area and collect data with minimum uncertainty.', 'abstract_zh': '灾难后的情况提出了独特的导航挑战。其中一项挑战是环境的无结构特性，这使得为救援车辆规划路径变得困难。我们提议在 such 场景中使用无人机（UAV）进行环境 Reconnaissance。为此，我们提出了一种基于优化的方法，用于为无人机规划在最佳高度上的路径，以使无人机的传感器能够覆盖最大面积并以最小的不确定性收集数据。', 'title_zh': '优化侦察无人驾驶航空器的飞行路径'}
{'arxiv_id': 'arXiv:2511.10580', 'title': 'From Fold to Function: Dynamic Modeling and Simulation-Driven Design of Origami Mechanisms', 'authors': 'Tianhui Han, Shashwat Singh, Sarvesh Patil, Zeynep Temel', 'link': 'https://arxiv.org/abs/2511.10580', 'abstract': "Origami-inspired mechanisms can transform flat sheets into functional three-dimensional dynamic structures that are lightweight, compact, and capable of complex motion. These properties make origami increasingly valuable in robotic and deployable systems. However, accurately simulating their folding behavior and interactions with the environment remains challenging. To address this, we present a design framework for origami mechanism simulation that utilizes MuJoCo's deformable-body capabilities. In our approach, origami sheets are represented as graphs of interconnected deformable elements with user-specified constraints such as creases and actuation, defined through an intuitive graphical user interface (GUI). This framework allows users to generate physically consistent simulations that capture both the geometric structure of origami mechanisms and their interactions with external objects and surfaces. We demonstrate our method's utility through a case study on an origami catapult, where design parameters are optimized in simulation using the Covariance Matrix Adaptation Evolution Strategy (CMA-ES) and validated experimentally on physical prototypes. The optimized structure achieves improved throwing performance, illustrating how our system enables rapid, simulation-driven origami design, optimization, and analysis.", 'abstract_zh': 'origami-inspired 机制可以将扁平板材转化为轻巧、紧凑且具备复杂运动功能的三维动态结构。这些特性使其在机器人和可展系统中越来越有价值。然而，准确模拟其折叠行为及其与环境的相互作用仍然具有挑战性。为此，我们提出了一种利用 MuJoCo 可变形体能力的 origami 机制仿真设计框架。在我们的方法中，origami 表面通过包含用户指定约束（如折痕和驱动）的相互连接的可变形元件表示，并通过直观的图形用户界面（GUI）进行定义。该框架允许用户生成物理上一致的仿真，既能捕捉 origami 机制的几何结构，又能反映其与外部物体和表面的相互作用。我们通过一个 origami 弹射器案例研究演示了该方法的实用性，其中利用 Covariance Matrix Adaptation Evolution Strategy (CMA-ES) 在仿真中优化设计参数，并在物理原型上进行实验验证。优化后的结构实现了更好的投掷性能，展示了我们的系统如何实现快速、基于仿真的 origami 设计、优化和分析。', 'title_zh': '从折叠到功能： Origami机制的动态建模与仿真驱动设计'}
{'arxiv_id': 'arXiv:2511.10448', 'title': 'Improving dependability in robotized bolting operations', 'authors': 'Lorenzo Pagliara, Violeta Redondo, Enrico Ferrentino, Manuel Ferre, Pasquale Chiacchio', 'link': 'https://arxiv.org/abs/2511.10448', 'abstract': "Bolting operations are critical in industrial assembly and in the maintenance of scientific facilities, requiring high precision and robustness to faults. Although robotic solutions have the potential to improve operational safety and effectiveness, current systems still lack reliable autonomy and fault management capabilities. To address this gap, we propose a control framework for dependable robotized bolting tasks and instantiate it on a specific robotic system. The system features a control architecture ensuring accurate driving torque control and active compliance throughout the entire operation, enabling safe interaction even under fault conditions. By designing a multimodal human-robot interface (HRI) providing real-time visualization of relevant system information and supporting seamless transitions between automatic and manual control, we improve operator situation awareness and fault detection capabilities. A high-level supervisor (SV) coordinates the execution and manages transitions between control modes, ensuring consistency with the supervisory control (SVC) paradigm, while preserving the human operator's authority. The system is validated in a representative bolting operation involving pipe flange joining, under several fault conditions. The results demonstrate improved fault detection capabilities, enhanced operator situational awareness, and accurate and compliant execution of the bolting operation. However, they also reveal the limitations of relying on a single camera to achieve full situational awareness.", 'abstract_zh': '机器人化紧固作业的控制框架及其在特定机器人系统中的实现：面向可靠的故障管理与操作安全性', 'title_zh': '提高机器人化锚喷作业的可靠性'}
{'arxiv_id': 'arXiv:2511.10276', 'title': 'RoboBenchMart: Benchmarking Robots in Retail Environment', 'authors': 'Konstantin Soshin, Alexander Krapukhin, Andrei Spiridonov, Denis Shepelev, Gregorii Bukhtuev, Andrey Kuznetsov, Vlad Shakhuro', 'link': 'https://arxiv.org/abs/2511.10276', 'abstract': 'Most existing robotic manipulation benchmarks focus on simplified tabletop scenarios, typically involving a stationary robotic arm interacting with various objects on a flat surface. To address this limitation, we introduce RoboBenchMart, a more challenging and realistic benchmark designed for dark store environments, where robots must perform complex manipulation tasks with diverse grocery items. This setting presents significant challenges, including dense object clutter and varied spatial configurations -- with items positioned at different heights, depths, and in close proximity. By targeting the retail domain, our benchmark addresses a setting with strong potential for near-term automation impact. We demonstrate that current state-of-the-art generalist models struggle to solve even common retail tasks. To support further research, we release the RoboBenchMart suite, which includes a procedural store layout generator, a trajectory generation pipeline, evaluation tools and fine-tuned baseline models.', 'abstract_zh': 'RoboBenchMart：面向黑暗仓库环境的复杂物流机器人操作基准', 'title_zh': 'RoboBenchMart: 零售环境中机器人系统的基准测试'}
{'arxiv_id': 'arXiv:2511.09885', 'title': 'PuffyBot: An Untethered Shape Morphing Robot for Multi-environment Locomotion', 'authors': 'Shashwat Singh, Zilin Si, Zeynep Temel', 'link': 'https://arxiv.org/abs/2511.09885', 'abstract': 'Amphibians adapt their morphologies and motions to accommodate movement in both terrestrial and aquatic environments. Inspired by these biological features, we present PuffyBot, an untethered shape morphing robot capable of changing its body morphology to navigate multiple environments. Our robot design leverages a scissor-lift mechanism driven by a linear actuator as its primary structure to achieve shape morphing. The transformation enables a volume change from 255.00 cm3 to 423.75 cm3, modulating the buoyant force to counteract a downward force of 3.237 N due to 330 g mass of the robot. A bell-crank linkage is integrated with the scissor-lift mechanism, which adjusts the servo-actuated limbs by 90 degrees, allowing a seamless transition between crawling and swimming modes. The robot is fully waterproof, using thermoplastic polyurethane (TPU) fabric to ensure functionality in aquatic environments. The robot can operate untethered for two hours with an onboard battery of 1000 mA h. Our experimental results demonstrate multi-environment locomotion, including crawling on the land, crawling on the underwater floor, swimming on the water surface, and bimodal buoyancy adjustment to submerge underwater or resurface. These findings show the potential of shape morphing to create versatile and energy efficient robotic platforms suitable for diverse environments.', 'abstract_zh': '两栖动物适应其形态和运动以适应陆地和水生环境的变化。受此生物特征的启发，我们提出了PuffyBot，一种无需缆绳的形态变化机器人，能够改变其身体形态以导航多个环境。我们的机器人设计利用由线性执行器驱动的剪式升降机构作为主要结构，实现形态变化。这种变换使得体积从255.00 cm³变化到423.75 cm³，调节浮力以抵消330 g机器人质量产生的3.237 N下向力。摆杆连杆与剪式升降机构集成，通过90度调整伺服驱动的肢体，实现爬行模式和游泳模式之间的无缝转换。机器人完全防水，使用热塑性聚氨酯（TPU）织物确保其在水生环境中的功能。机器人配备1000 mA h的内置电池，可以在未缆绳束缚的情况下运行两小时。我们的实验结果展示了多环境移动能力，包括在陆地上爬行、在水下地板上爬行、在水面游泳以及双模式浮力调节以潜入水中或浮出水面。这些发现表明形态变化有潜力创建多功能且能效高的机器人平台，适用于多变的环境。', 'title_zh': 'PuffyBot：一个无绳形态变化机器人，适用于多环境运动'}
{'arxiv_id': 'arXiv:2511.09790', 'title': 'A Robust Task-Level Control Architecture for Learned Dynamical Systems', 'authors': 'Eshika Pathak, Ahmed Aboudonia, Sandeep Banik, Naira Hovakimyan', 'link': 'https://arxiv.org/abs/2511.09790', 'abstract': "Dynamical system (DS)-based learning from demonstration (LfD) is a powerful tool for generating motion plans in the operation (`task') space of robotic systems. However, the realization of the generated motion plans is often compromised by a ''task-execution mismatch'', where unmodeled dynamics, persistent disturbances, and system latency cause the robot's actual task-space state to diverge from the desired motion trajectory. We propose a novel task-level robust control architecture, L1-augmented Dynamical Systems (L1-DS), that explicitly handles the task-execution mismatch in tracking a nominal motion plan generated by any DS-based LfD scheme. Our framework augments any DS-based LfD model with a nominal stabilizing controller and an L1 adaptive controller. Furthermore, we introduce a windowed Dynamic Time Warping (DTW)-based target selector, which enables the nominal stabilizing controller to handle temporal misalignment for improved phase-consistent tracking. We demonstrate the efficacy of our architecture on the LASA and IROS handwriting datasets.", 'abstract_zh': '基于动力学系统（DS）的学习从演示（LfD）生成机器人系统操作空间中的运动计划是一种强大工具。然而，生成的运动计划常常受到“任务执行不匹配”的影响，其中未建模的动力学、持续干扰和系统时延导致机器人的实际任务空间状态偏离期望的运动轨迹。我们提出了一种新颖的任务级鲁棒控制架构L1-增强动力学系统（L1-DS），以明确处理由任何基于DS的LfD方案生成的名义运动计划引起的任务执行不匹配问题。我们的框架将任何基于DS的LfD模型与一个名义稳态控制器和一个L1自适应控制器相结合。此外，我们引入了一个窗口化的动态时间规整（DTW）目标选择器，以使名义稳态控制器能够处理时间对齐问题，从而提高相位一致的跟踪效果。我们在LASA和IROS手写数据集上展示了我们架构的有效性。', 'title_zh': 'learned动态系统中鲁棒的任务级控制架构'}
{'arxiv_id': 'arXiv:2511.09695', 'title': 'A Shared-Autonomy Construction Robotic System for Overhead Works', 'authors': 'David Minkwan Kim, K. M. Brian Lee, Yong Hyeok Seo, Nikola Raicevic, Runfa Blark Li, Kehan Long, Chan Seon Yoon, Dong Min Kang, Byeong Jo Lim, Young Pyoung Kim, Nikolay Atanasov, Truong Nguyen, Se Woong Jun, Young Wook Kim', 'link': 'https://arxiv.org/abs/2511.09695', 'abstract': 'We present the ongoing development of a robotic system for overhead work such as ceiling drilling. The hardware platform comprises a mobile base with a two-stage lift, on which a bimanual torso is mounted with a custom-designed drilling end effector and RGB-D cameras. To support teleoperation in dynamic environments with limited visibility, we use Gaussian splatting for online 3D reconstruction and introduce motion parameters to model moving objects. For safe operation around dynamic obstacles, we developed a neural configuration-space barrier approach for planning and control. Initial feasibility studies demonstrate the capability of the hardware in drilling, bolting, and anchoring, and the software in safe teleoperation in a dynamic environment.', 'abstract_zh': '我们呈现了一种用于顶面作业（如天花板钻孔）的机器人系统的发展进度。该硬件平台包括一个配备两级提升装置的移动基座，上面安装有一个配备定制设计的钻孔末端执行器和RGB-D相机的双臂躯干。为支持在有限视域的动态环境中的遥操作，我们采用了高斯点云法进行在线三维重建，并引入运动参数来建模移动对象。为确保在动态障碍物周围的安全操作，我们开发了一种基于神经配置空间屏障的方法进行规划与控制。初步可行性研究证明了该硬件在钻孔、螺接和锚定方面的能力，以及软件在动态环境中的安全遥操作能力。', 'title_zh': '一种用于高处作业的共享自治建筑机器人系统'}
{'arxiv_id': 'arXiv:2511.09602', 'title': 'ScaleADFG: Affordance-based Dexterous Functional Grasping via Scalable Dataset', 'authors': 'Sizhe Wang, Yifan Yang, Yongkang Luo, Daheng Li, Wei Wei, Yan Zhang, Peiying Hu, Yunjin Fu, Haonan Duan, Jia Sun, Peng Wang', 'link': 'https://arxiv.org/abs/2511.09602', 'abstract': 'Dexterous functional tool-use grasping is essential for effective robotic manipulation of tools. However, existing approaches face significant challenges in efficiently constructing large-scale datasets and ensuring generalizability to everyday object scales. These issues primarily arise from size mismatches between robotic and human hands, and the diversity in real-world object scales. To address these limitations, we propose the ScaleADFG framework, which consists of a fully automated dataset construction pipeline and a lightweight grasp generation network. Our dataset introduce an affordance-based algorithm to synthesize diverse tool-use grasp configurations without expert demonstrations, allowing flexible object-hand size ratios and enabling large robotic hands (compared to human hands) to grasp everyday objects effectively. Additionally, we leverage pre-trained models to generate extensive 3D assets and facilitate efficient retrieval of object affordances. Our dataset comprising five object categories, each containing over 1,000 unique shapes with 15 scale variations. After filtering, the dataset includes over 60,000 grasps for each 2 dexterous robotic hands. On top of this dataset, we train a lightweight, single-stage grasp generation network with a notably simple loss design, eliminating the need for post-refinement. This demonstrates the critical importance of large-scale datasets and multi-scale object variant for effective training. Extensive experiments in simulation and on real robot confirm that the ScaleADFG framework exhibits strong adaptability to objects of varying scales, enhancing functional grasp stability, diversity, and generalizability. Moreover, our network exhibits effective zero-shot transfer to real-world objects. Project page is available at this https URL', 'abstract_zh': '灵巧功能工具使用抓取对于有效进行工具的机器人操作至关重要。然而，现有的方法在高效构建大规模数据集和确保日常物体尺度的一般化方面面临重大挑战。这些问题主要源于机器人手和人类手的尺寸不匹配以及现实世界中物体尺度的多样性。为了解决这些限制，我们提出了ScaleADFG框架，该框架包括一个完全自动的数据集构建管道和一个轻量级的抓取生成网络。我们的数据集采用基于功能的方法合成了各种工具使用抓取配置，无需专家演示，允许灵活的物体-手尺寸比，并使大型机器人手能够有效地抓取日常物品。此外，我们利用预训练模型生成了大量的3D资产，并促进了物体功能的高效检索。我们的数据集包含五个物种类别，每个类别包含超过1,000种独特形状，有15种尺度变化。过滤后，数据集包括超过60,000个抓取，针对每只2只灵巧的机器人手。在此数据集基础上，我们训练了一个轻量级的单阶段抓取生成网络，具有显著简单的损失设计，消除了事后优化的需要。这表明大规模数据集和多尺度物体变体对于有效的训练至关重要。在模拟和现实机器人中的广泛实验表明，ScaleADFG框架在各种尺度的对象上表现出很强的适应性，提高了功能抓取的稳定性、多样性和一般化能力。此外，我们的网络在零样本转移到现实世界物体上表现出有效的能力。项目页面可通过此链接访问。', 'title_zh': '基于功能性的灵巧抓取通过可扩展数据集的可承受性规模扩展方法'}
{'arxiv_id': 'arXiv:2511.09766', 'title': 'Ksurf-Drone: Attention Kalman Filter for Contextual Bandit Optimization in Cloud Resource Allocation', 'authors': "Michael Dang'ana, Yuqiu Zhang, Hans-Arno Jacobsen", 'link': 'https://arxiv.org/abs/2511.09766', 'abstract': 'Resource orchestration and configuration parameter search are key concerns for container-based infrastructure in cloud data centers. Large configuration search space and cloud uncertainties are often mitigated using contextual bandit techniques for resource orchestration including the state-of-the-art Drone orchestrator. Complexity in the cloud provider environment due to varying numbers of virtual machines introduces variability in workloads and resource metrics, making orchestration decisions less accurate due to increased nonlinearity and noise. Ksurf, a state-of-the-art variance-minimizing estimator method ideal for highly variable cloud data, enables optimal resource estimation under conditions of high cloud variability.\nThis work evaluates the performance of Ksurf on estimation-based resource orchestration tasks involving highly variable workloads when employed as a contextual multi-armed bandit objective function model for cloud scenarios using Drone. Ksurf enables significantly lower latency variance of $41\\%$ at p95 and $47\\%$ at p99, demonstrates a $4\\%$ reduction in CPU usage and 7 MB reduction in master node memory usage on Kubernetes, resulting in a $7\\%$ cost savings in average worker pod count on VarBench Kubernetes benchmark.', 'abstract_zh': '基于容器的云数据中心基础设施中，资源orchestration和配置参数搜索是关键关注点。使用上下文xffffffff bandit技术来缓解大规模配置搜索空间和云不确定性对于资源orchestration的影响，包括最先进的Drone orchestrator在内。由于云提供商环境中虚拟机数量的不同导致的复杂性引入了工作负载和资源指标的变异性，增加了非线性和噪声，使得编排决策不够准确。Ksurf，一种理想的高变异性云数据最小方差估计方法，能够在高云变异性条件下实现最优资源估算。本文评估了Ksurf在使用Drone作为云场景下的上下文多臂-bandit目标函数模型时，对于涉及高度可变工作负载的基于估算的资源orchestration任务的性能表现。Ksurf在p95和p99时显著降低了41%和47%的延迟方差，CPU使用率降低了4%，并减少了7 MB的主节点内存使用量，在VarBench Kubernetes基准测试中平均减少了7%的worker pod数量。', 'title_zh': 'Ksurf-Drone：注意力卡尔曼滤波在云资源分配的上下文臂优化中应用'}
{'arxiv_id': 'arXiv:2511.09737', 'title': 'Out-of-Distribution Generalization with a SPARC: Racing 100 Unseen Vehicles with a Single Policy', 'authors': 'Bram Grooten, Patrick MacAlpine, Kaushik Subramanian, Peter Stone, Peter R. Wurman', 'link': 'https://arxiv.org/abs/2511.09737', 'abstract': 'Generalization to unseen environments is a significant challenge in the field of robotics and control. In this work, we focus on contextual reinforcement learning, where agents act within environments with varying contexts, such as self-driving cars or quadrupedal robots that need to operate in different terrains or weather conditions than they were trained for. We tackle the critical task of generalizing to out-of-distribution (OOD) settings, without access to explicit context information at test time. Recent work has addressed this problem by training a context encoder and a history adaptation module in separate stages. While promising, this two-phase approach is cumbersome to implement and train. We simplify the methodology and introduce SPARC: single-phase adaptation for robust control. We test SPARC on varying contexts within the high-fidelity racing simulator Gran Turismo 7 and wind-perturbed MuJoCo environments, and find that it achieves reliable and robust OOD generalization.', 'abstract_zh': '在未见环境中的泛化是机器人学和控制领域的重大挑战。本文重点关注在不同上下文环境中智能体的行为，如需要在不同地形或天气条件下运行的自动驾驶汽车或四足机器人。我们集中解决在测试时不提供明确上下文信息的情况下，如何实现对未分布（OOD）环境的有效泛化这一关键任务。近期的研究通过分别训练上下文编码器和历史适应模块解决这一问题，虽然具有潜力，但这一两阶段方法实施和训练起来相当繁琐。我们简化了这一方法并引入了SPARC：单一阶段适应以实现稳健控制。我们在高保真赛车模拟器Gran Turismo 7和风扰动的MuJoCo环境中测试SPARC，发现它能够实现可靠和稳健的OOD泛化。', 'title_zh': '使用SPARC进行离分布泛化：用单个策略竞速100辆未见过的车辆'}
