{'arxiv_id': 'arXiv:2509.14210', 'title': 'GLIDE: A Coordinated Aerial-Ground Framework for Search and Rescue in Unknown Environments', 'authors': 'Seth Farrell, Chenghao Li, Hongzhan Yu, Hesam Mojtahedi, Sicun Gao, Henrik I. Christensen', 'link': 'https://arxiv.org/abs/2509.14210', 'abstract': "We present a cooperative aerial-ground search-and-rescue (SAR) framework that pairs two unmanned aerial vehicles (UAVs) with an unmanned ground vehicle (UGV) to achieve rapid victim localization and obstacle-aware navigation in unknown environments. We dub this framework Guided Long-horizon Integrated Drone Escort (GLIDE), highlighting the UGV's reliance on UAV guidance for long-horizon planning. In our framework, a goal-searching UAV executes real-time onboard victim detection and georeferencing to nominate goals for the ground platform, while a terrain-scouting UAV flies ahead of the UGV's planned route to provide mid-level traversability updates. The UGV fuses aerial cues with local sensing to perform time-efficient A* planning and continuous replanning as information arrives. Additionally, we present a hardware demonstration (using a GEM e6 golf cart as the UGV and two X500 UAVs) to evaluate end-to-end SAR mission performance and include simulation ablations to assess the planning stack in isolation from detection. Empirical results demonstrate that explicit role separation across UAVs, coupled with terrain scouting and guided planning, improves reach time and navigation safety in time-critical SAR missions.", 'abstract_zh': '我们提出了一种协作的空地搜救框架，该框架将两架无人机与一辆无人地面车辆配对，以实现快速受害者定位和未知环境中的障碍物感知导航。我们称此框架为引导远见集成无人机护航（GLIDE），突出了无人地面车辆对无人机长时间规划的依赖。在该框架中，一架目标搜索无人机执行实时机载受害者检测和地理定位，为地面平台提名目标；一架地形侦察无人机则在无人地面车辆规划路线上方飞行，提供中等水平的通行性更新。无人地面车辆融合空中线索与局部感知，进行高效的时间敏感型A*规划，并在信息到达时进行持续规划。此外，我们使用GEM e6高尔夫车作为无人地面车辆和两架X500无人机展示了硬件演示，以评估端到端的搜救任务性能，并通过仿真消融实验评估规划栈在与检测隔离情况下的表现。实验结果表明，无人机之间的明确角色分离、结合地形侦察及引导规划，在时间敏感的搜救任务中能够提高到达时间和导航安全性。', 'title_zh': 'GLIDE：未知环境中协同空地搜索与救援框架'}
{'arxiv_id': 'arXiv:2509.14147', 'title': 'StableTracker: Learning to Stably Track Target via Differentiable Simulation', 'authors': 'Fanxing Li, Shengyang Wang, Fangyu Sun, Shuyu Wu, Dexin Zuo, Wenxian Yu, Danping Zou', 'link': 'https://arxiv.org/abs/2509.14147', 'abstract': 'FPV object tracking methods heavily rely on handcraft modular designs, resulting in hardware overload and cumulative error, which seriously degrades the tracking performance, especially for rapidly accelerating or decelerating targets. To address these challenges, we present \\textbf{StableTracker}, a learning-based control policy that enables quadrotors to robustly follow the moving target from arbitrary perspectives. The policy is trained using backpropagation-through-time via differentiable simulation, allowing the quadrotor to maintain the target at the center of the visual field in both horizontal and vertical directions, while keeping a fixed relative distance, thereby functioning as an autonomous aerial camera. We compare StableTracker against both state-of-the-art traditional algorithms and learning baselines. Simulation experiments demonstrate that our policy achieves superior accuracy, stability and generalization across varying safe distances, trajectories, and target velocities. Furthermore, a real-world experiment on a quadrotor with an onboard computer validated practicality of the proposed approach.', 'abstract_zh': '基于学习的控制策略StableTracker使四旋翼能够在任意视角下稳健地跟随移动目标，解决了手动模块设计导致的硬件过载和累积误差问题，特别是对于快速加速或减速的目标，显著提升了跟踪性能。', 'title_zh': 'StableTracker：通过可微模拟学习稳定跟踪目标'}
{'arxiv_id': 'arXiv:2509.14127', 'title': 'Energy Efficient Multi Robot Package Delivery under Capacity-Constraints via Voronoi-Constrained Networks', 'authors': 'Alkesh K. Srivastava, Jared Michael Levin, Philip Dames', 'link': 'https://arxiv.org/abs/2509.14127', 'abstract': 'We consider the problem of delivering multiple packages from a single pickup depot to distinct goal locations using a homogeneous fleet of robots with limited carrying capacity. We propose VCST-RCP, a Voronoi-Constrained Steiner Tree Relay Coordination Planning framework that constructs sparse relay trunks using Steiner tree optimization and then synthesizes robot-level pickup, relay, and delivery schedules. This framework reframes relays from incidental byproducts into central elements of coordination, offering a contrast with traditional delivery methods that rely on direct source-to-destination transport. Extensive experiments show consistent improvements of up to 34% compared to conventional baselines, underscoring the benefits of incorporating relays into the delivery process. These improvements translate directly to enhanced energy efficiency in multi-robot delivery under capacity constraints, providing a scalable framework for real-world logistics.', 'abstract_zh': '我们考虑使用具有有限承载能力的 homogenous 车队机器人，从单一取货点向不同的目标地点递送多个包裹的问题。我们提出了一种 Voronoi-Constrained Steiner Tree Relay Coordination Planning (VCST-RCP) 框架，该框架通过 Steiner 树优化构建稀疏接力骨干网络，然后合成机器人级别的取货、接力和配送时间表。该框架将接力重新定义为中心协调要素，与依赖于直接源地到目的地运输的传统递送方法形成对比。广泛的经验研究表明，与传统基准相比，改进幅度高达 34%，突显了将接力整合进递送过程中的益处。这些改进直接转化为在承载能力受限条件下多机器人递送的能源效率提升，提供了一种适用于实际物流的可扩展框架。', 'title_zh': '基于Voronoi约束网络的容量限制多机器人包裹配送能效优化'}
{'arxiv_id': 'arXiv:2509.14082', 'title': 'FlightDiffusion: Revolutionising Autonomous Drone Training with Diffusion Models Generating FPV Video', 'authors': 'Valerii Serpiva, Artem Lykov, Faryal Batool, Vladislav Kozlovskiy, Miguel Altamirano Cabrera, Dzmitry Tsetserukou', 'link': 'https://arxiv.org/abs/2509.14082', 'abstract': 'We present FlightDiffusion, a diffusion-model-based framework for training autonomous drones from first-person view (FPV) video. Our model generates realistic video sequences from a single frame, enriched with corresponding action spaces to enable reasoning-driven navigation in dynamic environments. Beyond direct policy learning, FlightDiffusion leverages its generative capabilities to synthesize diverse FPV trajectories and state-action pairs, facilitating the creation of large-scale training datasets without the high cost of real-world data collection. Our evaluation demonstrates that the generated trajectories are physically plausible and executable, with a mean position error of 0.25 m (RMSE 0.28 m) and a mean orientation error of 0.19 rad (RMSE 0.24 rad). This approach enables improved policy learning and dataset scalability, leading to superior performance in downstream navigation tasks. Results in simulated environments highlight enhanced robustness, smoother trajectory planning, and adaptability to unseen conditions. An ANOVA revealed no statistically significant difference between performance in simulation and reality (F(1, 16) = 0.394, p = 0.541), with success rates of M = 0.628 (SD = 0.162) and M = 0.617 (SD = 0.177), respectively, indicating strong sim-to-real transfer. The generated datasets provide a valuable resource for future UAV research. This work introduces diffusion-based reasoning as a promising paradigm for unifying navigation, action generation, and data synthesis in aerial robotics.', 'abstract_zh': '基于扩散模型的从第一人称视角训练自主无人机的FlightDiffusion框架', 'title_zh': 'FlightDiffusion：通过扩散模型生成FPV视频革新中国自主无人机训练'}
{'arxiv_id': 'arXiv:2509.14075', 'title': 'Constraint-Consistent Control of Task-Based and Kinematic RCM Constraints for Surgical Robots', 'authors': 'Yu Li, Hamid Sadeghian, Zewen Yang, Valentin Le Mesle, Sami Haddadin', 'link': 'https://arxiv.org/abs/2509.14075', 'abstract': 'Robotic-assisted minimally invasive surgery (RAMIS) requires precise enforcement of the remote center of motion (RCM) constraint to ensure safe tool manipulation through a trocar. Achieving this constraint under dynamic and interactive conditions remains challenging, as existing control methods either lack robustness at the torque level or do not guarantee consistent RCM constraint satisfaction. This paper proposes a constraint-consistent torque controller that treats the RCM as a rheonomic holonomic constraint and embeds it into a projection-based inverse-dynamics framework. The method unifies task-level and kinematic formulations, enabling accurate tool-tip tracking while maintaining smooth and efficient torque behavior. The controller is validated both in simulation and on a RAMIS training platform, and is benchmarked against state-of-the-art approaches. Results show improved RCM constraint satisfaction, reduced required torque, and robust performance by improving joint torque smoothness through the consistency formulation under clinically relevant scenarios, including spiral trajectories, variable insertion depths, moving trocars, and human interaction. These findings demonstrate the potential of constraint-consistent torque control to enhance safety and reliability in surgical robotics. The project page is available at: this https URL', 'abstract_zh': '机器人辅助微创手术（RAMIS）需要精确执行远程中心运动（RCM）约束，以确保通过Trocar安全操作手术工具。在动态和交互条件下实现这一约束仍然具有挑战性，因为现有控制方法要么在扭力水平上缺乏鲁棒性，要么不能保证一致的RCM约束满足。本文提出了一种约束一致的扭力控制器，将RCM视为一种动力学 holonomic 约束，并将其嵌入到投影为基础的逆动力学框架中。该方法统一了任务级和运动学公式，实现了精确的工具尖端跟踪，同时保持平滑和高效的扭力行为。该控制器在仿真和RAMIS培训平台上进行了验证，并与最先进的方法进行了基准测试。结果显示，在包括螺旋轨迹、变插入深度、移动Trocar和与人类交互的临床相关场景下，通过一致性公式提高了关节扭力平滑性，从而提高了RCM约束满足度、减少了所需扭力并增强了鲁棒性能。这些发现展示了约束一致的扭力控制在增强手术机器人安全性和可靠性方面的潜力。项目页面可用于此：this https URL', 'title_zh': '基于任务和运动RCM约束的一致性控制约束管理'}
{'arxiv_id': 'arXiv:2509.14025', 'title': 'TransforMARS: Fault-Tolerant Self-Reconfiguration for Arbitrarily Shaped Modular Aerial Robot Systems', 'authors': 'Rui Huang, Zhiyu Gao, Siyu Tang, Jialin Zhang, Lei He, Ziqian Zhang, Lin Zhao', 'link': 'https://arxiv.org/abs/2509.14025', 'abstract': 'Modular Aerial Robot Systems (MARS) consist of multiple drone modules that are physically bound together to form a single structure for flight. Exploiting structural redundancy, MARS can be reconfigured into different formations to mitigate unit or rotor failures and maintain stable flight. Prior work on MARS self-reconfiguration has solely focused on maximizing controllability margins to tolerate a single rotor or unit fault for rectangular-shaped MARS. We propose TransforMARS, a general fault-tolerant reconfiguration framework that transforms arbitrarily shaped MARS under multiple rotor and unit faults while ensuring continuous in-air stability. Specifically, we develop algorithms to first identify and construct minimum controllable assemblies containing faulty units. We then plan feasible disassembly-assembly sequences to transport MARS units or subassemblies to form target configuration. Our approach enables more flexible and practical feasible reconfiguration. We validate TransforMARS in challenging arbitrarily shaped MARS configurations, demonstrating substantial improvements over prior works in both the capacity of handling diverse configurations and the number of faults tolerated. The videos and source code of this work are available at the anonymous repository: this https URL', 'abstract_zh': '模块化飞行器系统（MARS）由多个物理连接的无人机模块组成，形成单一结构进行飞行。利用结构冗余，MARS可以重新配置成不同的编队以缓解单一旋翼或模块故障并维持稳定飞行。先前关于MARS自重构的研究仅集中在最大化控制裕度以容忍矩形MARS的单一旋翼或模块故障。我们提出了一种通用的故障 tolerant 重构框架 TransforMARS，能够在多种旋翼和模块故障情况下转换任意形状的MARS，同时确保飞行中的连续稳定性。具体地，我们开发了算法以首先识别并构建包含故障模块的最小可控组合。然后规划可行的拆卸-重构序列以运输MARS模块或子组合以形成目标配置。我们的方法能够实现更灵活和实用的可行重构。我们通过挑战性的任意形状MARS配置验证了TransforMARS，证明了与先前研究相比，在处理多样配置能力和容忍故障数量方面均取得了显著改进。相关视频和源代码可在匿名仓库中获得：this https URL。', 'title_zh': 'TransformMARS：任意形状模块化空中机器人系统的容错自重构'}
{'arxiv_id': 'arXiv:2509.13998', 'title': 'Flexible and Foldable: Workspace Analysis and Object Manipulation Using a Soft, Interconnected, Origami-Inspired Actuator Array', 'authors': 'Bailey Dacre, Rodrigo Moreno, Serhat Demirtas, Ziqiao Wang, Yuhao Jiang, Jamie Paik, Kasper Stoy, Andrés Faíña', 'link': 'https://arxiv.org/abs/2509.13998', 'abstract': 'Object manipulation is a fundamental challenge in robotics, where systems must balance trade-offs among manipulation capabilities, system complexity, and throughput. Distributed manipulator systems (DMS) use the coordinated motion of actuator arrays to perform complex object manipulation tasks, seeing widespread exploration within the literature and in industry. However, existing DMS designs typically rely on high actuator densities and impose constraints on object-to-actuator scale ratios, limiting their adaptability. We present a novel DMS design utilizing an array of 3-DoF, origami-inspired robotic tiles interconnected by a compliant surface layer. Unlike conventional DMS, our approach enables manipulation not only at the actuator end effectors but also across a flexible surface connecting all actuators; creating a continuous, controllable manipulation surface. We analyse the combined workspace of such a system, derive simple motion primitives, and demonstrate its capabilities to translate simple geometric objects across an array of tiles. By leveraging the inter-tile connective material, our approach significantly reduces actuator density, increasing the area over which an object can be manipulated by x1.84 without an increase in the number of actuators. This design offers a lower cost and complexity alternative to traditional high-density arrays, and introduces new opportunities for manipulation strategies that leverage the flexibility of the interconnected surface.', 'abstract_zh': '基于折纸灵感的柔性表面连接三自由度 robotic 块分布式 manipulator 系统设计', 'title_zh': '灵活可折叠：基于 Origami 灵感的软互联执行器阵列的工作空间分析与物体操作'}
{'arxiv_id': 'arXiv:2509.13943', 'title': 'Reinforcement Learning for Autonomous Point-to-Point UAV Navigation', 'authors': 'Salim Oyinlola, Nitesh Subedi, Soumik Sarkar', 'link': 'https://arxiv.org/abs/2509.13943', 'abstract': 'Unmanned Aerial Vehicles (UAVs) are increasingly used in automated inspection, delivery, and navigation tasks that require reliable autonomy. This project develops a reinforcement learning (RL) approach to enable a single UAV to autonomously navigate between predefined points without manual intervention. The drone learns navigation policies through trial-and-error interaction, using a custom reward function that encourages goal-reaching efficiency while penalizing collisions and unsafe behavior. The control system integrates ROS with a Gym-compatible training environment, enabling flexible deployment and testing. After training, the learned policy is deployed on a real UAV platform and evaluated under practical conditions. Results show that the UAV can successfully perform autonomous navigation with minimal human oversight, demonstrating the viability of RL-based control for point-to-point drone operations in real-world scenarios.', 'abstract_zh': '无人驾驶航空器（UAV）越来越多地用于自动化检测、递送和导航等任务，需要可靠的自主能力。该项目开发了一种强化学习（RL）方法，使单个UAV能够在无需人工干预的情况下自主在预先定义的点之间导航。无人机遇通过试错交互学习导航策略，使用自定义奖励函数鼓励高效的目标达成，同时对碰撞和不安全行为进行惩罚。控制系统将ROS与兼容Gym的训练环境相结合，实现灵活的部署和测试。训练完成后，所学习的策略部署到实际的UAV平台上，并在实际条件下进行评估。结果表明，该UAV能够在最少的人为监督下成功执行自主导航，展示了基于RL的控制在实际场景中进行点到点无人机操作的可行性。', 'title_zh': '自主点到点无人机导航的强化学习方法'}
{'arxiv_id': 'arXiv:2509.13882', 'title': 'Repulsive Trajectory Modification and Conflict Resolution for Efficient Multi-Manipulator Motion Planning', 'authors': 'Junhwa Hong, Beomjoon Lee, Woojin Lee, Changjoo Nam', 'link': 'https://arxiv.org/abs/2509.13882', 'abstract': 'We propose an efficient motion planning method designed to efficiently find collision-free trajectories for multiple manipulators. While multi-manipulator systems offer significant advantages, coordinating their motions is computationally challenging owing to the high dimensionality of their composite configuration space. Conflict-Based Search (CBS) addresses this by decoupling motion planning, but suffers from subsequent conflicts incurred by resolving existing conflicts, leading to an exponentially growing constraint tree of CBS. Our proposed method is based on repulsive trajectory modification within the two-level structure of CBS. Unlike conventional CBS variants, the low-level planner applies a gradient descent approach using an Artificial Potential Field. This field generates repulsive forces that guide the trajectory of the conflicting manipulator away from those of other robots. As a result, subsequent conflicts are less likely to occur. Additionally, we develop a strategy that, under a specific condition, directly attempts to find a conflict-free solution in a single step without growing the constraint tree. Through extensive tests including physical robot experiments, we demonstrate that our method consistently reduces the number of expanded nodes in the constraint tree, achieves a higher success rate, and finds a solution faster compared to Enhanced CBS and other state-of-the-art algorithms.', 'abstract_zh': '我们提出了一种高效运动规划方法，旨在高效地为多个操作器找到无碰撞轨迹。尽管多操作器系统具有显著优势，但由于其复合配置空间的高维度，协调其运动在计算上具有挑战性。冲突基搜索（CBS）通过解耦运动规划来解决这一问题，但会在解决现有冲突时产生附加冲突，导致CBS的约束树呈指数增长。我们提出的方法基于CBS的两层结构内的排斥轨迹修改。与传统的CBS变体不同，低层规划器采用梯度下降方法结合人工势场。该场产生排斥力，引导冲突操作器的轨迹远离其他机器人。这样一来，后续冲突的可能性较小。此外，我们开发了一种策略，在特定条件下，直接尝试在单步骤中找到无冲突解决方案，而不增长约束树。通过包括物理机器人实验在内的广泛测试，我们展示了该方法在约束树中展开的节点数量上具有一致性减少，成功率更高，并且比增强的CBS和其他最先进的算法更快找到解决方案。', 'title_zh': '排斥轨迹修改与冲突分辨率的高效多 manipulator 运动规划'}
{'arxiv_id': 'arXiv:2509.13815', 'title': 'Soft Regrasping Tool Inspired by Jamming Gripper', 'authors': 'Takuya Kiyokawa, Zhengtao Hu, Weiwei Wan, Kensuke Harada', 'link': 'https://arxiv.org/abs/2509.13815', 'abstract': 'Regrasping on fixtures is a promising approach to reduce pose uncertainty in robotic assembly, but conventional rigid fixtures lack adaptability and require dedicated designs for each part. To overcome this limitation, we propose a soft jig inspired by the jamming transition phenomenon, which can be continuously deformed to accommodate diverse object geometries. By pressing a triangular-pyramid-shaped tool into the membrane and evacuating the enclosed air, a stable cavity is formed as a placement space. We further optimize the stamping depth to balance placement stability and gripper accessibility. In soft-jig-based regrasping, the key challenge lies in optimizing the cavity size to achieve precise dropping; once the part is reliably placed, subsequent grasping can be performed with reduced uncertainty. Accordingly, we conducted drop experiments on ten mechanical parts of varying shapes, which achieved placement success rates exceeding 80% for most objects and above 90% for cylindrical ones, while failures were mainly caused by geometric constraints and membrane properties. These results demonstrate that the proposed jig enables general-purpose, accurate, and repeatable regrasping, while also clarifying its current limitations and future potential as a practical alternative to rigid fixtures in assembly automation.', 'abstract_zh': '基于软工装的重新抓取方法：减少机器人装配中姿态不确定性的一种有前途的 approach', 'title_zh': '受阻尼夹持器启发的软重新抓取工具'}
{'arxiv_id': 'arXiv:2509.13802', 'title': 'Shell-Type Soft Jig for Holding Objects during Disassembly', 'authors': 'Takuya Kiyokawa, Ryunosuke Takebayashi, Kensuke Harada', 'link': 'https://arxiv.org/abs/2509.13802', 'abstract': "This study addresses a flexible holding tool for robotic disassembly. We propose a shell-type soft jig that securely and universally holds objects, mitigating the risk of component damage and adapting to diverse shapes while enabling soft fixation that is robust to recognition, planning, and control errors. The balloon-based holding mechanism ensures proper alignment and stable holding performance, thereby reducing the need for dedicated jig design, highly accurate perception, precise grasping, and finely tuned trajectory planning that are typically required with conventional fixtures. Our experimental results demonstrate the practical feasibility of the proposed jig through performance comparisons with a vise and a jamming-gripper-inspired soft jig. Tests on ten different objects further showed representative successes and failures, clarifying the jig's limitations and outlook.", 'abstract_zh': '一种用于机器人拆卸的柔性持物工具的研究', 'title_zh': '用于拆卸过程中保持物体的壳型软夹具'}
{'arxiv_id': 'arXiv:2509.13736', 'title': 'Motion Adaptation Across Users and Tasks for Exoskeletons via Meta-Learning', 'authors': 'Muyuan Ma, Long Cheng, Lijun Han, Xiuze Xia, Houcheng Li', 'link': 'https://arxiv.org/abs/2509.13736', 'abstract': 'Wearable exoskeletons can augment human strength and reduce muscle fatigue during specific tasks. However, developing personalized and task-generalizable assistance algorithms remains a critical challenge. To address this, a meta-imitation learning approach is proposed. This approach leverages a task-specific neural network to predict human elbow joint movements, enabling effective assistance while enhancing generalization to new scenarios. To accelerate data collection, full-body keypoint motions are extracted from publicly available RGB video and motion-capture datasets across multiple tasks, and subsequently retargeted in simulation. Elbow flexion trajectories generated in simulation are then used to train the task-specific neural network within the model-agnostic meta-learning (MAML) framework, which allows the network to rapidly adapt to novel tasks and unseen users with only a few gradient updates. The adapted network outputs personalized references tracked by a gravity-compensated PD controller to ensure stable assistance. Experimental results demonstrate that the exoskeleton significantly reduces both muscle activation and metabolic cost for new users performing untrained tasks, compared to performing without exoskeleton assistance. These findings suggest that the proposed framework effectively improves task generalization and user adaptability for wearable exoskeleton systems.', 'abstract_zh': '可穿戴外骨骼可以在特定任务中增强人类力量并减少肌肉疲劳。然而，开发个性化且适用于多种任务的辅助算法仍是一个关键挑战。为此，提出了一种元模仿学习方法。该方法利用特定任务的神经网络预测人类肘关节运动，从而实现有效辅助并增强对新场景的泛化能力。为加速数据收集，在多个任务中从公开的RGB视频和动作捕捉数据集中提取全身关键点运动，并在模拟中重新目标对齐。模拟中生成的肘关节屈曲轨迹用于在模型无关的元学习（MAML）框架内训练特定任务的神经网络，从而使网络仅通过少量梯度更新就能快速适应新任务和未见过的用户。调整后的网络输出由重力补偿PD控制器追踪的个性化参考轨迹，以确保稳定辅助。实验结果表明，与未使用外骨骼辅助相比，外骨骼显著减少了新用户在执行未训练任务时的肌肉激活和代谢成本。这些发现表明，所提出的方法有效地提高了可穿戴外骨骼系统的任务泛化能力和用户适应性。', 'title_zh': '基于元学习的用户和任务跨适应外骨骼运动调整'}
{'arxiv_id': 'arXiv:2509.13649', 'title': 'Barometer-Aided Attitude Estimation', 'authors': 'Méloné Nyoba Tchonkeu, Soulaimane Berkane, Tarek Hamel', 'link': 'https://arxiv.org/abs/2509.13649', 'abstract': 'Accurate and robust attitude estimation is a central challenge for autonomous vehicles operating in GNSS-denied or highly dynamic environments. In such cases, Inertial Measurement Units (IMUs) alone are insufficient for reliable tilt estimation due to the ambiguity between gravitational and inertial accelerations. While auxiliary velocity sensors, such as GNSS, Pitot tubes, Doppler radar, or visual odometry, are often used, they can be unavailable, intermittent, or costly. This work introduces a barometer-aided attitude estimation architecture that leverages barometric altitude measurements to infer vertical velocity and attitude within a nonlinear observer on SO(3). The design cascades a deterministic Riccati observer with a complementary filter, ensuring Almost Global Asymptotic Stability (AGAS) under a uniform observability condition while maintaining geometric consistency. The analysis highlights barometer-aided estimation as a lightweight and effective complementary modality.', 'abstract_zh': '自主车辆在GNSS-denied或高动态环境下精确且鲁棒的姿态估计是一个核心挑战。为此，本工作提出了一种气压辅助姿态估计架构，利用气压高度测量来推断垂直速度和姿态，在SO(3)上的非线性观测器中进行估计。该设计采用定性的里卡提观测器与互补滤波器级联，确保在均匀可观测性条件下几乎全域渐近稳定（AGAS），同时保持几何一致性。分析表明，气压辅助估计是一种轻量且有效的补充模态。', 'title_zh': '气压助力姿态估计'}
{'arxiv_id': 'arXiv:2509.13591', 'title': 'Object Pose Estimation through Dexterous Touch', 'authors': 'Amir-Hossein Shahidzadeh, Jiyue Zhu, Kezhou Chen, Sha Yi, Cornelia Fermüller, Yiannis Aloimonos, Xiaolong Wang', 'link': 'https://arxiv.org/abs/2509.13591', 'abstract': "Robust object pose estimation is essential for manipulation and interaction tasks in robotics, particularly in scenarios where visual data is limited or sensitive to lighting, occlusions, and appearances. Tactile sensors often offer limited and local contact information, making it challenging to reconstruct the pose from partial data. Our approach uses sensorimotor exploration to actively control a robot hand to interact with the object. We train with Reinforcement Learning (RL) to explore and collect tactile data. The collected 3D point clouds are used to iteratively refine the object's shape and pose. In our setup, one hand holds the object steady while the other performs active exploration. We show that our method can actively explore an object's surface to identify critical pose features without prior knowledge of the object's geometry. Supplementary material and more demonstrations will be provided at this https URL .", 'abstract_zh': '鲁棒的对象姿态估计对于机器人中的操作和交互任务至关重要，特别是在视觉数据受限或对光照、遮挡和外观敏感的情景中。触觉传感器通常只能提供有限的局部接触信息，这使得从部分数据重建姿态变得具有挑战性。我们的方法通过传感器运动探索主动控制机器人手与物体互动。我们使用强化学习（RL）进行探索并收集触觉数据。收集到的3D点云用于迭代细化物体的形状和姿态。在我们的设置中，一只手稳持物体，另一只手进行主动探索。我们展示了我们的方法可以在没有物体几何先验知识的情况下，主动探索物体表面以识别关键的姿态特征。更多信息和演示将在以下网址提供：this https URL。', 'title_zh': '通过灵巧触觉进行物体姿态估计'}
{'arxiv_id': 'arXiv:2509.13501', 'title': 'Trajectory Tracking with Reachability-Guided Quadratic Programming and Freeze-Resume', 'authors': 'Hossein Gholampour, Logan E. Beaver', 'link': 'https://arxiv.org/abs/2509.13501', 'abstract': "Many robotic systems must follow planned paths yet pause safely and resume when people or objects intervene. We present an output-space method for systems whose tracked output can be feedback-linearized to a double integrator (e.g., manipulators). The approach has two parts. Offline, we perform a pre-run reachability check to verify that the motion plan respects speed and acceleration magnitude limits. Online, we apply a quadratic program to track the motion plan under the same limits. We use a one-step reachability test to bound the maximum disturbance the system is capable of rejecting. When the state coincides with the reference path we recover perfect tracking in the deterministic case, and we correct errors using a KKT-inspired weight. We demonstrate that safety stops and unplanned deviations are handled efficiently, and the system returns to the motion plan without replanning. We demonstrate our system's improved performance over pure pursuit in simulation.", 'abstract_zh': '许多机器人系统需沿规划路径行进，并在遇到人员或物体时安全暂停并在后续恢复。我们提出了一种输出空间方法，适用于其跟踪输出可反馈线性化为双积分器（例如， manipulator）的系统。该方法分为两个部分。在离线阶段，我们执行预运行可达性检查以验证运动计划是否满足速度和加速度幅度限制。在在线阶段，我们应用二次规划来在相同的限制下跟踪运动计划。我们使用一步可达性测试来限制系统能够拒绝的最大干扰。当状态与参考路径重合时，在确定性情况下可恢复完美跟踪，并使用KKT启发式的权重来纠正错误。我们证明了该方法高效地处理了安全停止和未计划的偏离，并且系统能无需重新规划即可返回至运动计划。我们通过仿真演示了该系统在纯追求算法上的改进性能。', 'title_zh': '轨迹跟踪与可达性引导的二次规划及冻结-恢复方法'}
{'arxiv_id': 'arXiv:2509.13434', 'title': 'A Convex Formulation of Compliant Contact between Filaments and Rigid Bodies', 'authors': 'Wei-Chen Li, Glen Chou', 'link': 'https://arxiv.org/abs/2509.13434', 'abstract': 'We present a computational framework for simulating filaments interacting with rigid bodies through contact. Filaments are challenging to simulate due to their codimensionality, i.e., they are one-dimensional structures embedded in three-dimensional space. Existing methods often assume that filaments remain permanently attached to rigid bodies. Our framework unifies discrete elastic rod (DER) modeling, a pressure field patch contact model, and a convex contact formulation to accurately simulate frictional interactions between slender filaments and rigid bodies - capabilities not previously achievable. Owing to the convex formulation of contact, each time step can be solved to global optimality, guaranteeing complementarity between contact velocity and impulse. We validate the framework by assessing the accuracy of frictional forces and comparing its physical fidelity against baseline methods. Finally, we demonstrate its applicability in both soft robotics, such as a stochastic filament-based gripper, and deformable object manipulation, such as shoelace tying, providing a versatile simulator for systems involving complex filament-filament and filament-rigid body interactions.', 'abstract_zh': '一种用于模拟纤丝与刚体通过接触相互作用的计算框架', 'title_zh': '纤索单元与刚体柔顺接触的凸规划表述'}
{'arxiv_id': 'arXiv:2509.13381', 'title': 'Cooperative Target Detection with AUVs: A Dual-Timescale Hierarchical MARDL Approach', 'authors': 'Zhang Xueyao, Yang Bo, Yu Zhiwen, Cao Xuelin, George C. Alexandropoulos, Merouane Debbah, Chau Yuen', 'link': 'https://arxiv.org/abs/2509.13381', 'abstract': 'Autonomous Underwater Vehicles (AUVs) have shown great potential for cooperative detection and reconnaissance. However, collaborative AUV communications introduce risks of exposure. In adversarial environments, achieving efficient collaboration while ensuring covert operations becomes a key challenge for underwater cooperative missions. In this paper, we propose a novel dual time-scale Hierarchical Multi-Agent Proximal Policy Optimization (H-MAPPO) framework. The high-level component determines the individuals participating in the task based on a central AUV, while the low-level component reduces exposure probabilities through power and trajectory control by the participating AUVs. Simulation results show that the proposed framework achieves rapid convergence, outperforms benchmark algorithms in terms of performance, and maximizes long-term cooperative efficiency while ensuring covert operations.', 'abstract_zh': '自主水下车辆（AUVs）在协同探测和侦察方面展现了巨大的潜力。然而，协作的AUV通信增加了暴露的风险。在对抗环境中，实现高效的协同工作同时确保隐蔽操作成为水下协同任务的关键挑战。本文提出了一种新颖的双时间尺度层次多代理接近策略优化（H-MAPPO）框架。高层次组件基于中央AUV确定参与任务的个体，而低层次组件通过参与AUVs的功率和轨迹控制来降低暴露概率。仿真结果表明，所提出框架实现了快速收敛，性能优于基准算法，同时最大化长期协同效率并确保隐蔽操作。', 'title_zh': '基于AUV的协同目标检测：一种双时间尺度分层MARDL方法'}
{'arxiv_id': 'arXiv:2509.13342', 'title': 'Real World Robotic Exploration using Deep Neural Networks Trained in Photorealistic Reconstructed Environments', 'authors': 'Isaac Ronald Ward', 'link': 'https://arxiv.org/abs/2509.13342', 'abstract': "In this work, an existing deep neural network approach for determining a robot's pose from visual information (RGB images) is modified, improving its localization performance without impacting its ease of training. Explicitly, the network's loss function is extended in a manner which intuitively combines the positional and rotational error in order to increase robustness to perceptual aliasing. An improvement in the localization accuracy for indoor scenes is observed: with decreases of up to 9.64% and 2.99% in the median positional and rotational error respectively, when compared to the unmodified network.\nAdditionally, photogrammetry data is used to produce a pose-labelled dataset which allows the above model to be trained on a local environment, resulting in localization accuracies of 0.11m & 0.89 degrees. This trained model forms the basis of a navigation algorithm, which is tested in real-time on a TurtleBot (a wheeled robotic device). As such, this work introduces a full pipeline for creating a robust navigational algorithm for any given real world indoor scene; the only requirement being a collection of images from the scene, which can be captured in as little as 330 seconds of", 'abstract_zh': '基于视觉信息（RGB图像）改进的机器人姿态识别方法：提高定位性能而不影响训练难度，并应用于室内场景的导航算法', 'title_zh': '使用在 photorealistic 重建环境中训练的深度神经网络进行真实的机器人探索'}
{'arxiv_id': 'arXiv:2509.13336', 'title': 'Maximizing UAV Cellular Connectivity with Reinforcement Learning for BVLoS Path Planning', 'authors': 'Mehran Behjati, Rosdiadee Nordin, Nor Fadzilah Abdullah', 'link': 'https://arxiv.org/abs/2509.13336', 'abstract': 'This paper presents a reinforcement learning (RL) based approach for path planning of cellular connected unmanned aerial vehicles (UAVs) operating beyond visual line of sight (BVLoS). The objective is to minimize travel distance while maximizing the quality of cellular link connectivity by considering real world aerial coverage constraints and employing an empirical aerial channel model. The proposed solution employs RL techniques to train an agent, using the quality of communication links between the UAV and base stations (BSs) as the reward function. Simulation results demonstrate the effectiveness of the proposed method in training the agent and generating feasible UAV path plans. The proposed approach addresses the challenges due to limitations in UAV cellular communications, highlighting the need for investigations and considerations in this area. The RL algorithm efficiently identifies optimal paths, ensuring maximum connectivity with ground BSs to ensure safe and reliable BVLoS flight operation. Moreover, the solution can be deployed as an offline path planning module that can be integrated into future ground control systems (GCS) for UAV operations, enhancing their capabilities and safety. The method holds potential for complex long range UAV applications, advancing the technology in the field of cellular connected UAV path planning.', 'abstract_zh': '基于强化学习的越视距操作蜂窝连接无人机路径规划方法', 'title_zh': '基于 reinforcement learning 的 BVLoS 航迹规划以最大化 UAV 无线蜂窝连接性'}
