{'arxiv_id': 'arXiv:2502.21303', 'title': 'CurviTrack: Curvilinear Trajectory Tracking for High-speed Chase of a USV', 'authors': 'Parakh M. Gupta, Ondřej Procházka, Tiago Nascimento, Martin Saska', 'link': 'https://arxiv.org/abs/2502.21303', 'abstract': 'Heterogeneous robot teams used in marine environments incur time-and-energy penalties when the marine vehicle has to halt the mission to allow the autonomous aerial vehicle to land for recharging. In this paper, we present a solution for this problem using a novel drag-aware model formulation which is coupled with MPC, and therefore, enables tracking and landing during high-speed curvilinear trajectories of an USV without any communication. Compared to the state-of-the-art, our approach yields 40% decrease in prediction errors, and provides a 3-fold increase in certainty of predictions. Consequently, this leads to a 30% improvement in tracking performance and 40% higher success in landing on a moving USV even during aggressive turns that are unfeasible for conventional marine missions. We test our approach in two different real-world scenarios with marine vessels of two different sizes and further solidify our results through statistical analysis in simulation to demonstrate the robustness of our method.', 'abstract_zh': '海洋环境下异构机器人团队在自主水下车辆需要暂停任务以允许自主无人航空器降落充电时会遭受时间与能源的损失。本文提出了一种解决方案，该方案结合了一种新颖的考虑阻力的模型 formulations，并与 MPC 相耦合，从而能够在无通信的情况下跟踪和着陆高速曲线轨迹的 USV。与现有技术相比，我们的方法将预测误差降低了 40%，并提供了 3 倍的预测 certainty 提高。这导致跟踪性能提高了 30%，并在即使对于传统海洋任务不可行的激进转弯中，着陆成功率也提高了 40%。我们在两种不同尺寸的海洋船只的两个不同真实场景中测试了这种方法，并通过仿真中的统计分析进一步验证了结果，以证明该方法的鲁棒性。', 'title_zh': 'CurviTrack: 曲线轨迹跟踪用于高速追逐USV'}
{'arxiv_id': 'arXiv:2502.21057', 'title': 'Robust Deterministic Policy Gradient for Disturbance Attenuation and Its Application to Quadrotor Control', 'authors': 'Taeho Lee, Donghwan Lee', 'link': 'https://arxiv.org/abs/2502.21057', 'abstract': 'Practical control systems pose significant challenges in identifying optimal control policies due to uncertainties in the system model and external disturbances. While $H_\\infty$ control techniques are commonly used to design robust controllers that mitigate the effects of disturbances, these methods often require complex and computationally intensive calculations. To address this issue, this paper proposes a reinforcement learning algorithm called Robust Deterministic Policy Gradient (RDPG), which formulates the $H_\\infty$ control problem as a two-player zero-sum dynamic game. In this formulation, one player (the user) aims to minimize the cost, while the other player (the adversary) seeks to maximize it. We then employ deterministic policy gradient (DPG) and its deep reinforcement learning counterpart to train a robust control policy with effective disturbance attenuation. In particular, for practical implementation, we introduce an algorithm called robust deep deterministic policy gradient (RDDPG), which employs a deep neural network architecture and integrates techniques from the twin-delayed deep deterministic policy gradient (TD3) to enhance stability and learning efficiency. To evaluate the proposed algorithm, we implement it on an unmanned aerial vehicle (UAV) tasked with following a predefined path in a disturbance-prone environment. The experimental results demonstrate that the proposed method outperforms other control approaches in terms of robustness against disturbances, enabling precise real-time tracking of moving targets even under severe disturbance conditions.', 'abstract_zh': '实用控制系统因系统模型的不确定性及外部干扰而导致在识别最优控制策略方面面临重大挑战。虽然 $H_\\infty$ 控制技术常用于设计鲁棒控制器以缓解干扰的影响，但这些方法往往需要复杂且计算密集的计算。为解决这一问题，本文提出了一种鲁棒确定性策略梯度(RDPG)强化学习算法，将 $H_\\infty$ 控制问题表述为两人零和动态博弈。在此表述中，一方（用户）旨在最小化成本，而另一方（对手）则试图最大化成本。然后，我们利用确定性策略梯度(DPG)及其深度强化学习对应的版本来训练具有有效干扰衰减的鲁棒控制策略。特别是为了实际实施，我们引入了一种称为鲁棒深度确定性策略梯度(RD-DPG)的算法，该算法采用深度神经网络架构，并结合了双延迟深度确定性策略梯度(TD3)技术以提高稳定性和学习效率。为了评估所提出的方法，我们在一个在多干扰环境中跟踪预定义路径的无人驾驶航空器(UAV)上实现该算法。实验结果表明，所提出的方法在抵抗干扰方面优于其他控制方法，能够在严重干扰条件下实现精确的实时追踪。', 'title_zh': '鲁棒确定性策略梯度在干扰衰减中的应用及其在四旋翼控制中的应用'}
{'arxiv_id': 'arXiv:2502.21029', 'title': 'Sixth-Sense: Self-Supervised Learning of Spatial Awareness of Humans from a Planar Lidar', 'authors': 'Simone Arreghini, Nicholas Carlotti, Mirko Nava, Antonio Paolillo, Alessandro Giusti', 'link': 'https://arxiv.org/abs/2502.21029', 'abstract': 'Localizing humans is a key prerequisite for any service robot operating in proximity to people. In these scenarios, robots rely on a multitude of state-of-the-art detectors usually designed to operate with RGB-D cameras or expensive 3D LiDARs. However, most commercially available service robots are equipped with cameras with a narrow field of view, making them blind when a user is approaching from other directions, or inexpensive 1D LiDARs whose readings are difficult to interpret. To address these limitations, we propose a self-supervised approach to detect humans and estimate their 2D pose from 1D LiDAR data, using detections from an RGB-D camera as a supervision source. Our approach aims to provide service robots with spatial awareness of nearby humans. After training on 70 minutes of data autonomously collected in two environments, our model is capable of detecting humans omnidirectionally from 1D LiDAR data in a novel environment, with 71% precision and 80% recall, while retaining an average absolute error of 13 cm in distance and 44° in orientation.', 'abstract_zh': '面向人体局部化的自监督方法：基于1D LiDAR数据的服务机器人环境感知', 'title_zh': '六感：基于平面激光雷达的人类空间意识自监督学习'}
{'arxiv_id': 'arXiv:2502.21019', 'title': 'Nano Drone-based Indoor Crime Scene Analysis', 'authors': 'Martin Cooney, Sivadinesh Ponrajan, Fernando Alonso-Fernandez', 'link': 'https://arxiv.org/abs/2502.21019', 'abstract': 'Technologies such as robotics, Artificial Intelligence (AI), and Computer Vision (CV) can be applied to crime scene analysis (CSA) to help protect lives, facilitate justice, and deter crime, but an overview of the tasks that can be automated has been lacking. Here we follow a speculate prototyping approach: First, the STAIR tool is used to rapidly review the literature and identify tasks that seem to have not received much attention, like accessing crime sites through a window, mapping/gathering evidence, and analyzing blood smears. Secondly, we present a prototype of a small drone that implements these three tasks with 75%, 85%, and 80% performance, to perform a minimal analysis of an indoor crime scene. Lessons learned are reported, toward guiding next work in the area.', 'abstract_zh': '机器人、人工智能（AI）和计算机视觉（CV）技术可以应用于犯罪现场分析（CSA），以保护生命、促进正义和威慑犯罪，但自动化可执行的任务概述尚缺乏。在这里，我们采用推测性原型设计方法：首先，使用STAIR工具迅速回顾文献，识别出尚未得到足够关注的任务，例如通过窗户访问犯罪现场、制图/收集证据以及分析血痕。其次，我们提出一种小型无人机原型，该原型可实现上述三项任务，性能分别为75%、85%和80%，以执行室内犯罪现场的最小化分析。报告了所学经验教训，以指导该领域的后续工作。', 'title_zh': '基于纳米无人机的室内犯罪现场分析'}
{'arxiv_id': 'arXiv:2502.20817', 'title': 'Learning-Based Leader Localization for Underwater Vehicles With Optical-Acoustic-Pressure Sensor Fusion', 'authors': 'Mingyang Yang, Zeyu Sha, Feitian Zhang', 'link': 'https://arxiv.org/abs/2502.20817', 'abstract': 'Underwater vehicles have emerged as a critical technology for exploring and monitoring aquatic environments. The deployment of multi-vehicle systems has gained substantial interest due to their capability to perform collaborative tasks with improved efficiency. However, achieving precise localization of a leader underwater vehicle within a multi-vehicle configuration remains a significant challenge, particularly in dynamic and complex underwater conditions. To address this issue, this paper presents a novel tri-modal sensor fusion neural network approach that integrates optical, acoustic, and pressure sensors to localize the leader vehicle. The proposed method leverages the unique strengths of each sensor modality to improve localization accuracy and robustness. Specifically, optical sensors provide high-resolution imaging for precise relative positioning, acoustic sensors enable long-range detection and ranging, and pressure sensors offer environmental context awareness. The fusion of these sensor modalities is implemented using a deep learning architecture designed to extract and combine complementary features from raw sensor data. The effectiveness of the proposed method is validated through a custom-designed testing platform. Extensive data collection and experimental evaluations demonstrate that the tri-modal approach significantly improves the accuracy and robustness of leader localization, outperforming both single-modal and dual-modal methods.', 'abstract_zh': '水下无人车辆已成为探索和监测水生环境的关键技术。多车辆系统的部署因其能够执行协作任务并提高效率而引起了广泛关注。然而，在动态和复杂的水下条件下，精确定位多车辆配置中的领航车辆仍然是一个重大挑战。为了应对这一问题，本文提出了一种新颖的三模态传感器融合神经网络方法，该方法结合了光学、声学和压力传感器以定位领航车辆。所提出的方法利用了每种传感器模态的独特优势，以提高定位精度和鲁棒性。具体而言，光学传感器提供高分辨率成像以实现精确的相对定位，声学传感器实现远距离检测和测距，而压力传感器提供环境上下文意识。这三种传感器模态的融合是通过一种设计用于从原始传感器数据中提取和结合互补特征的深度学习架构实现的。通过一个定制设计的测试平台验证了所提出方法的有效性。大量数据收集和实验评估表明，三模态方法显著提高了领航车辆定位的准确性和鲁棒性，优于单模态和双模态方法。', 'title_zh': '基于学习的水下自主车辆 optics-acoustics-pressure 传感器融合领导者定位'}
{'arxiv_id': 'arXiv:2502.20731', 'title': 'Indoor Localization for Autonomous Robot Navigation', 'authors': 'Sean Kouma, Rachel Masters', 'link': 'https://arxiv.org/abs/2502.20731', 'abstract': 'Indoor positioning systems (IPSs) have gained attention as outdoor navigation becomes prevalent in everyday life. Research is being actively conducted on how indoor smartphone navigation can be accomplished and improved using received signal strength indication (RSSI) and machine learning (ML). IPSs have more use cases that need further exploration, and we aim to explore using IPSs for the indoor navigation of an autonomous robot. We collected a dataset and trained models to test on a robot. We also developed an A* path-planning algorithm so that our robot could navigate itself using predicted directions. After testing different network structures, our robot was able to successfully navigate corners around 50 percent of the time. The findings of this paper indicate that using IPSs for autonomous robots is a promising area of future research.', 'abstract_zh': 'Indoor定位系统（IPSs）随着户外导航在日常生活中的普及而引起了关注。研究人员正在积极探讨如何利用接收信号强度指示（RSSI）和机器学习（ML）来实现和改进室内的智能手机导航。IPSs具有更多的应用场景有待进一步探索，我们旨在利用IPSs实现自主机器人在室内的导航。我们收集了数据集并对模型进行了训练，以便在机器人上进行测试。我们还开发了A*路径规划算法，使我们的机器人能够根据预测的方向自主导航。经过测试不同的网络结构后，我们发现机器人能够成功导航拐角处的比例约为50%。本文的研究成果表明，利用IPSs进行自主机器人导航是一个充满前景的研究领域。', 'title_zh': '室内定位以实现自主机器人导航'}
{'arxiv_id': 'arXiv:2502.20693', 'title': 'From Safety Standards to Safe Operation with Mobile Robotic Systems Deployment', 'authors': 'Bruno Belzile, Tatiana Wanang-Siyapdjie, Sina Karimi, Rafael Gomes Braga, Ivanka Iordanova, David St-Onge', 'link': 'https://arxiv.org/abs/2502.20693', 'abstract': 'Mobile robotic systems are increasingly used in various work environments to support productivity. However, deploying robots in workplaces crowded by human workers and interacting with them results in safety challenges and concerns, namely robot-worker collisions and worker distractions in hazardous environments. Moreover, the literature on risk assessment as well as the standard specific to mobile platforms is rather limited. In this context, this paper first conducts a review of the relevant standards and methodologies and then proposes a risk assessment for the safe deployment of mobile robots on construction sites. The approach extends relevant existing safety standards to encompass uncovered scenarios. Safety recommendations are made based on the framework, after its validation by field experts.', 'abstract_zh': '移动机器人系统在各种工作环境中的应用日益增多，以支持生产效率。然而，将机器人部署在拥挤的人工作业环境并与人交互时，会带来安全挑战和担忧，包括机器人与工人的碰撞以及在危险环境中工人注意力分散。此外，关于风险评估的文献以及针对移动平台的标准相当有限。在此背景下，本文首先回顾了相关标准和方法，并提出了一种适用于建筑工地的移动机器人安全部署的风险评估方法。该方法将现有相关安全标准扩展到涵盖未覆盖的场景，并基于该框架的现场专家验证提出安全建议。', 'title_zh': '从安全标准到移动机器人系统部署的安全运行'}
{'arxiv_id': 'arXiv:2502.20549', 'title': 'Toward Fully Autonomous Flexible Chunk-Based Aerial Additive Manufacturing: Insights from Experimental Validation', 'authors': 'Marios-Nektarios Stamatopoulos, Jakub Haluska, Elias Small, Jude Marroush, Avijit Banerjee, George Nikolakopoulos', 'link': 'https://arxiv.org/abs/2502.20549', 'abstract': "A novel autonomous chunk-based aerial additive manufacturing framework is presented, supported with experimental demonstration advancing aerial 3D printing. An optimization-based decomposition algorithm transforms structures into sub-components, or chunks, treated as individual tasks coordinated via a dependency graph, ensuring sequential assignment to UAVs considering inter-dependencies and printability constraints for seamless execution. A specially designed hexacopter equipped with a pressurized canister for lightweight expandable foam extrusion is utilized to deposit the material in a controlled manner. To further enhance precise execution of the printing, an offset-free Model Predictive Control mechanism is considered compensating reactively for disturbances and ground effect during execution. Additionally, an interlocking mechanism is introduced in the chunking process to enhance structural cohesion and improve layer adhesion. Extensive experiments demonstrate the framework's effectiveness in constructing precise structures of various shapes while seamlessly adapting to practical challenges, proving its potential for a transformative leap in aerial robotic capability for autonomous construction.", 'abstract_zh': '一种基于分块的新型自主空中增材制造框架，结合实验演示推进空中3D打印。基于优化分解算法将结构分解为子组件或分块，作为个体任务通过依赖图协调，确保考虑相互依赖性和可打印性约束顺序分配给无人机，实现无缝执行。一种特别设计的六旋翼无人机配备有轻型可扩展泡沫挤出装置的压力罐，用于在受控状态下沉积材料。为了进一步提高打印执行的精确性，考虑了一种无偏移的模型预测控制机制，以在执行过程中反应性地补偿干扰和地面效应。此外，在分块过程中引入了一种互锁机制，以增强结构的凝聚力和提高层间粘附性。广泛的实验证明了该框架在构建各种形状的精确结构时能无缝适应实际挑战，证明了其在自主建筑领域为空中机器人能力带来的革命性飞跃。', 'title_zh': '面向完全自主柔性块状 aerial 融合制造的探究：来自实验验证的见解'}
{'arxiv_id': 'arXiv:2502.20524', 'title': 'Unified Feedback Linearization for Nonlinear Systems with Dexterous and Energy-Saving Modes', 'authors': 'Mirko Mizzoni, Pieter van Goor, Antonio Franchi', 'link': 'https://arxiv.org/abs/2502.20524', 'abstract': 'Systems with a high number of inputs compared to the degrees of freedom (e.g. a mobile robot with Mecanum wheels) often have a minimal set of energy-efficient inputs needed to achieve a main task (e.g. position tracking) and a set of energy-intense inputs needed to achieve an additional auxiliary task (e.g. orientation tracking). This letter presents a unified control scheme, derived through feedback linearization, that can switch between two modes: an energy-saving mode, which tracks the main task using only the energy-efficient inputs while forcing the energy-intense inputs to zero, and a dexterous mode, which also uses the energy-intense inputs to track the auxiliary task as needed. The proposed control guarantees the exponential tracking of the main task and that the dynamics associated with the main task evolve independently of the a priori unknown switching signal. When the control is operating in dexterous mode, the exponential tracking of the auxiliary task is also guaranteed. Numerical simulations on an omnidirectional Mecanum wheel robot validate the effectiveness of the proposed approach and demonstrate the effect of the switching signal on the exponential tracking behavior of the main and auxiliary tasks.', 'abstract_zh': '具有大量输入相对于自由度而言的系统（例如配有Mecanum轮的移动机器人）通常仅需要一组能量高效输入来完成主要任务（例如位置跟踪），同时还需要一组能量密集输入来完成辅助任务（例如定向跟踪）。本通信提出了一种通过反馈线性化导出的统一控制方案，该方案可以在两种模式之间切换：节能模式下仅使用能量高效输入跟踪主要任务，并强制能量密集输入为零；灵巧模式下利用能量密集输入根据需要跟踪辅助任务。所提出的控制方案保证了主要任务的指数级跟踪，并确保与主要任务相关的动态演化与先验未知的切换信号独立。当控制处于灵巧模式时，副任务的指数级跟踪也被保证。数值仿真验证了所提出方法的有效性，并展示了切换信号对主要任务和辅助任务指数级跟踪行为的影响。', 'title_zh': '统一反馈线性化方法用于具有灵巧和节能模式的非线性系统'}
{'arxiv_id': 'arXiv:2502.20500', 'title': 'Equivariant Reinforcement Learning Frameworks for Quadrotor Low-Level Control', 'authors': 'Beomyeol Yu, Taeyoung Lee', 'link': 'https://arxiv.org/abs/2502.20500', 'abstract': 'Improving sampling efficiency and generalization capability is critical for the successful data-driven control of quadrotor unmanned aerial vehicles (UAVs) that are inherently unstable. While various reinforcement learning (RL) approaches have been applied to autonomous quadrotor flight, they often require extensive training data, posing multiple challenges and safety risks in practice. To address these issues, we propose data-efficient, equivariant monolithic and modular RL frameworks for quadrotor low-level control. Specifically, by identifying the rotational and reflectional symmetries in quadrotor dynamics and encoding these symmetries into equivariant network models, we remove redundancies of learning in the state-action space. This approach enables the optimal control action learned in one configuration to automatically generalize into other configurations via symmetry, thereby enhancing data efficiency. Experimental results demonstrate that our equivariant approaches significantly outperform their non-equivariant counterparts in terms of learning efficiency and flight performance.', 'abstract_zh': '提高采样效率和泛化能力是成功实现固有不稳定的四旋翼无人机数据驱动控制的关键。虽然各种强化学习（RL）方法已被应用于自主四旋翼飞行，但它们往往需要大量的训练数据，实践中这会带来多个挑战和安全风险。为解决这些问题，我们提出了四旋翼低级控制的数据高效且共变的统一和模块化RL框架。具体而言，通过识别四旋翼动力学中的旋转和反射对称性，并将这些对称性编码到共变网络模型中，我们消除了状态-动作空间中的冗余学习。这种方法通过对称性使得在一个配置中学习到的最优控制动作能够自动泛化到其他配置，从而提高数据效率。实验结果表明，我们的共变方法在学习效率和飞行性能方面明显优于非共变方法。', 'title_zh': '四旋翼低级控制的 equivariant 强化学习框架'}
