{'arxiv_id': 'arXiv:2507.22042', 'title': 'A Nonlinear MPC Framework for Loco-Manipulation of Quadrupedal Robots with Non-Negligible Manipulator Dynamics', 'authors': 'Ruturaj Sambhus, Kapi Ketan Mehta, Ali MirMohammad Sadeghi, Basit Muhammad Imran, Jeeseop Kim, Taizoon Chunawala, Vittorio Pastore, Sujith Vijayan, Kaveh Akbari Hamed', 'link': 'https://arxiv.org/abs/2507.22042', 'abstract': 'Model predictive control (MPC) combined with reduced-order template models has emerged as a powerful tool for trajectory optimization in dynamic legged locomotion. However, loco-manipulation tasks performed by legged robots introduce additional complexity, necessitating computationally efficient MPC algorithms capable of handling high-degree-of-freedom (DoF) models. This letter presents a computationally efficient nonlinear MPC (NMPC) framework tailored for loco-manipulation tasks of quadrupedal robots equipped with robotic manipulators whose dynamics are non-negligible relative to those of the quadruped. The proposed framework adopts a decomposition strategy that couples locomotion template models -- such as the single rigid body (SRB) model -- with a full-order dynamic model of the robotic manipulator for torque-level control. This decomposition enables efficient real-time solution of the NMPC problem in a receding horizon fashion at 60 Hz. The optimal state and input trajectories generated by the NMPC for locomotion are tracked by a low-level nonlinear whole-body controller (WBC) running at 500 Hz, while the optimal torque commands for the manipulator are directly applied. The layered control architecture is validated through extensive numerical simulations and hardware experiments on a 15-kg Unitree Go2 quadrupedal robot augmented with a 4.4-kg 4-DoF Kinova arm. Given that the Kinova arm dynamics are non-negligible relative to the Go2 base, the proposed NMPC framework demonstrates robust stability in performing diverse loco-manipulation tasks, effectively handling external disturbances, payload variations, and uneven terrain.', 'abstract_zh': '基于减少阶次模板模型的非线性模型预测控制框架在四足机器人携带操作任务中的应用', 'title_zh': '一种考虑非轻量 manipulator 动力学的四足机器人操作调控的非线性 MPC 框架'}
{'arxiv_id': 'arXiv:2507.21981', 'title': 'DISCOVERSE: Efficient Robot Simulation in Complex High-Fidelity Environments', 'authors': 'Yufei Jia, Guangyu Wang, Yuhang Dong, Junzhe Wu, Yupei Zeng, Haonan Lin, Zifan Wang, Haizhou Ge, Weibin Gu, Kairui Ding, Zike Yan, Yunjie Cheng, Yue Li, Ziming Wang, Chuxuan Li, Wei Sui, Lu Shi, Guanzhong Tian, Ruqi Huang, Guyue Zhou', 'link': 'https://arxiv.org/abs/2507.21981', 'abstract': 'We present the first unified, modular, open-source 3DGS-based simulation framework for Real2Sim2Real robot learning. It features a holistic Real2Sim pipeline that synthesizes hyper-realistic geometry and appearance of complex real-world scenarios, paving the way for analyzing and bridging the Sim2Real gap. Powered by Gaussian Splatting and MuJoCo, Discoverse enables massively parallel simulation of multiple sensor modalities and accurate physics, with inclusive supports for existing 3D assets, robot models, and ROS plugins, empowering large-scale robot learning and complex robotic benchmarks. Through extensive experiments on imitation learning, Discoverse demonstrates state-of-the-art zero-shot Sim2Real transfer performance compared to existing simulators. For code and demos: this https URL.', 'abstract_zh': '我们提出了首个基于3DGS的一体化、模块化和开源的从真实到模拟再到真实的机器人学习仿真框架。该框架具备统合的从真实到模拟管道，合成复杂真实场景的超逼真几何和外观，为分析和弥合模拟到真实差距铺平了道路。得益于高斯点云计算和MuJoCo的支持，Discoverse能够大规模并行模拟多种传感器模态和精确的物理过程，并兼容现有的3D资产、机器人模型和ROS插件，助力大规模机器人学习和复杂机器人基准测试。通过在模仿学习上的广泛实验，Discoverse展示了与现有仿真器相比最先进的零样本模拟到真实转移性能。更多代码和演示，请访问：这个链接。', 'title_zh': 'DISCOVERSE: 在复杂高度保真环境中的高效机器人模拟'}
{'arxiv_id': 'arXiv:2507.21965', 'title': 'A Deep Learning-Driven Autonomous System for Retinal Vein Cannulation: Validation Using a Chicken Embryo Model', 'authors': 'Yi Wang, Peiyao Zhang, Mojtaba Esfandiari, Peter Gehlbach, Iulian I. Iordachita', 'link': 'https://arxiv.org/abs/2507.21965', 'abstract': 'Retinal vein cannulation (RVC) is a minimally invasive microsurgical procedure for treating retinal vein occlusion (RVO), a leading cause of vision impairment. However, the small size and fragility of retinal veins, coupled with the need for high-precision, tremor-free needle manipulation, create significant technical challenges. These limitations highlight the need for robotic assistance to improve accuracy and stability. This study presents an automated robotic system with a top-down microscope and B-scan optical coherence tomography (OCT) imaging for precise depth sensing. Deep learning-based models enable real-time needle navigation, contact detection, and vein puncture recognition, using a chicken embryo model as a surrogate for human retinal veins. The system autonomously detects needle position and puncture events with 85% accuracy. The experiments demonstrate notable reductions in navigation and puncture times compared to manual methods. Our results demonstrate the potential of integrating advanced imaging and deep learning to automate microsurgical tasks, providing a pathway for safer and more reliable RVC procedures with enhanced precision and reproducibility.', 'abstract_zh': '视网膜静脉穿刺（RVC）是一种微创显微手术技术，用于治疗视网膜静脉阻塞（RVO），这是导致视力受损的主要原因之一。然而，视网膜静脉的小尺寸和脆弱性，以及高精度、无抖动针操作的需要，造成了显著的技术挑战。这些限制凸显了需要机器人辅助以提高准确性和稳定性的必要性。本研究提出了一种带有顶部显微镜和B扫光学相干断层扫描（OCT）成像的自动机器人系统，用于精确深度感知。基于深度学习的模型能够实现实时针操作导航、接触检测和静脉穿刺识别，使用鸡胚胎模型作为人类视网膜静脉的替代品。系统自主检测针位置和穿刺事件的准确率为85%。实验结果显示与手动方法相比，导航和穿刺时间显著减少。我们的结果表明，集成先进成像和深度学习以自动化显微手术任务的潜力，为提高RVC操作的安全性和可靠性提供了更为精确和可重复的方法。', 'title_zh': '基于深度学习的自主系统用于视网膜静脉穿刺：使用鸡胚胎模型进行验证'}
{'arxiv_id': 'arXiv:2507.21957', 'title': 'ODE Methods for Computing One-Dimensional Self-Motion Manifolds', 'authors': 'Dominic Guri, George Kantor', 'link': 'https://arxiv.org/abs/2507.21957', 'abstract': "Redundant manipulators are well understood to offer infinite joint configurations for achieving a desired end-effector pose. The multiplicity of inverse kinematics (IK) solutions allows for the simultaneous solving of auxiliary tasks like avoiding joint limits or obstacles. However, the most widely used IK solvers are numerical gradient-based iterative methods that inherently return a locally optimal solution. In this work, we explore the computation of self-motion manifolds (SMMs), which represent the set of all joint configurations that solve the inverse kinematics problem for redundant manipulators. Thus, SMMs are global IK solutions for redundant manipulators. We focus on task redundancies of dimensionality 1, introducing a novel ODE formulation for computing SMMs using standard explicit fixed-step ODE integrators. We also address the challenge of ``inducing'' redundancy in otherwise non-redundant manipulators assigned to tasks naturally described by one degree of freedom less than the non-redundant manipulator. Furthermore, recognizing that SMMs can consist of multiple disconnected components, we propose methods for searching for these separate SMM components. Our formulations and algorithms compute accurate SMM solutions without requiring additional IK refinement, and we extend our methods to prismatic joint systems -- an area not covered in current SMM literature. This manuscript presents the derivation of these methods and several examples that show how the methods work and their limitations.", 'abstract_zh': '冗余 manipulator 的自运动流形 (SMM) 为实现期望末端执行器姿态提供了无穷多的关节配置。逆运动学 (IK) 解的多样性允许同时解决辅助任务，如避免关节限制或障碍。然而，广泛使用的 IK 求解器本质上是基于数值梯度的迭代方法，只能提供局部最优解。在本文中，我们探讨了自运动流形 (SMMs) 的计算，这代表了所有解决冗余 manipulator 逆运动学问题的关节配置集合。因此，SMMs 是冗余 manipulator 的全局 IK 解。我们专注于维数为 1 的任务冗余性，引入了一种新的 ODE 表述方法，使用标准明确固定步长 ODE 积分器来计算 SMMs。我们还解决了在任务自然描述上少一个自由度的非冗余 manipulator 中引入“冗余性”的挑战。此外，鉴于 SMM 可能由多个不连通的部分组成，我们提出了搜索这些独立 SMM 部分的方法。我们的表述和算法可以在无需额外 IK 精细化的情况下计算准确的 SMM 解，并将方法扩展到柱形关节系统——这是当前 SMM 文献中未涵盖的领域。本文阐述了这些方法的推导以及一些示例，展示了方法的工作原理及其限制。', 'title_zh': 'ODE方法计算一维自我运动流形'}
{'arxiv_id': 'arXiv:2507.21896', 'title': 'A Systematic Robot Design Optimization Methodology with Application to Redundant Dual-Arm Manipulators', 'authors': 'Dominic Guri, George Kantor', 'link': 'https://arxiv.org/abs/2507.21896', 'abstract': 'One major recurring challenge in deploying manipulation robots is determining the optimal placement of manipulators to maximize performance. This challenge is exacerbated in complex, cluttered agricultural environments of high-value crops, such as flowers, fruits, and vegetables, that could greatly benefit from robotic systems tailored to their specific requirements. However, the design of such systems remains a challenging, intuition-driven process, limiting the affordability and adoption of robotics-based automation by domain experts like farmers. To address this challenge, we propose a four-part design optimization methodology for automating the development of task-specific robotic systems. This framework includes (a) a robot design model, (b) task and environment representations for simulation, (c) task-specific performance metrics, and (d) optimization algorithms for refining configurations. We demonstrate our framework by optimizing a dual-arm robotic system for pepper harvesting using two off-the-shelf redundant manipulators. To enhance performance, we introduce novel task metrics that leverage self-motion manifolds to characterize manipulator redundancy comprehensively. Our results show that our framework achieves simultaneous improvements in reachability success rates and improvements in dexterity. Specifically, our approach improves reachability success by at least 14\\% over baseline methods and achieves over 30\\% improvement in dexterity based on our task-specific metric.', 'abstract_zh': '部署操作机器人的一大反复出现的挑战是确定操作臂的最佳放置位置以最大化性能。这一挑战在高价值作物（如花卉、水果和蔬菜）复杂的杂乱农业环境中尤为突出，这些作物能够显著受益于定制化的需求的机器人系统。然而，设计此类系统仍然是一个具有挑战性的直觉驱动过程，限制了基于机器人自动化系统的成本效益及其在如农民等领域专家中的应用。为解决这一挑战，我们提出了一个四部分的设计优化方法论，用于自动化特定任务的机器人系统的开发。该框架包括（a）机器人设计模型，（b）用于仿真任务和环境的表示，（c）特定任务的性能指标，以及（d）用于完善配置的优化算法。我们通过优化用于甜椒收获的双臂机器人系统，基于现货冗余操作臂，展示了我们的框架。为了提高性能，我们引入了新的任务指标，利用自我运动流形全面表征操作臂的冗余性。结果显示，我们的框架在可达性成功率和灵巧度方面同时取得了改进。具体来说，我们的方法在可达性成功率方面至少比基线方法提高了14%，并且基于我们特定任务的指标，在灵巧度方面达到了30%以上的改进。', 'title_zh': '一种系统的机器人设计优化方法及其在冗余双臂 manipulator 中的应用'}
{'arxiv_id': 'arXiv:2507.21859', 'title': 'Evaluating Interactions between Automated Vehicles and Cyclists using a coupled In-the-Loop Test Environment', 'authors': 'Michael Kaiser, Clemens Groß, Lisa Marie Otto, Steffen Müller', 'link': 'https://arxiv.org/abs/2507.21859', 'abstract': 'Testing and evaluating automated driving systems (ADS) in interactions with vulnerable road users (VRUs), such as cyclists, are essential for improving the safety of VRUs, but often lack realism. This paper presents and validates a coupled in-the-loop test environment that integrates a Cyclist-in-the Loop test bench with a Vehicle-in-the-Loop test bench via a virtual environment (VE) developed in Unreal Engine 5. The setup enables closed-loop, bidirectional interaction between a real human cyclist and a real automated vehicle under safe and controllable conditions. The automated vehicle reacts to cyclist gestures via stimulated camera input, while the cyclist, riding a stationary bicycle, perceives and reacts to the vehicle in the VE in real time. Validation experiments are conducted using a real automated shuttle bus with a track-and-follow function, performing three test maneuvers - straight-line driving with stop, circular track driving, and double lane change - on a proving ground and in the coupled in-the-loop test environment. The performance is evaluated by comparing the resulting vehicle trajectories in both environments. Additionally, the introduced latencies of individual components in the test setup are measured. The results demonstrate the feasibility of the approach and highlight its strengths and limitations for realistic ADS evaluation.', 'abstract_zh': '测试和评估 Automated Driving Systems (ADS) 在与行人等弱势道路使用者 (VRUs) 互动中的现实性：一种通过虚拟环境将 Cyclist-in-the-Loop 测试台与 Vehicle-in-the-Loop 测试台耦合的在环测试环境验证方法', 'title_zh': '评估自动驾驶车辆与自行车骑行者交互的耦合在环测试环境方法'}
{'arxiv_id': 'arXiv:2507.21814', 'title': 'Interactive Adversarial Testing of Autonomous Vehicles with Adjustable Confrontation Intensity', 'authors': 'Yicheng Guo, Chengkai Xu, Jiaqi Liu, Hao Zhang, Peng Hang, Jian Sun', 'link': 'https://arxiv.org/abs/2507.21814', 'abstract': "Scientific testing techniques are essential for ensuring the safe operation of autonomous vehicles (AVs), with high-risk, highly interactive scenarios being a primary focus. To address the limitations of existing testing methods, such as their heavy reliance on high-quality test data, weak interaction capabilities, and low adversarial robustness, this paper proposes ExamPPO, an interactive adversarial testing framework that enables scenario-adaptive and intensity-controllable evaluation of autonomous vehicles. The framework models the Surrounding Vehicle (SV) as an intelligent examiner, equipped with a multi-head attention-enhanced policy network, enabling context-sensitive and sustained behavioral interventions. A scalar confrontation factor is introduced to modulate the intensity of adversarial behaviors, allowing continuous, fine-grained adjustment of test difficulty. Coupled with structured evaluation metrics, ExamPPO systematically probes AV's robustness across diverse scenarios and strategies. Extensive experiments across multiple scenarios and AV strategies demonstrate that ExamPPO can effectively modulate adversarial behavior, expose decision-making weaknesses in tested AVs, and generalize across heterogeneous environments, thereby offering a unified and reproducible solution for evaluating the safety and intelligence of autonomous decision-making systems.", 'abstract_zh': '科学测试技术对于确保自动驾驶车辆的安全运行至关重要，高风险、高度交互的场景是主要关注点。为了应对现有测试方法的局限性，如对高质量测试数据的高度依赖、弱交互能力和低对抗鲁棒性等问题，本文提出了一种名为ExamPPO的交互式对抗测试框架，该框架能够实现场景自适应和强度可控的自动驾驶车辆评估。该框架将周围车辆（SV）建模为智能考官，并配备了多头注意机制增强的策略网络，能够实现上下文敏感和持续的行为干预。引入了一个标量对抗因子来调节对抗行为的强度，允许对测试难度进行连续的细微调整。结合结构化的评估指标，ExamPPO系统地探究了自动驾驶车辆在多种场景和策略下的鲁棒性。通过在多个场景和自动驾驶策略下的广泛实验，证明ExamPPO能够有效调节对抗行为，揭示测试自动驾驶车辆的决策弱点，并在异构环境中泛化，从而提供了一种统一且可再现的评估自动驾驶决策系统安全性和智能性的解决方案。标题：ExamPPO：一种交互式对抗测试框架', 'title_zh': '可调对抗强度的自主车辆互动对抗性测试'}
{'arxiv_id': 'arXiv:2507.21796', 'title': 'MoDeSuite: Robot Learning Task Suite for Benchmarking Mobile Manipulation with Deformable Objects', 'authors': 'Yuying Zhang, Kevin Sebastian Luck, Francesco Verdoja, Ville Kyrki, Joni Pajarinen', 'link': 'https://arxiv.org/abs/2507.21796', 'abstract': "Mobile manipulation is a critical capability for robots operating in diverse, real-world environments. However, manipulating deformable objects and materials remains a major challenge for existing robot learning algorithms. While various benchmarks have been proposed to evaluate manipulation strategies with rigid objects, there is still a notable lack of standardized benchmarks that address mobile manipulation tasks involving deformable objects.\nTo address this gap, we introduce MoDeSuite, the first Mobile Manipulation Deformable Object task suite, designed specifically for robot learning. MoDeSuite consists of eight distinct mobile manipulation tasks covering both elastic objects and deformable objects, each presenting a unique challenge inspired by real-world robot applications. Success in these tasks requires effective collaboration between the robot's base and manipulator, as well as the ability to exploit the deformability of the objects. To evaluate and demonstrate the use of the proposed benchmark, we train two state-of-the-art reinforcement learning algorithms and two imitation learning algorithms, highlighting the difficulties encountered and showing their performance in simulation. Furthermore, we demonstrate the practical relevance of the suite by deploying the trained policies directly into the real world with the Spot robot, showcasing the potential for sim-to-real transfer. We expect that MoDeSuite will open a novel research domain in mobile manipulation involving deformable objects. Find more details, code, and videos at this https URL.", 'abstract_zh': '移动操作是机器人在多样化的真实环境中的关键能力。然而，操纵可变形物体和材料仍然是现有机器人学习算法的主要挑战。虽然已经提出了各种基准来评估使用刚体对象的操纵策略，但在涉及可变形物体的移动操纵任务方面仍缺乏标准化的基准。\n\n为了填补这一空白，我们引入了MoDeSuite——首个移动操纵可变形物体任务套件，专门设计用于机器人学习。MoDeSuite 包含八项不同的移动操纵任务，涵盖了弹性物体和可变形物体，每一项任务都以真实世界机器人应用为灵感，具有独特的挑战性。在这些任务中取得成功需要机器人基座和操作机构之间的有效协作，以及对物体可变形性的利用能力。为了评估和展示提议基准的使用，我们训练了两个最先进的强化学习算法和两个模仿学习算法，突显了遇到的困难并展示了它们在仿真中的性能。此外，我们通过直接将训练的策略部署到Spot机器人中，展示了套件的现实相关性，展示了仿真到现实过渡的潜力。我们期望MoDeSuite 将开启移动操纵领域中涉及可变形物体的全新研究方向。更多详情、代码和视频请访问：this https URL。', 'title_zh': 'MoDeSuite: 用于柔体物体移动操作基准测试的机器人任务套件'}
{'arxiv_id': 'arXiv:2507.21772', 'title': 'Multi-UAV Deployment in Obstacle-Cluttered Environments with LOS Connectivity', 'authors': 'Yuda Chen, Shuaikang Wang, Jie Li, Meng Guo', 'link': 'https://arxiv.org/abs/2507.21772', 'abstract': 'A reliable communication network is essential for multiple UAVs operating within obstacle-cluttered environments, where limited communication due to obstructions often occurs. A common solution is to deploy intermediate UAVs to relay information via a multi-hop network, which introduces two challenges: (i) how to design the structure of multihop networks; and (ii) how to maintain connectivity during collaborative motion. To this end, this work first proposes an efficient constrained search method based on the minimumedge RRT? algorithm, to find a spanning-tree topology that requires a less number of UAVs for the deployment task. Then, to achieve this deployment, a distributed model predictive control strategy is proposed for the online motion coordination. It explicitly incorporates not only the inter-UAV and UAVobstacle distance constraints, but also the line-of-sight (LOS) connectivity constraint. These constraints are well-known to be nonlinear and often tackled by various approximations. In contrast, this work provides a theoretical guarantee that all agent trajectories are ensured to be collision-free with a teamwise LOS connectivity at all time. Numerous simulations are performed in 3D valley-like environments, while hardware experiments validate its dynamic adaptation when the deployment position changes online.', 'abstract_zh': '多障碍物环境下多个无人机协同作业所需的可靠通信网络至关重要，由于障碍物引起的有限通信经常发生。一种常见的解决方案是在多跳网络中部署中间无人机以转发信息，这引入了两个挑战：（i）如何设计多跳网络的结构；以及（ii）如何在协同运动过程中保持连接性。为此，本工作首先提出了一种基于最小边RRT?算法的有效约束搜索方法，以找到一种需要较少无人机部署的任务伸展树拓扑结构。然后，提出了一种分布式模型预测控制策略以实现该部署，该策略在线运动协调中明确地考虑了无人机间和无人机与障碍物的距离约束以及视线（LOS）连通性约束。这些约束是非线性的，通常通过各种近似方法来处理。相比之下，本工作提供了理论保证，即所有智能体轨迹在所有时间点都确保了团队级的视线连通性和无碰撞。在具有3D山谷特征的环境中进行了大量仿真实验，并通过硬件实验验证了其在线部署位置变化时的动态适应能力。', 'title_zh': '多LOS连接条件下的障碍杂乱环境多无人机部署'}
{'arxiv_id': 'arXiv:2507.21709', 'title': 'Adaptive Prior Scene-Object SLAM for Dynamic Environments', 'authors': 'Haolan Zhang, Thanh Nguyen Canh, Chenghao Li, Nak Young Chong', 'link': 'https://arxiv.org/abs/2507.21709', 'abstract': 'Visual Simultaneous Localization and Mapping (SLAM) plays a vital role in real-time localization for autonomous systems. However, traditional SLAM methods, which assume a static environment, often suffer from significant localization drift in dynamic scenarios. While recent advancements have improved SLAM performance in such environments, these systems still struggle with localization drift, particularly due to abrupt viewpoint changes and poorly characterized moving objects. In this paper, we propose a novel scene-object-based reliability assessment framework that comprehensively evaluates SLAM stability through both current frame quality metrics and scene changes relative to reliable reference frames. Furthermore, to tackle the lack of error correction mechanisms in existing systems when pose estimation becomes unreliable, we employ a pose refinement strategy that leverages information from reliable frames to optimize camera pose estimation, effectively mitigating the adverse effects of dynamic interference. Extensive experiments on the TUM RGB-D datasets demonstrate that our approach achieves substantial improvements in localization accuracy and system robustness under challenging dynamic scenarios.', 'abstract_zh': '基于场景-对象的可靠性评估框架在动态场景中提升SLAM定位精度和系统鲁棒性', 'title_zh': '自适应先验场景-对象SLAM技术在动态环境中的应用'}
{'arxiv_id': 'arXiv:2507.21610', 'title': 'Research Challenges and Progress in the End-to-End V2X Cooperative Autonomous Driving Competition', 'authors': 'Ruiyang Hao, Haibao Yu, Jiaru Zhong, Chuanye Wang, Jiahao Wang, Yiming Kan, Wenxian Yang, Siqi Fan, Huilin Yin, Jianing Qiu, Yao Mu, Jiankai Sun, Li Chen, Walter Zimmer, Dandan Zhang, Shanghang Zhang, Mac Schwager, Wei Huang, Xiaobo Zhang, Ping Luo, Zaiqing Nie', 'link': 'https://arxiv.org/abs/2507.21610', 'abstract': 'With the rapid advancement of autonomous driving technology, vehicle-to-everything (V2X) communication has emerged as a key enabler for extending perception range and enhancing driving safety by providing visibility beyond the line of sight. However, integrating multi-source sensor data from both ego-vehicles and infrastructure under real-world constraints, such as limited communication bandwidth and dynamic environments, presents significant technical challenges. To facilitate research in this area, we organized the End-to-End Autonomous Driving through V2X Cooperation Challenge, which features two tracks: cooperative temporal perception and cooperative end-to-end planning. Built on the UniV2X framework and the V2X-Seq-SPD dataset, the challenge attracted participation from over 30 teams worldwide and established a unified benchmark for evaluating cooperative driving systems. This paper describes the design and outcomes of the challenge, highlights key research problems including bandwidth-aware fusion, robust multi-agent planning, and heterogeneous sensor integration, and analyzes emerging technical trends among top-performing solutions. By addressing practical constraints in communication and data fusion, the challenge contributes to the development of scalable and reliable V2X-cooperative autonomous driving systems.', 'abstract_zh': '基于V2X合作的端到端自主驾驶挑战赛：设计与成果', 'title_zh': '端到端车对外协作自主驾驶竞赛中的研究挑战与进展'}
{'arxiv_id': 'arXiv:2507.21553', 'title': 'Multi-robot LiDAR SLAM: a practical case study in underground tunnel environments', 'authors': 'Federica Di Lauro, Domenico G. Sorrenti, Miguel Angel Sotelo', 'link': 'https://arxiv.org/abs/2507.21553', 'abstract': 'Multi-robot SLAM aims at localizing and building a map with multiple robots, interacting with each other. In the work described in this article, we analyze the pipeline of a decentralized LiDAR SLAM system to study the current limitations of the state of the art, and we discover a significant source of failures, i.e., that the loop detection is the source of too many false positives. We therefore develop and propose a new heuristic to overcome these limitations. The environment taken as reference in this work is the highly challenging case of underground tunnels. We also highlight potential new research areas still under-explored.', 'abstract_zh': '多机器人SLAM旨在通过多个交互的机器人进行定位和建图。在本文描述的工作中，我们分析了去中心化激光SLAM系统的流程以研究当前最先进的技术的局限性，并发现一个显著的失败根源，即环检测产生了过多的虚假阳性。因此，我们开发并提出了一种新的启发式方法来克服这些局限性。本文参考的环境是极具挑战性的地下隧道场景。我们还指出了仍待探索的潜在新研究领域。', 'title_zh': '地下隧道环境中的多机器人LiDAR SLAM：一种实际案例研究'}
{'arxiv_id': 'arXiv:2507.21545', 'title': 'Pretraining a Unified PDDL Domain from Real-World Demonstrations for Generalizable Robot Task Planning', 'authors': 'Haoming Ye, Yunxiao Xiao, Cewu Lu, Panpan Cai', 'link': 'https://arxiv.org/abs/2507.21545', 'abstract': 'Robotic task planning in real-world environments requires reasoning over implicit constraints from language and vision. While LLMs and VLMs offer strong priors, they struggle with long-horizon structure and symbolic grounding. Existing methods that combine LLMs with symbolic planning often rely on handcrafted or narrow domains, limiting generalization. We propose UniDomain, a framework that pre-trains a PDDL domain from robot manipulation demonstrations and applies it for online robotic task planning. It extracts atomic domains from 12,393 manipulation videos to form a unified domain with 3137 operators, 2875 predicates, and 16481 causal edges. Given a target class of tasks, it retrieves relevant atomics from the unified domain and systematically fuses them into high-quality meta-domains to support compositional generalization in planning. Experiments on diverse real-world tasks show that UniDomain solves complex, unseen tasks in a zero-shot manner, achieving up to 58% higher task success and 160% improvement in plan optimality over state-of-the-art LLM and LLM-PDDL baselines.', 'abstract_zh': '在现实环境中的机器人任务规划需要对语言和视觉中的隐式约束进行推理。尽管大语言模型和视觉语言模型提供了强大的先验知识，但它们在长时间结构和符号接地方面存在困难。现有将大语言模型与符号规划结合的方法往往依赖于手工制作或窄域，限制了泛化能力。我们提出了UniDomain框架，该框架通过机器人 manipulation 示范预先训练一个PDDL领域，并将其应用于在线机器人任务规划。它从12,393个manipulation视频中提取出原子领域，形成一个统一领域，包含3137个操作符、2875个谓词和16481条因果边。给定一个目标任务类别，它从统一领域中检索相关的原子，并系统地将它们融合成高质量的元领域，以支持规划中的组合泛化。在多种实时任务实验中，UniDomain以零样本方式解决了复杂且未见过的任务，与最先进的大语言模型和大语言模型结合PDDL基线相比，任务成功率提高了58%，计划优化性提高了160%。', 'title_zh': '基于真实世界示范的统一PDDL领域预训练以实现可泛化机器人任务规划'}
{'arxiv_id': 'arXiv:2507.21533', 'title': 'Model Predictive Adversarial Imitation Learning for Planning from Observation', 'authors': 'Tyler Han, Yanda Bao, Bhaumik Mehta, Gabriel Guo, Anubhav Vishwakarma, Emily Kang, Sanghun Jung, Rosario Scalise, Jason Zhou, Bryan Xu, Byron Boots', 'link': 'https://arxiv.org/abs/2507.21533', 'abstract': 'Human demonstration data is often ambiguous and incomplete, motivating imitation learning approaches that also exhibit reliable planning behavior. A common paradigm to perform planning-from-demonstration involves learning a reward function via Inverse Reinforcement Learning (IRL) then deploying this reward via Model Predictive Control (MPC). Towards unifying these methods, we derive a replacement of the policy in IRL with a planning-based agent. With connections to Adversarial Imitation Learning, this formulation enables end-to-end interactive learning of planners from observation-only demonstrations. In addition to benefits in interpretability, complexity, and safety, we study and observe significant improvements on sample efficiency, out-of-distribution generalization, and robustness. The study includes evaluations in both simulated control benchmarks and real-world navigation experiments using few-to-single observation-only demonstrations.', 'abstract_zh': '人类演示数据往往模糊且不完整，推动了兼具可靠规划行为的模仿学习方法。执行从演示进行规划的一种常见范式包括通过逆强化学习（IRL）学习奖励函数，然后通过模型预测控制（MPC）部署该奖励。为了统一这些方法，我们推导出IRL中策略的替代方案为基于规划的代理。与对抗性模仿学习有联系，这种表述 enables端到端基于观察的演示进行规划者的学习。除了在可解释性、复杂性和安全性上的好处外，我们研究并观察到在样本效率、离分布泛化能力和鲁棒性方面有显著改进。该研究包括在模拟控制基准和使用少量至单一观察演示的真实世界导航实验中的评估。', 'title_zh': '基于观测进行规划的预测对抗性模仿学习'}
{'arxiv_id': 'arXiv:2507.21517', 'title': 'LITE: A Learning-Integrated Topological Explorer for Multi-Floor Indoor Environments', 'authors': 'Junhao Chen, Zhen Zhang, Chengrui Zhu, Xiaojun Hou, Tianyang Hu, Huifeng Wu, Yong Liu', 'link': 'https://arxiv.org/abs/2507.21517', 'abstract': 'This work focuses on multi-floor indoor exploration, which remains an open area of research. Compared to traditional methods, recent learning-based explorers have demonstrated significant potential due to their robust environmental learning and modeling capabilities, but most are restricted to 2D environments. In this paper, we proposed a learning-integrated topological explorer, LITE, for multi-floor indoor environments. LITE decomposes the environment into a floor-stair topology, enabling seamless integration of learning or non-learning-based 2D exploration methods for 3D exploration. As we incrementally build floor-stair topology in exploration using YOLO11-based instance segmentation model, the agent can transition between floors through a finite state machine. Additionally, we implement an attention-based 2D exploration policy that utilizes an attention mechanism to capture spatial dependencies between different regions, thereby determining the next global goal for more efficient exploration. Extensive comparison and ablation studies conducted on the HM3D and MP3D datasets demonstrate that our proposed 2D exploration policy significantly outperforms all baseline explorers in terms of exploration efficiency. Furthermore, experiments in several 3D multi-floor environments indicate that our framework is compatible with various 2D exploration methods, facilitating effective multi-floor indoor exploration. Finally, we validate our method in the real world with a quadruped robot, highlighting its strong generalization capabilities.', 'abstract_zh': '本工作聚焦于多楼层室内探索，这是研究中的一个重要领域。与传统方法相比，近期的学习导向探索器由于其环境学习和建模能力的稳健性显示出巨大的发展潜力，但大多数仍局限于2D环境。在本文中，我们提出了一种集成学习的拓扑探索器LITE，用于多楼层室内环境。LITE将环境分解为楼层-楼梯拓扑结构，使得可以无缝集成基于学习或非学习的2D探索方法进行3D探索。在探索过程中，使用YOLO11基于实例分割模型增量构建楼层-楼梯拓扑结构，智能体可以通过有限状态机在楼层之间过渡。此外，我们实现了一种基于注意力机制的2D探索策略，利用注意力机制捕捉不同区域之间的空间依赖性，从而更有效地确定下一步的全局目标。在HM3D和MP3D数据集上的广泛比较和消融研究显示，我们提出的2D探索策略在探索效率上显著优于所有基线探索器。进一步的实验表明，我们的框架兼容各种2D探索方法，有利于有效进行多楼层室内探索。最后，我们在四足机器人上验证了该方法，突显了其强大的泛化能力。', 'title_zh': 'LITE: 一种集成学习的拓扑探索者，用于多层室内环境'}
{'arxiv_id': 'arXiv:2507.21506', 'title': 'Decision Transformer-Based Drone Trajectory Planning with Dynamic Safety-Efficiency Trade-Offs', 'authors': 'Chang-Hun Ji, SiWoon Song, Youn-Hee Han, SungTae Moon', 'link': 'https://arxiv.org/abs/2507.21506', 'abstract': 'A drone trajectory planner should be able to dynamically adjust the safety-efficiency trade-off according to varying mission requirements in unknown environments. Although traditional polynomial-based planners offer computational efficiency and smooth trajectory generation, they require expert knowledge to tune multiple parameters to adjust this trade-off. Moreover, even with careful tuning, the resulting adjustment may fail to achieve the desired trade-off. Similarly, although reinforcement learning-based planners are adaptable in unknown environments, they do not explicitly address the safety-efficiency trade-off. To overcome this limitation, we introduce a Decision Transformer-based trajectory planner that leverages a single parameter, Return-to-Go (RTG), as a \\emph{temperature parameter} to dynamically adjust the safety-efficiency trade-off. In our framework, since RTG intuitively measures the safety and efficiency of a trajectory, RTG tuning does not require expert knowledge. We validate our approach using Gazebo simulations in both structured grid and unstructured random environments. The experimental results demonstrate that our planner can dynamically adjust the safety-efficiency trade-off by simply tuning the RTG parameter. Furthermore, our planner outperforms existing baseline methods across various RTG settings, generating safer trajectories when tuned for safety and more efficient trajectories when tuned for efficiency. Real-world experiments further confirm the reliability and practicality of our proposed planner.', 'abstract_zh': '无人机航迹规划器应当根据未知环境下不断变化的任务需求，动态调整安全与效率之间的权衡。尽管基于传统多项式的规划器在计算效率和轨迹平滑性方面表现出色，但它们需要专家知识来调整多个参数以改变这种权衡，并且即使经过精心调整，也未必能达到理想的权衡。同样，尽管基于强化学习的规划器在未知环境中具有高度适应性，它们并未明确处理安全与效率之间的权衡。为克服这一局限性，我们提出了一种基于决策转换器的航迹规划器，通过单个参数Return-to-Go (RTG) 作为温度参数来动态调整安全与效率之间的权衡。在我们的框架中，由于RTG直观衡量了航迹的安全性和效率，因此RTG的调整无需专家知识。我们使用Gazebo仿真在结构化网格和未结构化随机环境中验证了该方法。实验结果表明，通过简单调整RTG参数，我们的规划器可以动态调整安全与效率之间的权衡。此外，我们的规划器在各种RTG设置下均优于现有基准方法，当调整以提高安全性时生成更安全的航迹，当调整以提高效率时生成更高效的航迹。现实世界的实验进一步证实了我们提出的规划器的可靠性和实用性。', 'title_zh': '基于决策变换器的无人机航迹规划与动态安全-效率权衡'}
{'arxiv_id': 'arXiv:2507.21496', 'title': 'Multifunctional physical reservoir computing in soft tensegrity robots', 'authors': 'Ryo Terajima, Katsuma Inoue, Kohei Nakajima, Yasuo Kuniyoshi', 'link': 'https://arxiv.org/abs/2507.21496', 'abstract': 'Recent studies have demonstrated that the dynamics of physical systems can be utilized for the desired information processing under the framework of physical reservoir computing (PRC). Robots with soft bodies are examples of such physical systems, and their nonlinear body-environment dynamics can be used to compute and generate the motor signals necessary for the control of their own behavior. In this simulation study, we extend this approach to control and embed not only one but also multiple behaviors into a type of soft robot called a tensegrity robot. The resulting system, consisting of the robot and the environment, is a multistable dynamical system that converges to different attractors from varying initial conditions. Furthermore, attractor analysis reveals that there exist "untrained attractors" in the state space of the system outside the training data. These untrained attractors reflect the intrinsic properties and structures of the tensegrity robot and its interactions with the environment. The impacts of these recent findings in PRC remain unexplored in embodied AI research. We here illustrate their potential to understand various features of embodied cognition that have not been fully addressed to date.', 'abstract_zh': '最近的研究表明，物理系统动态可以在物理蓄水库计算（PRC）框架下用于所需的信息处理。具有软体的机器人是这类物理系统的一个例子，它们的非线性身体-环境动力学可以用于计算和生成控制自身行为所需的运动信号。在本模拟研究中，我们将这种方法扩展到不仅控制，而且还嵌入多种行为到一类称为 tensegrity 机器人的软体机器人中。由此形成的系统，包括机器人和环境，在不同初始条件下的状态下会收敛到不同的吸引子。进一步的吸引子分析揭示，在系统的状态空间中存在“未训练的吸引子”，这些未训练的吸引子反映了 tensegrity 机器人的内在特性和其与环境的交互特性。这些近期发现对嵌入式AI研究的影响尚未被探索。在这里，我们展示了它们在理解到目前为止未充分解决的各种体现认知特性方面的潜在价值。', 'title_zh': '软 tensegrity 机器人中的多功能物理储桶计算'}
{'arxiv_id': 'arXiv:2507.21431', 'title': 'Sound Source Localization for Human-Robot Interaction in Outdoor Environments', 'authors': 'Victor Liu, Timothy Du, Jordy Sehn, Jack Collier, François Grondin', 'link': 'https://arxiv.org/abs/2507.21431', 'abstract': 'This paper presents a sound source localization strategy that relies on a microphone array embedded in an unmanned ground vehicle and an asynchronous close-talking microphone near the operator. A signal coarse alignment strategy is combined with a time-domain acoustic echo cancellation algorithm to estimate a time-frequency ideal ratio mask to isolate the target speech from interferences and environmental noise. This allows selective sound source localization, and provides the robot with the direction of arrival of sound from the active operator, which enables rich interaction in noisy scenarios. Results demonstrate an average angle error of 4 degrees and an accuracy within 5 degrees of 95\\% at a signal-to-noise ratio of 1dB, which is significantly superior to the state-of-the-art localization methods.', 'abstract_zh': '基于无人地面车辆内置麦克风阵列和操作员附近异步近讲麦克风的声源定位策略', 'title_zh': '户外环境中的声源定位与人类-机器人交互'}
{'arxiv_id': 'arXiv:2507.21384', 'title': 'Projecting the New Body: How Body Image Evolves During Learning to Walk with a Wearable Robot', 'authors': 'I-Chieh Lee, He Huang', 'link': 'https://arxiv.org/abs/2507.21384', 'abstract': 'Advances in wearable robotics challenge the traditional definition of human motor systems, as wearable robots redefine body structure, movement capability, and perception of their own bodies. We measured gait performance and perceived body images via Selected Coefficient of Perceived Motion, SCoMo, after each training session. Based on human motor learning theory extended to wearer-robot systems, we hypothesized that learning the perceived body image when walking with a robotic leg co-evolves with the actual gait improvement and becomes more certain and more accurate to the actual motion. Our result confirmed that motor learning improved both physical and perceived gait pattern towards normal, indicating that via practice the wearers incorporated the robotic leg into their sensorimotor systems to enable wearer-robot movement coordination. However, a persistent discrepancy between perceived and actual motion remained, likely due to the absence of direct sensation and control of the prosthesis from wearers. Additionally, the perceptual overestimation at the later training sessions might limit further motor improvement. These findings suggest that enhancing the human sense of wearable robots and frequent calibrating perception of body image are essential for effective training with lower limb wearable robots and for developing more embodied assistive technologies.', 'abstract_zh': '穿戴式机器人技术的进步挑战了传统的人体运动系统定义，穿戴式机器人重新定义了身体结构、运动能力和对自身身体的感知。我们在每次训练结束后通过选矿感知运动系数（SCoMo）测量了步态表现和感知的身体形象。基于扩展到穿戴者-机器人系统的运动学习理论，我们假设在使用假腿行走时感知身体形象的学习与实际步态改善同步进行，并且这种感知变得更加确定和准确。我们的结果显示，运动学习不仅改善了实际的步态模式，也向正常步态靠拢，表明穿戴者通过练习将假腿整合到其感觉运动系统中，以实现穿戴者-机器人运动协调。然而，感知与实际运动之间仍然存在持续的差异，这可能是由于穿戴者无法直接感受和控制假肢造成的。此外，后期训练中的感知过度估计可能限制进一步的运动改善。这些发现表明，增强对人体穿戴式机器人的感觉，并频繁校准对身体形象的感知，对于有效训练下肢穿戴式机器人和开发更多具身辅助技术至关重要。', 'title_zh': '投影新身体：穿戴式机器人学习行走过程中身体形象的变化'}
{'arxiv_id': 'arXiv:2507.21338', 'title': 'Autonomous Exploration with Terrestrial-Aerial Bimodal Vehicles', 'authors': 'Yuman Gao, Ruibin Zhang, Tiancheng Lai, Yanjun Cao, Chao Xu, Fei Gao', 'link': 'https://arxiv.org/abs/2507.21338', 'abstract': 'Terrestrial-aerial bimodal vehicles, which integrate the high mobility of aerial robots with the long endurance of ground robots, offer significant potential for autonomous exploration. Given the inherent energy and time constraints in practical exploration tasks, we present a hierarchical framework for the bimodal vehicle to utilize its flexible locomotion modalities for exploration. Beginning with extracting environmental information to identify informative regions, we generate a set of potential bimodal viewpoints. To adaptively manage energy and time constraints, we introduce an extended Monte Carlo Tree Search approach that strategically optimizes both modality selection and viewpoint sequencing. Combined with an improved bimodal vehicle motion planner, we present a complete bimodal energy- and time-aware exploration system. Extensive simulations and deployment on a customized real-world platform demonstrate the effectiveness of our system.', 'abstract_zh': '集成空中和地面模态的双模移动平台通过结合空中机器人的高移动性和地面机器人的长续航能力，为自主探索提供了巨大的潜力。鉴于实际探索任务中固有的能量和时间限制，我们提出了一种层次框架，以利用双模平台的灵活移动模态进行探索。该框架始于提取环境信息以识别信息丰富的区域，并生成一组潜在的双模视点。为适应性管理能量和时间约束，我们引入了一种扩展的蒙特卡洛树搜索方法，战略性地优化模态选择和视点序列。结合改进的双模平台运动规划器，我们提出了一种完整的双模能量和时间感知探索系统。广泛的仿真实验和在定制的实际平台上的部署证明了该系统的有效性。', 'title_zh': '地面-航空双模车辆自主探索'}
{'arxiv_id': 'arXiv:2507.21259', 'title': 'NMPCM: Nonlinear Model Predictive Control on Resource-Constrained Microcontrollers', 'authors': 'Van Chung Nguyen, Pratik Walunj, Chuong Le, An Duy Nguyen, Hung Manh La', 'link': 'https://arxiv.org/abs/2507.21259', 'abstract': 'Nonlinear Model Predictive Control (NMPC) is a powerful approach for controlling highly dynamic robotic systems, as it accounts for system dynamics and optimizes control inputs at each step. However, its high computational complexity makes implementation on resource-constrained microcontrollers impractical. While recent studies have demonstrated the feasibility of Model Predictive Control (MPC) with linearized dynamics on microcontrollers, applying full NMPC remains a significant challenge. This work presents an efficient solution for generating and deploying NMPC on microcontrollers (NMPCM) to control quadrotor UAVs. The proposed method optimizes computational efficiency while maintaining high control accuracy. Simulations in Gazebo/ROS and real-world experiments validate the effectiveness of the approach, demonstrating its capability to achieve high-frequency NMPC execution in real-time systems. The code is available at: this https URL.', 'abstract_zh': '基于非线性模型预测控制的微控制器实现方法：用于四旋翼无人机的实时控制', 'title_zh': 'NMPCM: 面向资源受限微控制器的非线性模型预测控制'}
{'arxiv_id': 'arXiv:2507.21245', 'title': 'Diffusion Denoiser-Aided Gyrocompassing', 'authors': 'Gershy Ben-Arie, Daniel Engelsman, Rotem Dror, Itzik Klein', 'link': 'https://arxiv.org/abs/2507.21245', 'abstract': 'An accurate initial heading angle is essential for efficient and safe navigation across diverse domains. Unlike magnetometers, gyroscopes can provide accurate heading reference independent of the magnetic disturbances in a process known as gyrocompassing. Yet, accurate and timely gyrocompassing, using low-cost gyroscopes, remains a significant challenge in scenarios where external navigation aids are unavailable. Such challenges are commonly addressed in real-world applications such as autonomous vehicles, where size, weight, and power limitations restrict sensor quality, and noisy measurements severely degrade gyrocompassing performance. To cope with this challenge, we propose a novel diffusion denoiser-aided gyrocompass approach. It integrates a diffusion-based denoising framework with an enhanced learning-based heading estimation model. The diffusion denoiser processes raw inertial sensor signals before input to the deep learning model, resulting in accurate gyrocompassing. Experiments using both simulated and real sensor data demonstrate that our proposed approach improves gyrocompassing accuracy by 26% compared to model-based gyrocompassing and by 15% compared to other learning-driven approaches. This advancement holds particular significance for ensuring accurate and robust navigation in autonomous platforms that incorporate low-cost gyroscopes within their navigation systems.', 'abstract_zh': '一种新型扩散去噪辅助的陀螺罗经方法对于跨不同领域的高效和安全导航至关重要', 'title_zh': '扩散去噪辅助速率陀螺仪定向'}
{'arxiv_id': 'arXiv:2507.21225', 'title': 'Fluidically Innervated Lattices Make Versatile and Durable Tactile Sensors', 'authors': 'Annan Zhang, Miguel Flores-Acton, Andy Yu, Anshul Gupta, Maggie Yao, Daniela Rus', 'link': 'https://arxiv.org/abs/2507.21225', 'abstract': "Tactile sensing plays a fundamental role in enabling robots to navigate dynamic and unstructured environments, particularly in applications such as delicate object manipulation, surface exploration, and human-robot interaction. In this paper, we introduce a passive soft robotic fingertip with integrated tactile sensing, fabricated using a 3D-printed elastomer lattice with embedded air channels. This sensorization approach, termed fluidic innervation, transforms the lattice into a tactile sensor by detecting pressure changes within sealed air channels, providing a simple yet robust solution to tactile sensing in robotics. Unlike conventional methods that rely on complex materials or designs, fluidic innervation offers a simple, scalable, single-material fabrication process. We characterize the sensors' response, develop a geometric model to estimate tip displacement, and train a neural network to accurately predict contact location and contact force. Additionally, we integrate the fingertip with an admittance controller to emulate spring-like behavior, demonstrate its capability for environment exploration through tactile feedback, and validate its durability under high impact and cyclic loading conditions. This tactile sensing technique offers advantages in terms of simplicity, adaptability, and durability and opens up new opportunities for versatile robotic manipulation.", 'abstract_zh': '触觉感知在使机器人能够导航动态和非结构化环境中的作用，特别是在精细物体操作、表面探索和人机交互等应用中至关重要。本文介绍了一种集成触觉感知的被动软体机器人指尖，采用具有嵌入式气道的3D打印弹性体格子制造。这种感知方法称为流体增殖，通过检测密封气道内的压力变化将格子转变为触觉传感器，提供了一种简单而 robust 的机器人触觉感知解决方案。与依赖于复杂材料或设计的常规方法不同，流体增殖提供了简单、可扩展、单材料的制造过程。我们表征了传感器的响应，建立了几何模型以估计指尖位移，并训练神经网络以准确预测接触位置和接触力。此外，我们将指尖与阻抗控制器集成，以模拟弹簧行为，通过触觉反馈展示其环境探索能力，并验证其在高冲击和循环加载条件下的耐久性。这种触觉感知技术在简单性、适应性和耐用性方面具有优势，并为多功能机器人操作开启了新的可能性。', 'title_zh': '流体神经传导网络制成的多功能和耐用的触觉传感器'}
{'arxiv_id': 'arXiv:2507.22028', 'title': 'From Seeing to Experiencing: Scaling Navigation Foundation Models with Reinforcement Learning', 'authors': 'Honglin He, Yukai Ma, Wayne Wu, Bolei Zhou', 'link': 'https://arxiv.org/abs/2507.22028', 'abstract': "Navigation foundation models trained on massive webscale data enable agents to generalize across diverse environments and embodiments. However, these models trained solely on offline data, often lack the capacity to reason about the consequences of their actions or adapt through counterfactual understanding. They thus face significant limitations in the real-world urban navigation where interactive and safe behaviors, such as avoiding obstacles and moving pedestrians, are critical. To tackle these challenges, we introduce the Seeing-to-Experiencing framework to scale the capability of navigation foundation models with reinforcement learning. S2E combines the strengths of pre-training on videos and post-training through RL. It maintains the generalizability acquired from large-scale real-world videos while enhancing its interactivity through RL in simulation environments. Specifically, we introduce two innovations: an Anchor-Guided Distribution Matching strategy, which stabilizes learning and models diverse motion patterns through anchor-based supervision; and a Residual-Attention Module, which obtains reactive behaviors from simulation environments without erasing the model's pretrained knowledge. Moreover, we establish a comprehensive end-to-end evaluation benchmark, NavBench-GS, built on photorealistic 3DGS reconstructions of real-world scenes that incorporate physical interactions. It can systematically assess the generalizability and safety of navigation foundation models. Extensive experiments show that S2E mitigates the diminishing returns often seen when scaling with offline data alone. We perform a thorough analysis of the benefits of Reinforcement Learning compared to Supervised Fine-Tuning in the context of post-training for robot learning. Our findings emphasize the crucial role of integrating interactive online experiences to effectively scale foundation models in Robotics.", 'abstract_zh': '大规模网络数据训练的导航基础模型能够使代理在多种环境和体态中泛化。然而，这些仅基于离线数据训练的模型往往缺乏推理其行为后果或通过反事实理解进行适应的能力。因此，在需要交互性和安全性的实际城市导航场景中，它们面临着重大限制。为应对这些挑战，我们引入了Seeing-to-Experiencing (S2E)框架，利用强化学习扩大导航基础模型的能力。S2E结合了视频预训练和通过模拟环境中的强化学习后训练的优点，维持了从大规模真实世界视频中获得的泛化能力，同时通过强化学习增强了其交互性。特别是，我们提出了两种创新：基于锚点的分布匹配策略，通过基于锚点的监督稳定学习并建模多样化的运动模式；以及残差注意力模块，从模拟环境中获取反应性行为而不抹去模型的预训练知识。此外，我们建立了一个全面的端到端评估基准NavBench-GS，基于真实场景的物理交互的逼真3D重建。它可以系统地评估导航基础模型的泛化能力和安全性。大量实验表明，S2E克服了仅通过离线数据扩展时通常出现的收益递减现象。我们详细分析了在机器人学习后训练情境下，强化学习相较于监督微调的优势。研究发现强调了在机器人学中整合交互式在线体验对有效扩展基础模型的至关重要性。', 'title_zh': '从观察到体验：通过强化学习扩展导航基础模型'}
{'arxiv_id': 'arXiv:2507.21638', 'title': 'Assistax: A Hardware-Accelerated Reinforcement Learning Benchmark for Assistive Robotics', 'authors': 'Leonard Hinckeldey, Elliot Fosong, Elle Miller, Rimvydas Rubavicius, Trevor McInroe, Patricia Wollstadt, Christiane B. Wiebel-Herboth, Subramanian Ramamoorthy, Stefano V. Albrecht', 'link': 'https://arxiv.org/abs/2507.21638', 'abstract': "The development of reinforcement learning (RL) algorithms has been largely driven by ambitious challenge tasks and benchmarks. Games have dominated RL benchmarks because they present relevant challenges, are inexpensive to run and easy to understand. While games such as Go and Atari have led to many breakthroughs, they often do not directly translate to real-world embodied applications. In recognising the need to diversify RL benchmarks and addressing complexities that arise in embodied interaction scenarios, we introduce Assistax: an open-source benchmark designed to address challenges arising in assistive robotics tasks. Assistax uses JAX's hardware acceleration for significant speed-ups for learning in physics-based simulations. In terms of open-loop wall-clock time, Assistax runs up to $370\\times$ faster when vectorising training runs compared to CPU-based alternatives. Assistax conceptualises the interaction between an assistive robot and an active human patient using multi-agent RL to train a population of diverse partner agents against which an embodied robotic agent's zero-shot coordination capabilities can be tested. Extensive evaluation and hyperparameter tuning for popular continuous control RL and MARL algorithms provide reliable baselines and establish Assistax as a practical benchmark for advancing RL research for assistive robotics. The code is available at: this https URL.", 'abstract_zh': '强化学习算法的发展很大程度上受到宏伟挑战任务和基准的驱动。由于游戏能够呈现相关挑战、运行成本低廉且易于理解，因此在RL基准测试中占据主导地位。尽管如围棋和街机游戏等游戏取得了许多突破，但它们往往不能直接应用于实际场景中的实体交互。为响应多样化RL基准测试的需求，并解决实体交互场景中出现的复杂性，我们引入了Assistax：一个开源基准，旨在解决辅助机器人任务中出现的挑战。Assistax利用JAX的硬件加速技术以显著提升基于物理模拟的学习速度。在串行化训练运行情况下，Assistax相比基于CPU的替代方案可快至370倍。Assistax通过多Agent RL的概念化，设想了辅助机器人与主动患者的交互，并训练了一个多样化的合作伙伴Agent群体，以测试实体机器人Agent的零样本协调能力。对于流行的连续控制RL和多Agent RL算法进行广泛的评估和超参数调优，提供了可靠的基线，并将Assistax确立为促进辅助机器人领域RL研究的实用基准。代码可在以下链接获取：this https URL。', 'title_zh': '助手指南：一种加速强化学习辅助机器人基准测试'}
{'arxiv_id': 'arXiv:2507.21547', 'title': 'Decentralized Modeling of Vehicular Maneuvers and Interactions at Urban Junctions', 'authors': 'Saeed Rahmani, Simeon C. Calvert, Bart van Arem', 'link': 'https://arxiv.org/abs/2507.21547', 'abstract': "Modeling and evaluation of automated vehicles (AVs) in mixed-autonomy traffic is essential prior to their safe and efficient deployment. This is especially important at urban junctions where complex multi-agent interactions occur. Current approaches for modeling vehicular maneuvers and interactions at urban junctions have limitations in formulating non-cooperative interactions and vehicle dynamics within a unified mathematical framework. Previous studies either assume predefined paths or rely on cooperation and central controllability, limiting their realism and applicability in mixed-autonomy traffic. This paper addresses these limitations by proposing a modeling framework for trajectory planning and decentralized vehicular control at urban junctions. The framework employs a bi-level structure where the upper level generates kinematically feasible reference trajectories using an efficient graph search algorithm with a custom heuristic function, while the lower level employs a predictive controller for trajectory tracking and optimization. Unlike existing approaches, our framework does not require central controllability or knowledge sharing among vehicles. The vehicle kinematics are explicitly incorporated at both levels, and acceleration and steering angle are used as control variables. This intuitive formulation facilitates analysis of traffic efficiency, environmental impacts, and motion comfort. The framework's decentralized structure accommodates operational and stochastic elements, such as vehicles' detection range, perception uncertainties, and reaction delay, making the model suitable for safety analysis. Numerical and simulation experiments across diverse scenarios demonstrate the framework's capability in modeling accurate and realistic vehicular maneuvers and interactions at various urban junctions, including unsignalized intersections and roundabouts.", 'abstract_zh': '自动化车辆在混合自主交通中的建模与评估对于其安全高效部署至关重要。特别是在城市交叉路口，复杂的多代理交互尤为重要。现有针对城市交叉路口车辆 maneuvers 和交互的建模方法在统一数学框架下表述非合作交互和车辆动力学存在局限性。先前研究要么假设预定义路径，要么依赖合作和中心控制，限制了其在混合自主交通中的真实性和适用性。本文通过提出一种城市交叉路口路径规划和分散式车辆控制的建模框架来解决这些局限性。该框架采用双层结构，上层使用高效的图搜索算法结合自定义启发式函数生成动力学可行的参考轨迹，下层采用预测控制器进行轨迹跟踪和优化。与现有方法不同，我们的框架无需中心控制或车辆之间知识共享。在一、二层均明确考虑了车辆动力学，并将加速度和转向角作为控制变量。这种直观的表述形式便于分析交通效率、环境影响和运动舒适性。框架的分散结构能够容纳操作和随机因素，如车辆的检测范围、感知不确定性及反应延迟，使模型适用于安全性分析。跨不同场景的数值和仿真实验展示了该框架在城市交叉路口（包括无信号交叉口和环岛）中建模准确且具真实性的车辆 maneuvers 和交互的能力。', 'title_zh': '城市交叉口车辆机动与相互作用的去中心化建模'}
{'arxiv_id': 'arXiv:2507.21452', 'title': 'Retrieve-Augmented Generation for Speeding up Diffusion Policy without Additional Training', 'authors': 'Sodtavilan Odonchimed, Tatsuya Matsushima, Simon Holk, Yusuke Iwasawa, Yutaka Matsuo', 'link': 'https://arxiv.org/abs/2507.21452', 'abstract': 'Diffusion Policies (DPs) have attracted attention for their ability to achieve significant accuracy improvements in various imitation learning tasks. However, DPs depend on Diffusion Models, which require multiple noise removal steps to generate a single action, resulting in long generation times. To solve this problem, knowledge distillation-based methods such as Consistency Policy (CP) have been proposed. However, these methods require a significant amount of training time, especially for difficult tasks. In this study, we propose RAGDP (Retrieve-Augmented Generation for Diffusion Policies) as a novel framework that eliminates the need for additional training using a knowledge base to expedite the inference of pre-trained DPs. In concrete, RAGDP encodes observation-action pairs through the DP encoder to construct a vector database of expert demonstrations. During inference, the current observation is embedded, and the most similar expert action is extracted. This extracted action is combined with an intermediate noise removal step to reduce the number of steps required compared to the original diffusion step. We show that by using RAGDP with the base model and existing acceleration methods, we improve the accuracy and speed trade-off with no additional training. Even when accelerating the models 20 times, RAGDP maintains an advantage in accuracy, with a 7% increase over distillation models such as CP.', 'abstract_zh': '基于检索增强生成的扩散策略（RAGDP）：消除额外训练以加快预训练策略的推理速度', 'title_zh': '无需额外训练的检索增强生成方法以加快扩散策略的速度'}
{'arxiv_id': 'arXiv:2507.21450', 'title': 'Recursive Visual Imagination and Adaptive Linguistic Grounding for Vision Language Navigation', 'authors': 'Bolei Chen, Jiaxu Kang, Yifei Wang, Ping Zhong, Qi Wu, Jianxin Wang', 'link': 'https://arxiv.org/abs/2507.21450', 'abstract': 'Vision Language Navigation (VLN) typically requires agents to navigate to specified objects or remote regions in unknown scenes by obeying linguistic commands. Such tasks require organizing historical visual observations for linguistic grounding, which is critical for long-sequence navigational decisions. However, current agents suffer from overly detailed scene representation and ambiguous vision-language alignment, which weaken their comprehension of navigation-friendly high-level scene priors and easily lead to behaviors that violate linguistic commands. To tackle these issues, we propose a navigation policy by recursively summarizing along-the-way visual perceptions, which are adaptively aligned with commands to enhance linguistic grounding. In particular, by structurally modeling historical trajectories as compact neural grids, several Recursive Visual Imagination (RVI) techniques are proposed to motivate agents to focus on the regularity of visual transitions and semantic scene layouts, instead of dealing with misleading geometric details. Then, an Adaptive Linguistic Grounding (ALG) technique is proposed to align the learned situational memories with different linguistic components purposefully. Such fine-grained semantic matching facilitates the accurate anticipation of navigation actions and progress. Our navigation policy outperforms the state-of-the-art methods on the challenging VLN-CE and ObjectNav tasks, showing the superiority of our RVI and ALG techniques for VLN.', 'abstract_zh': '视觉语言导航（VLN）通常要求代理遵循语言指令，在未知场景中导航至指定物体或远程区域。此类任务需要组织历史视觉观察以实现语言接地，这对于长序列导航决策至关重要。然而，当前代理存在场景表示过于详细和视觉-语言对齐含糊的问题，这削弱了它们对导航友好的高级场景先验的理解，并容易导致违反语言指令的行为。为解决这些问题，我们提出了一种通过递归总结沿途视觉感知的导航策略，这些感知会自适应地与指令对齐以增强语言接地。特别地，通过结构化建模历史轨迹为紧凑的神经网格，我们提出了几种递归视觉想象（RVI）技术，促使代理关注视觉过渡的规律性和语义场景布局，而非处理误导性的几何细节。然后，我们提出了一种自适应语言接地（ALG）技术，旨在有目的地将学习到的场景记忆与不同的语言组件对齐。这种精细的语义匹配促进了对导航动作和进展的准确预测。我们的导航策略在具有挑战性的VLN-CE和ObjectNav任务中优于现有方法，展示了我们RVI和ALG技术在VLN中的优越性。', 'title_zh': '递归视觉想象与自适应语言接地在视觉语言导航中的应用'}
{'arxiv_id': 'arXiv:2507.21423', 'title': 'MapDiffusion: Generative Diffusion for Vectorized Online HD Map Construction and Uncertainty Estimation in Autonomous Driving', 'authors': 'Thomas Monninger, Zihan Zhang, Zhipeng Mo, Md Zafar Anwar, Steffen Staab, Sihao Ding', 'link': 'https://arxiv.org/abs/2507.21423', 'abstract': "Autonomous driving requires an understanding of the static environment from sensor data. Learned Bird's-Eye View (BEV) encoders are commonly used to fuse multiple inputs, and a vector decoder predicts a vectorized map representation from the latent BEV grid. However, traditional map construction models provide deterministic point estimates, failing to capture uncertainty and the inherent ambiguities of real-world environments, such as occlusions and missing lane markings. We propose MapDiffusion, a novel generative approach that leverages the diffusion paradigm to learn the full distribution of possible vectorized maps. Instead of predicting a single deterministic output from learned queries, MapDiffusion iteratively refines randomly initialized queries, conditioned on a BEV latent grid, to generate multiple plausible map samples. This allows aggregating samples to improve prediction accuracy and deriving uncertainty estimates that directly correlate with scene ambiguity. Extensive experiments on the nuScenes dataset demonstrate that MapDiffusion achieves state-of-the-art performance in online map construction, surpassing the baseline by 5% in single-sample performance. We further show that aggregating multiple samples consistently improves performance along the ROC curve, validating the benefit of distribution modeling. Additionally, our uncertainty estimates are significantly higher in occluded areas, reinforcing their value in identifying regions with ambiguous sensor input. By modeling the full map distribution, MapDiffusion enhances the robustness and reliability of online vectorized HD map construction, enabling uncertainty-aware decision-making for autonomous vehicles in complex environments.", 'abstract_zh': '自主驾驶需要从传感器数据理解静态环境。我们提出MapDiffusion，一种新颖的生成方法，利用扩散范式学习可能的向量地图的完整分布。MapDiffusion 通过在BEV潜网格上条件化，迭代细化随机初始化的查询，而不是从学习查询中预测单一确定性输出，生成多个可能的地图样本。这允许聚合样本以提高预测准确性，并获得直接与场景不确定性相关联的不确定性估计。在nuScenes数据集上的 extensive 实验表明，MapDiffusion 在在线地图构建中的性能达到最新水平，单样本性能超越基线 5%。进一步研究表明，沿ROC曲线聚合多个样本的一致性改进性能，验证了分布建模的益处。此外，我们的不确定性估计在遮挡区域显著更高，强化了其在识别具有模糊传感器输入的区域方面的价值。通过建模完整地图分布，MapDiffusion 提高了在线向量化高清地图构建的鲁棒性和可靠性，使自主车辆在复杂环境中能够进行不确定性感知决策。', 'title_zh': 'MapDiffusion: 生成扩散在自动驾驶中面向向量化的在线高精度地图构建及其不确定性估计中的应用'}
{'arxiv_id': 'arXiv:2507.21072', 'title': 'Snap, Segment, Deploy: A Visual Data and Detection Pipeline for Wearable Industrial Assistants', 'authors': 'Di Wen, Junwei Zheng, Ruiping Liu, Yi Xu, Kunyu Peng, Rainer Stiefelhagen', 'link': 'https://arxiv.org/abs/2507.21072', 'abstract': 'Industrial assembly tasks increasingly demand rapid adaptation to complex procedures and varied components, yet are often conducted in environments with limited computing, connectivity, and strict privacy requirements. These constraints make conventional cloud-based or fully autonomous solutions impractical for factory deployment. This paper introduces a mobile-device-based assistant system for industrial training and operational support, enabling real-time, semi-hands-free interaction through on-device perception and voice interfaces. The system integrates lightweight object detection, speech recognition, and Retrieval-Augmented Generation (RAG) into a modular on-device pipeline that operates entirely on-device, enabling intuitive support for part handling and procedure understanding without relying on manual supervision or cloud services. To enable scalable training, we adopt an automated data construction pipeline and introduce a two-stage refinement strategy to improve visual robustness under domain shift. Experiments on our generated dataset, i.e., Gear8, demonstrate improved robustness to domain shift and common visual corruptions. A structured user study further confirms its practical viability, with positive user feedback on the clarity of the guidance and the quality of the interaction. These results indicate that our framework offers a deployable solution for real-time, privacy-preserving smart assistance in industrial environments. We will release the Gear8 dataset and source code upon acceptance.', 'abstract_zh': '基于移动设备的工业培训与操作支持助手系统：面向现实环境的实时半自助交互', 'title_zh': '快照、分割、部署：可穿戴工业助手的视觉数据和检测管道'}
{'arxiv_id': 'arXiv:2507.21065', 'title': 'Dialogic Social Learning for Artificial Agents: Enhancing LLM Ontology Acquisition through Mixed-Initiative Educational Interactions', 'authors': 'Sabrina Patania, Luca Annese, Cansu Koyuturk, Azzurra Ruggeri, Dimitri Ognibene', 'link': 'https://arxiv.org/abs/2507.21065', 'abstract': "Large Language Models (LLMs) have demonstrated remarkable capabilities in processing extensive offline datasets. However, they often face challenges in acquiring and integrating complex, knowledge online. Traditional AI training paradigms, predominantly based on supervised learning or reinforcement learning, mirror a 'Piagetian' model of independent exploration. These approaches typically rely on large datasets and sparse feedback signals, limiting the models' ability to learn efficiently from interactions. Drawing inspiration from Vygotsky's sociocultural theory, this study explores the potential of socially mediated learning paradigms to address these limitations.\nWe introduce a dynamic environment, termed the 'AI Social Gym', where an AI learner agent engages in dyadic pedagogical dialogues with knowledgeable AI teacher agents. These interactions emphasize external, structured dialogue as a core mechanism for knowledge acquisition, contrasting with methods that depend solely on internal inference or pattern recognition.\nOur investigation focuses on how different pedagogical strategies impact the AI learning process in the context of ontology acquisition. Empirical results indicate that such dialogic approaches-particularly those involving mixed-direction interactions combining top-down explanations with learner-initiated questioning-significantly enhance the LLM's ability to acquire and apply new knowledge, outperforming both unidirectional instructional methods and direct access to structured knowledge, formats typically present in training datasets.\nThese findings suggest that integrating pedagogical and psychological insights into AI and robot training can substantially improve post-training knowledge acquisition and response quality. This approach offers a complementary pathway to existing strategies like prompt engineering", 'abstract_zh': '大型语言模型（LLMs）在处理大量离线数据集方面展现出了杰出的能力。然而，它们经常面临从复杂在线知识中获取并整合信息的挑战。传统的AI训练范式主要基于监督学习或强化学习，类似于皮亚杰的独立探索模型。这些方法通常依赖大型数据集和稀疏的反馈信号，限制了模型从交互中高效学习的能力。受到维果茨基的社会文化理论的启发，本研究探讨了社会介导学习范式在解决这些限制方面的潜在可能性。\n\n在这样的背景下，我们引入了一个动态环境，称为“AI社会健身房”，其中AI学习者代理与知识丰富的AI教师代理进行双向教学对话。这些互动强调外部结构化对话作为知识获取的核心机制，不同于仅依赖内部推理或模式识别的方法。\n\n我们的研究集中于不同的教学策略如何影响AI学习过程中的本体知识获取。实验证据表明，特别是结合自上而下解释与学习者主动提问的双向互动策略，显著增强了LLM从新知识中获取和应用的能力，超越了单向指导方法和直接访问结构化知识的现有方式，通常存在于训练数据集中。\n\n这些发现表明，在AI和机器人训练中整合教学和心理学的见解可以显著提高培训后知识获取和响应质量。这一方法为现有的策略，如提示工程，提供了互补途径。', 'title_zh': '人工代理的对话式社会学习：通过混合倡议教育交互增强大语言模型本体获取'}
