{'arxiv_id': 'arXiv:2507.23719', 'title': 'Design of a bioinspired robophysical antenna for insect-scale tactile perception and navigation', 'authors': 'Parker McDonnell, Lingsheng Meng, Hari Krishna Hariprasad, Alexander Hedrick, Eduardo Miscles, Samuel Gilinsky, Jean-Michel Mongeau, Kaushik Jayaram', 'link': 'https://arxiv.org/abs/2507.23719', 'abstract': "The American cockroach (Periplaneta americana) uses its soft antennae to guide decision making by extracting rich tactile information from tens of thousands of distributed mechanosensors. Although tactile sensors enable robust, autonomous perception and navigation in natural systems, replicating these capabilities in insect-scale robots remains challenging due to stringent size, weight, and power constraints that limit existing sensor technologies. To overcome these limitations, we introduce CITRAS (Cockroach Inspired Tactile Robotic Antenna Sensor), a bioinspired, multi-segmented, compliant laminate sensor with embedded capacitive angle sensors. CITRAS is compact (73.7x15.6x2.1 mm), lightweight (491 mg), and low-power (32 mW), enabling seamless integration with miniature robotic platforms. The segmented compliant structure passively bends in response to environmental stimuli, achieving accurate hinge angle measurements with maximum errors of just 0.79 degree (quasistatic bending) and 3.58 degree (dynamic bending). Experimental evaluations demonstrate CITRAS' multifunctional tactile perception capabilities: predicting base-to-tip distances with 7.75 % error, estimating environmental gap widths with 6.73 % error, and distinguishing surface textures through differential sensor response. The future integration of this bioinspired tactile antenna in insect-scale robots addresses critical sensing gaps, promising enhanced autonomous exploration, obstacle avoidance, and environmental mapping in complex, confined environments.", 'abstract_zh': '美国谷仓蟑螂（Periplaneta americana）利用其柔软的触须通过数十万个分散的机械传感器提取丰富的触觉信息来进行决策指导。尽管触觉传感器在自然系统中能够实现稳健的自主感知和导航，但由于严格的尺寸、重量和功率限制限制了现有传感器技术的发展，因此在昆虫规模的机器人上复制这些能力仍然具有挑战性。为克服这些限制，我们引入了CITRAS（蟑螂启发触觉机器人触须传感器），这是一种基于生物学的、多节段的顺应性层压传感器，内置电容角度传感器。CITRAS紧凑（73.7x15.6x2.1 mm）、轻便（491 mg）且低功耗（32 mW），使其能够无缝集成到微型机器人平台中。其分段顺应性结构能够被动地响应环境刺激弯曲，实现准确的铰链角度测量，最大误差仅为0.79度（准静态弯曲）和3.58度（动态弯曲）。实验评估展示了CITRAS的多功能触觉感知能力：预测基端到尖端的距离误差为7.75%，估计环境间隙宽度误差为6.73%，并通过不同传感器响应区分表面纹理。将这种基于生物学的触觉触须未来集成到昆虫规模的机器人中，有望填补关键的传感空白，增强复杂受限环境中的自主探索、障碍物回避和环境制图能力。', 'title_zh': '仿生物触觉感知与导航的昆虫尺度 robophysical 天线设计'}
{'arxiv_id': 'arXiv:2507.23629', 'title': 'DRACo-SLAM2: Distributed Robust Acoustic Communication-efficient SLAM for Imaging Sonar EquippedUnderwater Robot Teams with Object Graph Matching', 'authors': 'Yewei Huang, John McConnell, Xi Lin, Brendan Englot', 'link': 'https://arxiv.org/abs/2507.23629', 'abstract': 'We present DRACo-SLAM2, a distributed SLAM framework for underwater robot teams equipped with multibeam imaging sonar. This framework improves upon the original DRACo-SLAM by introducing a novel representation of sonar maps as object graphs and utilizing object graph matching to achieve time-efficient inter-robot loop closure detection without relying on prior geometric information. To better-accommodate the needs and characteristics of underwater scan matching, we propose incremental Group-wise Consistent Measurement Set Maximization (GCM), a modification of Pairwise Consistent Measurement Set Maximization (PCM), which effectively handles scenarios where nearby inter-robot loop closures share similar registration errors. The proposed approach is validated through extensive comparative analyses on simulated and real-world datasets.', 'abstract_zh': 'DRACo-SLAM2：一种基于多波束成像声纳的水下机器人团队分布式SLAM框架', 'title_zh': 'DRACo-SLAM2：搭载成像声纳的水下机器人团队分布式健壮声学通信高效SLAM，基于物体图匹配'}
{'arxiv_id': 'arXiv:2507.23592', 'title': 'Human-Exoskeleton Kinematic Calibration to Improve Hand Tracking for Dexterous Teleoperation', 'authors': 'Haiyun Zhang, Stefano Dalla Gasperina, Saad N. Yousaf, Toshimitsu Tsuboi, Tetsuya Narita, Ashish D. Deshpande', 'link': 'https://arxiv.org/abs/2507.23592', 'abstract': 'Hand exoskeletons are critical tools for dexterous teleoperation and immersive manipulation interfaces, but achieving accurate hand tracking remains a challenge due to user-specific anatomical variability and donning inconsistencies. These issues lead to kinematic misalignments that degrade tracking performance and limit applicability in precision tasks. We propose a subject-specific calibration framework for exoskeleton-based hand tracking that uses redundant joint sensing and a residual-weighted optimization strategy to estimate virtual link parameters. Implemented on the Maestro exoskeleton, our method improves joint angle and fingertip position estimation across users with varying hand geometries. We introduce a data-driven approach to empirically tune cost function weights using motion capture ground truth, enabling more accurate and consistent calibration across participants. Quantitative results from seven subjects show substantial reductions in joint and fingertip tracking errors compared to uncalibrated and evenly weighted models. Qualitative visualizations using a Unity-based virtual hand further confirm improvements in motion fidelity. The proposed framework generalizes across exoskeleton designs with closed-loop kinematics and minimal sensing, and lays the foundation for high-fidelity teleoperation and learning-from-demonstration applications.', 'abstract_zh': '基于外骨骼的主体特定手部跟踪校准框架：利用冗余关节感应和残差加权优化策略实现跨用户的手部几何精确跟踪', 'title_zh': '人体-外骨骼运动学校准以改善灵巧远程操作中的手部跟踪'}
{'arxiv_id': 'arXiv:2507.23350', 'title': 'Multi-Waypoint Path Planning and Motion Control for Non-holonomic Mobile Robots in Agricultural Applications', 'authors': 'Mahmoud Ghorab, Matthias Lorenzen', 'link': 'https://arxiv.org/abs/2507.23350', 'abstract': "There is a growing demand for autonomous mobile robots capable of navigating unstructured agricultural environments. Tasks such as weed control in meadows require efficient path planning through an unordered set of coordinates while minimizing travel distance and adhering to curvature constraints to prevent soil damage and protect vegetation. This paper presents an integrated navigation framework combining a global path planner based on the Dubins Traveling Salesman Problem (DTSP) with a Nonlinear Model Predictive Control (NMPC) strategy for local path planning and control. The DTSP generates a minimum-length, curvature-constrained path that efficiently visits all targets, while the NMPC leverages this path to compute control signals to accurately reach each waypoint. The system's performance was validated through comparative simulation analysis on real-world field datasets, demonstrating that the coupled DTSP-based planner produced smoother and shorter paths, with a reduction of about 16% in the provided scenario, compared to decoupled methods. Based thereon, the NMPC controller effectively steered the robot to the desired waypoints, while locally optimizing the trajectory and ensuring adherence to constraints. These findings demonstrate the potential of the proposed framework for efficient autonomous navigation in agricultural environments.", 'abstract_zh': '自主移动机器人在未结构化农业环境中的导航需求不断增加。草地杂草控制等任务需要有效地在无序坐标集合中规划路径，同时最小化行程距离并遵循曲率约束，以防止土壤损坏和保护植被。本文提出了一种结合基于Dubins巡回售货员问题（DTSP）的全局路径规划器和非线性模型预测控制（NMPC）策略的集成导航框架。DTSP生成一条既高效又满足曲率约束的最短路径，而NMPC利用这条路径计算控制信号，以准确到达每个航点。通过在实际田野数据集上进行比较仿真分析，验证了该系统性能，结果显示耦合的基于DTSP的规划器生成了更平滑和更短的路径，与分离方法相比，在给定场景中路径长度减少了约16%。基于此，NMPC控制器有效地引导机器人到达所需航点，同时局部优化轨迹并确保满足约束。这些发现证明了所提框架在农业环境中的高效自主导航潜力。', 'title_zh': '非完整移动机器人在农业应用中的多航点路径规划与运动控制'}
{'arxiv_id': 'arXiv:2507.23339', 'title': 'Learning to Drift with Individual Wheel Drive: Maneuvering Autonomous Vehicle at the Handling Limits', 'authors': 'Yihan Zhou, Yiwen Lu, Bo Yang, Jiayun Li, Yilin Mo', 'link': 'https://arxiv.org/abs/2507.23339', 'abstract': 'Drifting, characterized by controlled vehicle motion at high sideslip angles, is crucial for safely handling emergency scenarios at the friction limits. While recent reinforcement learning approaches show promise for drifting control, they struggle with the significant simulation-to-reality gap, as policies that perform well in simulation often fail when transferred to physical systems. In this paper, we present a reinforcement learning framework with GPU-accelerated parallel simulation and systematic domain randomization that effectively bridges the gap. The proposed approach is validated on both simulation and a custom-designed and open-sourced 1/10 scale Individual Wheel Drive (IWD) RC car platform featuring independent wheel speed control. Experiments across various scenarios from steady-state circular drifting to direction transitions and variable-curvature path following demonstrate that our approach achieves precise trajectory tracking while maintaining controlled sideslip angles throughout complex maneuvers in both simulated and real-world environments.', 'abstract_zh': '基于GPU加速并行仿真和系统领域随机化的强化学习框架： bridging the simulation-to-reality gap for drifting control', 'title_zh': '基于 individual wheel drive 的学习漂移方法：在操控极限下操控自动驾驶车辆'}
{'arxiv_id': 'arXiv:2507.23305', 'title': 'Whisker-based Active Tactile Perception for Contour Reconstruction', 'authors': 'Yixuan Dang, Qinyang Xu, Yu Zhang, Xiangtong Yao, Liding Zhang, Zhenshan Bing, Florian Roehrbein, Alois Knoll', 'link': 'https://arxiv.org/abs/2507.23305', 'abstract': 'Perception using whisker-inspired tactile sensors currently faces a major challenge: the lack of active control in robots based on direct contact information from the whisker. To accurately reconstruct object contours, it is crucial for the whisker sensor to continuously follow and maintain an appropriate relative touch pose on the surface. This is especially important for localization based on tip contact, which has a low tolerance for sharp surfaces and must avoid slipping into tangential contact. In this paper, we first construct a magnetically transduced whisker sensor featuring a compact and robust suspension system composed of three flexible spiral arms. We develop a method that leverages a characterized whisker deflection profile to directly extract the tip contact position using gradient descent, with a Bayesian filter applied to reduce fluctuations. We then propose an active motion control policy to maintain the optimal relative pose of the whisker sensor against the object surface. A B-Spline curve is employed to predict the local surface curvature and determine the sensor orientation. Results demonstrate that our algorithm can effectively track objects and reconstruct contours with sub-millimeter accuracy. Finally, we validate the method in simulations and real-world experiments where a robot arm drives the whisker sensor to follow the surfaces of three different objects.', 'abstract_zh': '基于触须启发的触觉传感器的感知技术目前面临着一个主要挑战：缺乏基于直接接触信息的机器人主动控制。为了准确重构物体轮廓，触须传感器需要持续跟随并维持与表面适当的相对触覺姿态。这对于基于尖端接触的定位尤为重要，因为其对尖锐表面的容忍度低，必须避免滑入切线接触。在此论文中，我们首先构建了一个磁性转化的触须传感器，该传感器具有由三个柔性螺旋臂组成的紧凑且坚固的悬挂系统。我们开发了一种方法，利用特征化的触须偏移轮廓直接通过梯度下降提取尖端接触位置，并应用贝叶斯滤波来减少波动。然后，我们提出了一种主动运动控制策略，以维持触须传感器相对于物体表面的最佳相对姿态。采用B-Spline曲线预测局部表面曲率并确定传感器方向。结果表明，我们的算法可以有效跟踪物体并以亚毫米级精度重构轮廓。最后，我们在模拟和真实世界实验中验证了该方法，其中机器人手臂驱动触须传感器跟随三个不同物体的表面。', 'title_zh': '基于胡须的主动触觉感知用于轮廓重构'}
{'arxiv_id': 'arXiv:2507.23270', 'title': 'Simulation-based planning of Motion Sequences for Automated Procedure Optimization in Multi-Robot Assembly Cells', 'authors': 'Loris Schneider, Marc Ungen, Elias Huber, Jan-Felix Klein', 'link': 'https://arxiv.org/abs/2507.23270', 'abstract': 'Reconfigurable multi-robot cells offer a promising approach to meet fluctuating assembly demands. However, the recurrent planning of their configurations introduces new challenges, particularly in generating optimized, coordinated multi-robot motion sequences that minimize the assembly duration. This work presents a simulation-based method for generating such optimized sequences. The approach separates assembly steps into task-related core operations and connecting traverse operations. While core operations are constrained and predetermined, traverse operations offer substantial optimization potential. Scheduling the core operations is formulated as an optimization problem, requiring feasible traverse operations to be integrated using a decomposition-based motion planning strategy. Several solution techniques are explored, including a sampling heuristic, tree-based search and gradient-free optimization. For motion planning, a decomposition method is proposed that identifies specific areas in the schedule, which can be solved independently with modified centralized path planning algorithms. The proposed method generates efficient and collision-free multi-robot assembly procedures that outperform a baseline relying on decentralized, robot-individual motion planning. Its effectiveness is demonstrated through simulation experiments.', 'abstract_zh': '可重构多机器人单元为应对波动的装配需求提供了有前景的方法。然而，其配置的反复规划引入了新的挑战，特别是在生成最小化装配时间的优化且协调的多机器人运动序列方面。本文提出了一种基于仿真的方法来生成这样的优化序列。该方法将装配步骤分离为核心任务相关的基本操作和连接的移动操作。虽然核心操作受到约束且预先确定，但移动操作具有显著的优化潜力。将核心操作的调度形式化为一个优化问题，并采用基于分解的运动规划策略整合可行的移动操作。探索了几种解算技术，包括采样启发式方法、基于树的搜索和无导数优化。对于运动规划，提出了一种分解方法，该方法识别出特定的时间段，这些时间段可以使用修改后的集中路径规划算法独立解决。所提出的方法生成了高效且无碰撞的多机器人装配程序，其性能优于依赖于分散式、单机器人运动规划的基本方法。其有效性通过仿真实验得以验证。', 'title_zh': '基于仿真的多机器人装配单元自动化工序优化运动序列规划'}
{'arxiv_id': 'arXiv:2507.23203', 'title': 'Quadratic Programming-Based Posture Manipulation and Thrust-vectoring for Agile Dynamic Walking on Narrow Pathways', 'authors': 'Chenghao Wang, Eric Sihite, Kaushik Venkatesh Krishnamurthy, Shreyansh Pitroda, Adarsh Salagame, Alireza Ramezani, Morteza Gharib', 'link': 'https://arxiv.org/abs/2507.23203', 'abstract': "There has been significant advancement in legged robot's agility where they can show impressive acrobatic maneuvers, such as parkour. These maneuvers rely heavily on posture manipulation. To expand the stability and locomotion plasticity, we use the multi-modal ability in our legged-aerial platform, the Husky Beta, to perform thruster-assisted walking. This robot has thrusters on each of its sagittal knee joints which can be used to stabilize its frontal dynamic as it walks. In this work, we perform a simulation study of quadruped narrow-path walking with Husky $\\beta$, where the robot will utilize its thrusters to stably walk on a narrow path. The controller is designed based on a centroidal dynamics model with thruster and foot ground contact forces as inputs. These inputs are regulated using a QP solver to be used in a model predictive control framework. In addition to narrow-path walking, we also perform a lateral push-recovery simulation to study how the thrusters can be used to stabilize the frontal dynamics.", 'abstract_zh': '腿部机器人在 agility 方面取得了显著进步，它们可以展现出令人印象深刻的特技动作，如parkour。这些动作依赖于姿态操控。为了扩大稳定性和运动灵活性，我们使用多模态能力在Husky Beta这一腿足-空机器人平台上进行助推步行。该机器人在每个冠状膝关节上装备了喷气装置，可以用来在其行走时稳定其前向动态。在本研究中，我们对Husky $\\beta$的细窄路径四足行走进行了仿真研究，其中机器人将利用其喷气装置在细窄路径上稳定行走。控制器基于质心动力学模型设计，输入包括喷气装置力和足部地面接触力。这些输入通过QP求解器调节，用于模型预测控制框架。除了细窄路径行走外，我们还进行了一侧推-恢复仿真，以研究喷气装置如何用于稳定前向动态。', 'title_zh': '基于二次规划的姿态操纵与推力向量控制以实现狭窄路径上的敏捷动态行走'}
{'arxiv_id': 'arXiv:2507.23045', 'title': 'A Certifably Correct Algorithm for Generalized Robot-World and Hand-Eye Calibration', 'authors': 'Emmett Wise, Pushyami Kaveti, Qilong Chen, Wenhao Wang, Hanumant Singh, Jonathan Kelly, David M. Rosen, Matthew Giamou', 'link': 'https://arxiv.org/abs/2507.23045', 'abstract': 'Automatic extrinsic sensor calibration is a fundamental problem for multi-sensor platforms. Reliable and general-purpose solutions should be computationally efficient, require few assumptions about the structure of the sensing environment, and demand little effort from human operators. Since the engineering effort required to obtain accurate calibration parameters increases with the number of sensors deployed, robotics researchers have pursued methods requiring few assumptions about the sensing environment and minimal effort from human operators. In this work, we introduce a fast and certifiably globally optimal algorithm for solving a generalized formulation of the $\\textit{robot-world and hand-eye calibration}$ (RWHEC) problem. The formulation of RWHEC presented is "generalized" in that it supports the simultaneous estimation of multiple sensor and target poses, and permits the use of monocular cameras that, alone, are unable to measure the scale of their environments. In addition to demonstrating our method\'s superior performance over existing solutions, we derive novel identifiability criteria and establish $\\textit{a priori}$ guarantees of global optimality for problem instances with bounded measurement errors. We also introduce a complementary Lie-algebraic local solver for RWHEC and compare its performance with our global method and prior art. Finally, we provide a free and open-source implementation of our algorithms and experiments.', 'abstract_zh': '自动外置传感器标定是多传感器平台的一个基础问题。可靠的通用解决方案应当具备计算效率高、对感知环境的结构假设少以及对人类操作者的努力要求低的特点。由于获得准确标定参数所需的技术努力随着部署传感器数量的增加而增加，机器人研究人员一直在寻找对感知环境假设少且对人类操作者要求低的方法。在本文中，我们引入了一种快速且可验证全局最优的算法，用于求解机器人世界与手眼标定（RWHEC）问题的广义形式。所提出的RWHEC格式是“广义”的，因为它支持多个传感器和目标姿态的同时估计，并允许使用单目摄像头，这些摄像头单独无法测量其环境的尺度。除了展示我们方法的优越性能外，我们还推导了新的可识别性标准，并为具有 bounded 测量误差的问题实例建立了先验全局最优性保证。我们还引入了用于RWHEC的补充李代数局部求解器，并将其性能与我们的全局方法和现有技术进行了比较。最后，我们提供了一种我们算法和实验的免费开源实现。', 'title_zh': '广义机器人-世界及手眼标定的可认证正确算法'}
{'arxiv_id': 'arXiv:2507.23015', 'title': 'Learning to Prune Branches in Modern Tree-Fruit Orchards', 'authors': 'Abhinav Jain, Cindy Grimm, Stefan Lee', 'link': 'https://arxiv.org/abs/2507.23015', 'abstract': 'Dormant tree pruning is labor-intensive but essential to maintaining modern highly-productive fruit orchards. In this work we present a closed-loop visuomotor controller for robotic pruning. The controller guides the cutter through a cluttered tree environment to reach a specified cut point and ensures the cutters are perpendicular to the branch. We train the controller using a novel orchard simulation that captures the geometric distribution of branches in a target apple orchard configuration. Unlike traditional methods requiring full 3D reconstruction, our controller uses just optical flow images from a wrist-mounted camera. We deploy our learned policy in simulation and the real-world for an example V-Trellis envy tree with zero-shot transfer, achieving a 30% success rate -- approximately half the performance of an oracle planner.', 'abstract_zh': '休眠树木修剪劳动密集但对维持现代高产 fruit 果园至关重要。本文提出了一种闭环视知觉运动控制器用于机器人修剪。该控制器引导剪刀通过杂乱的树环境以达到预定的剪切点，并确保剪刀与枝条垂直。我们使用一种新颖的果园仿真来训练控制器，该仿真捕捉目标苹果果园配置中的几何分支分布。与传统方法需要进行全3D重建不同，我们的控制器仅使用手腕摄像机的光学流图像。我们在仿真和实际环境中部署所学策略对一个 V-Trellis 庇护树进行修剪，实现30%的成功率——大约是Oracle计划性能的一半。', 'title_zh': '学习修剪现代果树orchards中的树枝'}
{'arxiv_id': 'arXiv:2507.23579', 'title': 'Impact of a Lower Limb Exosuit Anchor Points on Energetics and Biomechanics', 'authors': 'Chiara Lambranzi, Giulia Oberti, Christian Di Natali, Darwin G. Caldwell, Manuela Galli, Elena De Momi, Jesùs Ortiz', 'link': 'https://arxiv.org/abs/2507.23579', 'abstract': 'Anchor point placement is a crucial yet often overlooked aspect of exosuit design since it determines how forces interact with the human body. This work analyzes the impact of different anchor point positions on gait kinematics, muscular activation and energetic consumption. A total of six experiments were conducted with 11 subjects wearing the XoSoft exosuit, which assists hip flexion in five configurations. Subjects were instrumented with an IMU-based motion tracking system, EMG sensors, and a mask to measure metabolic consumption. The results show that positioning the knee anchor point on the posterior side while keeping the hip anchor on the anterior part can reduce muscle activation in the hip flexors by up to 10.21\\% and metabolic expenditure by up to 18.45\\%. Even if the only assisted joint was the hip, all the configurations introduced changes also in the knee and ankle kinematics. Overall, no single configuration was optimal across all subjects, suggesting that a personalized approach is necessary to transmit the assistance forces optimally. These findings emphasize that anchor point position does indeed have a significant impact on exoskeleton effectiveness and efficiency. However, these optimal positions are subject-specific to the exosuit design, and there is a strong need for future work to tailor musculoskeletal models to individual characteristics and validate these results in clinical populations.', 'abstract_zh': '不同锚点位置对下肢外骨骼设计中步态动力学、肌肉激活和能耗的影响研究', 'title_zh': '下肢外骨骼锚点位置对能耗和生物力学的影响'}
