{'arxiv_id': 'arXiv:2510.03169', 'title': 'Optimal Smooth Coverage Trajectory Planning for Quadrotors in Cluttered Environment', 'authors': 'Duanjiao Li, Yun Chen, Ying Zhang, Junwen Yao, Dongyue Huang, Jianguo Zhang, Ning Ding', 'link': 'https://arxiv.org/abs/2510.03169', 'abstract': 'For typical applications of UAVs in power grid scenarios, we construct the problem as planning UAV trajectories for coverage in cluttered environments. In this paper, we propose an optimal smooth coverage trajectory planning algorithm. The algorithm consists of two stages. In the front-end, a Genetic Algorithm (GA) is employed to solve the Traveling Salesman Problem (TSP) for Points of Interest (POIs), generating an initial sequence of optimized visiting points. In the back-end, the sequence is further optimized by considering trajectory smoothness, time consumption, and obstacle avoidance. This is formulated as a nonlinear least squares problem and solved to produce a smooth coverage trajectory that satisfies these constraints. Numerical simulations validate the effectiveness of the proposed algorithm, ensuring UAVs can smoothly cover all POIs in cluttered environments.', 'abstract_zh': '对于电力电网场景中典型无人机应用，我们将问题定义为在复杂环境下的无人机覆盖轨迹规划。在本文中，我们提出了一种最优平滑覆盖轨迹规划算法。该算法分为两个阶段。前端采用遗传算法（GA）求解兴趣点（POIs）的旅行商问题（TSP），生成初始的优化访问序列。后端进一步优化序列，考虑轨迹平滑性、时间消耗和障碍物规避。该问题被形式化为非线性最小二乘问题并求解，生成满足这些约束的平滑覆盖轨迹。数值仿真验证了所提算法的有效性，确保无人机能够顺利覆盖所有POIs在复杂环境中的所有位置。', 'title_zh': '面向杂乱环境四旋翼的最优平滑覆盖轨迹规划'}
{'arxiv_id': 'arXiv:2510.03123', 'title': 'Learning Stability Certificate for Robotics in Real-World Environments', 'authors': 'Zhe Shen', 'link': 'https://arxiv.org/abs/2510.03123', 'abstract': 'Stability certificates play a critical role in ensuring the safety and reliability of robotic systems. However, deriving these certificates for complex, unknown systems has traditionally required explicit knowledge of system dynamics, often making it a daunting task. This work introduces a novel framework that learns a Lyapunov function directly from trajectory data, enabling the certification of stability for autonomous systems without needing detailed system models. By parameterizing the Lyapunov candidate using a neural network and ensuring positive definiteness through Cholesky factorization, our approach automatically identifies whether the system is stable under the given trajectory. To address the challenges posed by noisy, real-world data, we allow for controlled violations of the stability condition, focusing on maintaining high confidence in the stability certification process. Our results demonstrate that this framework can provide data-driven stability guarantees, offering a robust method for certifying the safety of robotic systems in dynamic, real-world environments. This approach works without access to the internal control algorithms, making it applicable even in situations where system behavior is opaque or proprietary. The tool for learning the stability proof is open-sourced by this research: this https URL.', 'abstract_zh': '稳定性证书在确保机器人系统的安全性和可靠性中发挥着关键作用。然而，为复杂且未知的系统推导这些证书通常需要明确了解系统的动力学，这往往是一个艰巨的任务。本工作引入了一个新的框架，可以直接从轨迹数据中学习李雅普诺夫函数，从而使人们能够在无需详细系统模型的情况下为自主系统验证稳定性。通过使用神经网络参数化李雅普诺夫候选函数，并通过乔莱斯基分解确保正定性，我们的方法可以自动确定系统在给定轨迹下的稳定性。为了应对实际数据中的噪声挑战，我们允许在保持稳定性认证过程高置信度的前提下对稳定性条件进行可控的违反。我们的结果显示，该框架可以提供基于数据的稳定性保证，从而为动态的现实环境中的机器人系统安全认证提供一种稳健的方法。此方法无需访问内部控制算法，使其在系统行为不透明或专有的情况下同样适用。研究团队开源了用于学习稳定性证明的工具：this https URL。', 'title_zh': '机器人在实际环境中的稳定性证书学习'}
{'arxiv_id': 'arXiv:2510.03119', 'title': 'Whisker-based Tactile Flight for Tiny Drones', 'authors': 'Chaoxiang Ye, Guido de Croon, Salua Hamaza', 'link': 'https://arxiv.org/abs/2510.03119', 'abstract': 'Tiny flying robots hold great potential for search-and-rescue, safety inspections, and environmental monitoring, but their small size limits conventional sensing-especially with poor-lighting, smoke, dust or reflective obstacles. Inspired by nature, we propose a lightweight, 3.2-gram, whisker-based tactile sensing apparatus for tiny drones, enabling them to navigate and explore through gentle physical interaction. Just as rats and moles use whiskers to perceive surroundings, our system equips drones with tactile perception in flight, allowing obstacle sensing even in pitch-dark conditions. The apparatus uses barometer-based whisker sensors to detect obstacle locations while minimising destabilisation. To address sensor noise and drift, we develop a tactile depth estimation method achieving sub-6 mm accuracy. This enables drones to navigate, contour obstacles, and explore confined spaces solely through touch-even in total darkness along both soft and rigid surfaces. Running fully onboard a 192-KB RAM microcontroller, the system supports autonomous tactile flight and is validated in both simulation and real-world tests. Our bio-inspired approach redefines vision-free navigation, opening new possibilities for micro aerial vehicles in extreme environments.', 'abstract_zh': '基于触觉传感的小型无人机轻量化探知装置及其在低光照环境下的导航探索技术', 'title_zh': '基于 whisker 的/tiny无人机触觉飞行'}
{'arxiv_id': 'arXiv:2510.02976', 'title': 'Real-Time Nonlinear Model Predictive Control of Heavy-Duty Skid-Steered Mobile Platform for Trajectory Tracking Tasks', 'authors': 'Alvaro Paz, Pauli Mustalahti, Mohammad Dastranj, Jouni Mattila', 'link': 'https://arxiv.org/abs/2510.02976', 'abstract': 'This paper presents a framework for real-time optimal controlling of a heavy-duty skid-steered mobile platform for trajectory tracking. The importance of accurate real-time performance of the controller lies in safety considerations of situations where the dynamic system under control is affected by uncertainties and disturbances, and the controller should compensate for such phenomena in order to provide stable performance. A multiple-shooting nonlinear model-predictive control framework is proposed in this paper. This framework benefits from suitable algorithm along with readings from various sensors for genuine real-time performance with extremely high accuracy. The controller is then tested for tracking different trajectories where it demonstrates highly desirable performance in terms of both speed and accuracy. This controller shows remarkable improvement when compared to existing nonlinear model-predictive controllers in the literature that were implemented on skid-steered mobile platforms.', 'abstract_zh': '本文提出了一种用于轨迹跟踪的重载式滑移转向移动平台实时最优控制框架。该控制器的准确实时性能对于受不确定性和干扰影响的动力系统安全至关重要，控制器需补偿此类现象以提供稳定的性能。本文提出了一种多段射击非线性模型预测控制框架，该框架结合了合适的算法和各种传感器读数，实现了极高的实时准确性能。该控制器被测试用于跟踪不同的轨迹，展示了在速度和精度方面的出色性能。与文献中已在滑移转向移动平台上实现的非线性模型预测控制器相比，该控制器显示出显著的改进。', 'title_zh': '重型履带滑移转向移动平台的实时非线性模型预测控制及其轨迹跟踪任务'}
{'arxiv_id': 'arXiv:2510.02975', 'title': 'AI-Enhanced Kinematic Modeling of Flexible Manipulators Using Multi-IMU Sensor Fusion', 'authors': 'Amir Hossein Barjini, Jouni Mattila', 'link': 'https://arxiv.org/abs/2510.02975', 'abstract': 'This paper presents a novel framework for estimating the position and orientation of flexible manipulators undergoing vertical motion using multiple inertial measurement units (IMUs), optimized and calibrated with ground truth data. The flexible links are modeled as a series of rigid segments, with joint angles estimated from accelerometer and gyroscope measurements acquired by cost-effective IMUs. A complementary filter is employed to fuse the measurements, with its parameters optimized through particle swarm optimization (PSO) to mitigate noise and delay. To further improve estimation accuracy, residual errors in position and orientation are compensated using radial basis function neural networks (RBFNN). Experimental results validate the effectiveness of the proposed intelligent multi-IMU kinematic estimation method, achieving root mean square errors (RMSE) of 0.00021~m, 0.00041~m, and 0.00024~rad for $y$, $z$, and $\\theta$, respectively.', 'abstract_zh': '本文提出了一种基于多惯性测量单元（IMU）并使用地面truth数据优化与校准的柔性 manipulator 在垂直运动中位置和姿态估计的新型框架。柔性连杆被建模为一系列刚性段，关节角度从低成本IMU获取的加速度计和陀螺仪测量值中估计。采用互补滤波器融合测量值，并通过粒子群优化（PSO）优化参数以减轻噪声和延迟。为进一步提高估计精度，位置和姿态的剩余误差通过径向基函数神经网络（RBFNN）进行补偿。实验结果验证了所提出的智能多IMU运动学估计方法的有效性，分别实现了根 mean square error（RMSE）为0.00021 m、0.00041 m和0.00024 rad的误差。', 'title_zh': '基于多IMU传感器融合的智能增强柔性 manipulator 动态建模'}
{'arxiv_id': 'arXiv:2510.02968', 'title': 'YawSitter: Modeling and Controlling a Tail-Sitter UAV with Enhanced Yaw Control', 'authors': 'Amir Habel, Fawad Mehboob, Jeffrin Sam, Clement Fortin, Dzmitry Tsetserukou', 'link': 'https://arxiv.org/abs/2510.02968', 'abstract': 'Achieving precise lateral motion modeling and decoupled control in hover remains a significant challenge for tail-sitter Unmanned Aerial Vehicles (UAVs), primarily due to complex aerodynamic couplings and the absence of welldefined lateral dynamics. This paper presents a novel modeling and control strategy that enhances yaw authority and lateral motion by introducing a sideslip force model derived from differential propeller slipstream effects acting on the fuselage under differential thrust. The resulting lateral force along the body y-axis enables yaw-based lateral position control without inducing roll coupling. The control framework employs a YXZ Euler rotation formulation to accurately represent attitude and incorporate gravitational components while directly controlling yaw in the yaxis, thereby improving lateral dynamic behavior and avoiding singularities. The proposed approach is validated through trajectory-tracking simulations conducted in a Unity-based environment. Tests on both rectangular and circular paths in hover mode demonstrate stable performance, with low mean absolute position errors and yaw deviations constrained within 5.688 degrees. These results confirm the effectiveness of the proposed lateral force generation model and provide a foundation for the development of agile, hover-capable tail-sitter UAVs.', 'abstract_zh': '实现悬停状态下尾坐无人空中车辆精确的横向运动建模与解耦控制仍然是一个重大挑战，主要是由于复杂的气动耦合和缺乏明确的横向动力学定义。本文提出了一种新的建模和控制策略，通过引入由差动推力引起的旋翼滑流效应作用在机身上的侧滑力模型来增强航向权限和横向运动。由此产生的沿机身y轴的横向力使横向位置控制基于航向，而不引起滚转耦合。控制框架采用YXZ欧拉旋转表示法，准确表示姿态并包含重力组件，同时直接控制y轴上的航向，从而改善横向动力学行为并避免奇点。所提出的方法通过在基于Unity的环境中进行轨迹跟踪仿真得到验证。悬停模式下沿矩形和圆形轨迹的测试显示稳定性能，平均绝对位置误差低，航向偏差限于5.688度以内。这些结果证实了所提出横向力生成模型的有效性，并为开发敏捷悬停尾坐无人空中车辆奠定了基础。', 'title_zh': 'YawSitter: 建模与控制一种增强Yaw控制的Tail-Sitter无人飞行器'}
{'arxiv_id': 'arXiv:2510.02946', 'title': 'Single-Rod Brachiation Robot: Mechatronic Control Design and Validation of Prejump Phases', 'authors': 'Juraj Lieskovský, Hijiri Akahane, Aoto Osawa, Jaroslav Bušek, Ikuo Mizuuchi, Tomáš Vyhlídal', 'link': 'https://arxiv.org/abs/2510.02946', 'abstract': "A complete mechatronic design of a minimal configuration brachiation robot is presented. The robot consists of a single rigid rod with gripper mechanisms attached to both ends. The grippers are used to hang the robot on a horizontal bar on which it swings or rotates. The motion is imposed by repositioning the robot's center of mass, which is performed using a crank-slide mechanism. Based on a non-linear model, an optimal control strategy is proposed, for repositioning the center of mass in a bang-bang manner. Consequently, utilizing the concept of input-output linearization, a continuous control strategy is proposed that takes into account the limited torque of the crank-slide mechanism and its geometry. An increased attention is paid to energy accumulation towards the subsequent jump stage of the brachiation. These two strategies are validated and compared in simulations. The continuous control strategy is then also implemented within a low-cost STM32-based control system, and both the swing and rotation stages of the brachiation motion are experimentally validated.", 'abstract_zh': '一种minimal configuration brachiation机器人的完整机电设计被提出。该机器人由一根带有 gripper 机制的两端的刚性杆组成。抓取器用于使机器人挂在水平横杆上进行摆动或旋转。通过重新定位机器人的质心来施加运动，该动作由凸轮-滑块机构完成。基于非线性模型，提出了一种最优控制策略，以bang-bang方式重新定位质心。随后，利用输入-输出线性化概念，提出了一种考虑凸轮-滑块机构的有限转矩及其几何形状的连续控制策略。特别关注于能量积累以改善后续跳跃阶段的 brachiation 性能。这两种策略在仿真中得到验证和比较。随后，连续控制策略在基于低成本STM32的控制系统中实现，并且摆动和旋转阶段的brachiation运动也在实验中得到了验证。', 'title_zh': '单棒前空翻机器人：机械电子控制设计与预翻转阶段验证'}
{'arxiv_id': 'arXiv:2510.02885', 'title': 'Point Cloud-Based Control Barrier Functions for Model Predictive Control in Safety-Critical Navigation of Autonomous Mobile Robots', 'authors': 'Faduo Liang, Yunfeng Yang, Shi-Lu Dai', 'link': 'https://arxiv.org/abs/2510.02885', 'abstract': 'In this work, we propose a novel motion planning algorithm to facilitate safety-critical navigation for autonomous mobile robots. The proposed algorithm integrates a real-time dynamic obstacle tracking and mapping system that categorizes point clouds into dynamic and static components. For dynamic point clouds, the Kalman filter is employed to estimate and predict their motion states. Based on these predictions, we extrapolate the future states of dynamic point clouds, which are subsequently merged with static point clouds to construct the forward-time-domain (FTD) map. By combining control barrier functions (CBFs) with nonlinear model predictive control, the proposed algorithm enables the robot to effectively avoid both static and dynamic obstacles. The CBF constraints are formulated based on risk points identified through collision detection between the predicted future states and the FTD map. Experimental results from both simulated and real-world scenarios demonstrate the efficacy of the proposed algorithm in complex environments. In simulation experiments, the proposed algorithm is compared with two baseline approaches, showing superior performance in terms of safety and robustness in obstacle avoidance. The source code is released for the reference of the robotics community.', 'abstract_zh': '本研究提出了一种新型运动规划算法，以促进自主移动机器人在安全关键导航中的应用。该提出的算法整合了一个实时动态障碍跟踪和制图系统，将点云分类为动态和静态组件。对于动态点云，使用卡尔曼滤波器来估计和预测其运动状态。基于这些预测，我们外推动态点云的未来状态，并将这些状态与静态点云合并以构建未来时间域（FTD）地图。通过结合控制屏障函数（CBFs）与非线性模型预测控制，提出的算法使机器人能够有效避免静态和动态障碍。CBF约束是基于风险点制定的，这些风险点是通过检测预测未来状态与FTD地图之间的碰撞检测来识别的。实验结果来自模拟和真实场景，证明了该算法在复杂环境中的有效性。在模拟实验中，该算法与两种基准方法进行了比较，显示出在障碍物避免方面的优越的安全性和鲁棒性。源代码已发布供机器人社区参考。', 'title_zh': '基于点云的控制屏障函数在自主移动机器人安全关键导航中的模型预测控制'}
{'arxiv_id': 'arXiv:2510.02874', 'title': 'Novel UWB Synthetic Aperture Radar Imaging for Mobile Robot Mapping', 'authors': 'Charith Premachandra, U-Xuan Tan', 'link': 'https://arxiv.org/abs/2510.02874', 'abstract': 'Traditional exteroceptive sensors in mobile robots, such as LiDARs and cameras often struggle to perceive the environment in poor visibility conditions. Recently, radar technologies, such as ultra-wideband (UWB) have emerged as potential alternatives due to their ability to see through adverse environmental conditions (e.g. dust, smoke and rain). However, due to the small apertures with low directivity, the UWB radars cannot reconstruct a detailed image of its field of view (FOV) using a single scan. Hence, a virtual large aperture is synthesized by moving the radar along a mobile robot path. The resulting synthetic aperture radar (SAR) image is a high-definition representation of the surrounding environment. Hence, this paper proposes a pipeline for mobile robots to incorporate UWB radar-based SAR imaging to map an unknown environment. Finally, we evaluated the performance of classical feature detectors: SIFT, SURF, BRISK, AKAZE and ORB to identify loop closures using UWB SAR images. The experiments were conducted emulating adverse environmental conditions. The results demonstrate the viability and effectiveness of UWB SAR imaging for high-resolution environmental mapping and loop closure detection toward more robust and reliable robotic perception systems.', 'abstract_zh': '移动机器人中基于UWB雷达的合成孔径雷达成像方法及其在高分辨率环境映射和回环检测中的应用', 'title_zh': '基于新型UWB合成孔径雷达成像的移动机器人建图'}
{'arxiv_id': 'arXiv:2510.02808', 'title': 'Assist-as-needed Control for FES in Foot Drop Management', 'authors': 'Andreas Christou, Elliot Lister, Georgia Andreopoulou, Don Mahad, Sethu Vijayakumar', 'link': 'https://arxiv.org/abs/2510.02808', 'abstract': 'Foot drop is commonly managed using Functional Electrical Stimulation (FES), typically delivered via open-loop controllers with fixed stimulation intensities. While users may manually adjust the intensity through external controls, this approach risks overstimulation, leading to muscle fatigue and discomfort, or understimulation, which compromises dorsiflexion and increases fall risk. In this study, we propose a novel closed-loop FES controller that dynamically adjusts the stimulation intensity based on real-time toe clearance, providing "assistance as needed". We evaluate this system by inducing foot drop in healthy participants and comparing the effects of the closed-loop controller with a traditional open-loop controller across various walking conditions, including different speeds and surface inclinations. Kinematic data reveal that our closed-loop controller maintains adequate toe clearance without significantly affecting the joint angles of the hips, the knees, and the ankles, and while using significantly lower stimulation intensities compared to the open-loop controller. These findings suggest that the proposed method not only matches the effectiveness of existing systems but also offers the potential for reduced muscle fatigue and improved long-term user comfort and adherence.', 'abstract_zh': '基于实时趾 Clearance的闭合环路功能性电刺激控制器管理足下垂研究', 'title_zh': '按需辅助控制在足下垂管理中的应用'}
{'arxiv_id': 'arXiv:2510.02624', 'title': 'Multi-robot Rigid Formation Navigation via Synchronous Motion and Discrete-time Communication-Control Optimization', 'authors': 'Qun Yang, Soung Chang Liew', 'link': 'https://arxiv.org/abs/2510.02624', 'abstract': 'Rigid-formation navigation of multiple robots is essential for applications such as cooperative transportation. This process involves a team of collaborative robots maintaining a predefined geometric configuration, such as a square, while in motion. For untethered collaborative motion, inter-robot communication must be conducted through a wireless network. Notably, few existing works offer a comprehensive solution for multi-robot formation navigation executable on microprocessor platforms via wireless networks, particularly for formations that must traverse complex curvilinear paths. To address this gap, we introduce a novel "hold-and-hit" communication-control framework designed to work seamlessly with the widely-used Robotic Operating System (ROS) platform. The hold-and-hit framework synchronizes robot movements in a manner robust against wireless network delays and packet loss. It operates over discrete-time communication-control cycles, making it suitable for implementation on contemporary microprocessors. Complementary to hold-and-hit, we propose an intra-cycle optimization approach that enables rigid formations to closely follow desired curvilinear paths, even under the nonholonomic movement constraints inherent to most vehicular robots. The combination of hold-and-hit and intra-cycle optimization ensures precise and reliable navigation even in challenging scenarios. Simulations in a virtual environment demonstrate the superiority of our method in maintaining a four-robot square formation along an S-shaped path, outperforming two existing approaches. Furthermore, real-world experiments validate the effectiveness of our framework: the robots maintained an inter-distance error within $\\pm 0.069m$ and an inter-angular orientation error within $\\pm19.15^{\\circ}$ while navigating along an S-shaped path at a fixed linear velocity of $0.1 m/s$.', 'abstract_zh': '多机器人刚性编队无线网络导航方法研究', 'title_zh': '基于同步运动与离散时间通信-控制优化的多机器人刚性编队导航'}
{'arxiv_id': 'arXiv:2510.02623', 'title': 'Reachable Predictive Control: A Novel Control Algorithm for Nonlinear Systems with Unknown Dynamics and its Practical Applications', 'authors': 'Taha Shafa, Yiming Meng, Melkior Ornik', 'link': 'https://arxiv.org/abs/2510.02623', 'abstract': 'This paper proposes an algorithm capable of driving a system to follow a piecewise linear trajectory without prior knowledge of the system dynamics. Motivated by a critical failure scenario in which a system can experience an abrupt change in its dynamics, we demonstrate that it is possible to follow a set of waypoints comprised of states analytically proven to be reachable despite not knowing the system dynamics. The proposed algorithm first applies small perturbations to locally learn the system dynamics around the current state, then computes the set of states that are provably reachable using the locally learned dynamics and their corresponding maximum growth-rate bounds, and finally synthesizes a control action that navigates the system to a guaranteed reachable state.', 'abstract_zh': '本文提出了一种算法，能够在未知系统动力学的情况下，驱动系统跟随分段线性轨迹。受系统动力学突然改变的关键故障场景启发，我们证明即使不知道系统动力学，也可以跟随由可证可到达状态组成的航点集。该提议的算法首先通过对当前状态进行小扰动来局部学习系统动力学，然后使用局部学习到的动力学及其相应的最大增长速率界来计算可证可到达的状态集，最后合成一种控制动作，使系统导航到一个有保证可到达的状态。', 'title_zh': '可达预测控制：一种用于未知动态非线性系统的新型控制算法及其实际应用'}
{'arxiv_id': 'arXiv:2510.02594', 'title': 'SubSense: VR-Haptic and Motor Feedback for Immersive Control in Subsea Telerobotics', 'authors': 'Ruo Chen, David Blow, Adnan Abdullah, Md Jahidul Islam', 'link': 'https://arxiv.org/abs/2510.02594', 'abstract': "This paper investigates the integration of haptic feedback and virtual reality (VR) control interfaces to enhance teleoperation and telemanipulation of underwater ROVs (remotely operated vehicles). Traditional ROV teleoperation relies on low-resolution 2D camera feeds and lacks immersive and sensory feedback, which diminishes situational awareness in complex subsea environments. We propose SubSense -- a novel VR-Haptic framework incorporating a non-invasive feedback interface to an otherwise 1-DOF (degree of freedom) manipulator, which is paired with the teleoperator's glove to provide haptic feedback and grasp status. Additionally, our framework integrates end-to-end software for managing control inputs and displaying immersive camera views through a VR platform. We validate the system through comprehensive experiments and user studies, demonstrating its effectiveness over conventional teleoperation interfaces, particularly for delicate manipulation tasks. Our results highlight the potential of multisensory feedback in immersive virtual environments to significantly improve remote situational awareness and mission performance, offering more intuitive and accessible ROV operations in the field.", 'abstract_zh': '本研究探讨了将触感反馈与虚拟现实（VR）控制接口集成以增强遥控潜水器（ROV）的远程操作和远程操控。传统ROV远程操作依赖于低分辨率的2D摄像头馈送，并缺乏沉浸式和感官反馈，这在复杂的海底环境中降低了态势感知能力。我们提出了一种名为SubSense的新颖VR-触感框架，该框架结合了一个非侵入性反馈接口，用于配对手动执行器，该执行器与遥控操作员的手套配对，提供触感反馈和抓取状态。此外，我们的框架通过VR平台集成了端到端的软件，用于管理和显示沉浸式摄像机视图。通过全面的实验和用户研究，我们验证了该系统的有效性和比传统远程操作界面的优势，特别是在精细操控任务方面。研究结果表明，多感官反馈在沉浸式虚拟环境中具有显著增强远程态势感知和任务性能的潜力，为现场遥控潜水器操作提供更直观和易用的服务。', 'title_zh': 'SubSense: 海底远程操控中的VR触觉与运动反馈沉浸式控制'}
{'arxiv_id': 'arXiv:2510.02526', 'title': 'U-LAG: Uncertainty-Aware, Lag-Adaptive Goal Retargeting for Robotic Manipulation', 'authors': 'Anamika J H, Anujith Muraleedharan', 'link': 'https://arxiv.org/abs/2510.02526', 'abstract': 'Robots manipulating in changing environments must act on percepts that are late, noisy, or stale. We present U-LAG, a mid-execution goal-retargeting layer that leaves the low-level controller unchanged while re-aiming task goals (pre-contact, contact, post) as new observations arrive. Unlike motion retargeting or generic visual servoing, U-LAG treats in-flight goal re-aiming as a first-class, pluggable module between perception and control. Our main technical contribution is UAR-PF, an uncertainty-aware retargeter that maintains a distribution over object pose under sensing lag and selects goals that maximize expected progress. We instantiate a reproducible Shift x Lag stress test in PyBullet/PandaGym for pick, push, stacking, and peg insertion, where the object undergoes abrupt in-plane shifts while synthetic perception lag is injected during approach. Across 0-10 cm shifts and 0-400 ms lags, UAR-PF and ICP degrade gracefully relative to a no-retarget baseline, achieving higher success with modest end-effector travel and fewer aborts; simple operational safeguards further improve stability. Contributions: (1) UAR-PF for lag-adaptive, uncertainty-aware goal retargeting; (2) a pluggable retargeting interface; and (3) a reproducible Shift x Lag benchmark with evaluation on pick, push, stacking, and peg insertion.', 'abstract_zh': 'robots在变化环境中的操作必须基于延迟、噪声或过时的感知信息。我们提出U-LAG，在保持低级控制器不变的情况下，重新瞄准任务目标（接触前、接触中、接触后），并随新观察信息的到达而调整。不同于运动重定或通用视觉伺服，U-LAG 将飞行中的目标重定作为感知与控制之间可插拔的一等模块。我们的主要技术贡献是UAR-PF，一种具有不确定性意识的重定器，在感知滞后下维护物体姿态分布，并选择最大化预期进度的目标。我们在PyBullet/PandaGym中实例化了一个可重现的Shift x Lag压力测试，用于捡拾、推移、堆叠和针插入任务，其中物体在接近过程中注入合成感知滞后，并经历平面内的突然变化。在0-10 cm的位移和0-400 ms的滞后下，与无重定基线相比，UAR-PF和ICP表现得更为稳健，具有较小的末端执行器移动和较少的终止事件；简单的操作保护措施进一步提高了稳定性。贡献包括：(1) UAR-PF用于滞后适应性和不确定性意识的目标重定；(2) 一种可插拔的重定接口；以及(3) 一个具有捡拾、推移、堆叠和针插入评估的可重现Shift x Lag基准测试。', 'title_zh': 'U-LAG：具有不确定性意识和lag自适应的目标重定位于机器人操作中'}
{'arxiv_id': 'arXiv:2510.03100', 'title': 'A Dimension-Decomposed Learning Framework for Online Disturbance Identification in Quadrotor SE(3) Control', 'authors': 'Tianhua Gao', 'link': 'https://arxiv.org/abs/2510.03100', 'abstract': 'Quadrotor stability under complex dynamic disturbances and model uncertainties poses significant challenges. One of them remains the underfitting problem in high-dimensional features, which limits the identification capability of current learning-based methods. To address this, we introduce a new perspective: Dimension-Decomposed Learning (DiD-L), from which we develop the Sliced Adaptive-Neuro Mapping (SANM) approach for geometric control. Specifically, the high-dimensional mapping for identification is axially ``sliced" into multiple low-dimensional submappings (``slices"). In this way, the complex high-dimensional problem is decomposed into a set of simple low-dimensional tasks addressed by shallow neural networks and adaptive laws. These neural networks and adaptive laws are updated online via Lyapunov-based adaptation without any pre-training or persistent excitation (PE) condition. To enhance the interpretability of the proposed approach, we prove that the full-state closed-loop system exhibits arbitrarily close to exponential stability despite multi-dimensional time-varying disturbances and model uncertainties. This result is novel as it demonstrates exponential convergence without requiring pre-training for unknown disturbances and specific knowledge of the model.', 'abstract_zh': 'Quadrotor 几何控制下的复杂动态扰动和模型不确定性下的欠拟合问题提出了显著挑战：基于维度分解学习的新视角及 Sliced 自适应神经映射方法', 'title_zh': '基于四旋翼SE(3)控制在线干扰识别的维度分解学习框架'}
