{'arxiv_id': 'arXiv:2508.10780', 'title': 'Learning Task Execution Hierarchies for Redundant Robots', 'authors': 'Alessandro Adami, Aris Synodinos, Matteo Iovino, Ruggero Carli, Pietro Falco', 'link': 'https://arxiv.org/abs/2508.10780', 'abstract': 'Modern robotic systems, such as mobile manipulators, humanoids, and aerial robots with arms, often possess high redundancy, enabling them to perform multiple tasks simultaneously. Managing this redundancy is key to achieving reliable and flexible behavior. A widely used approach is the Stack of Tasks (SoT), which organizes control objectives by priority within a unified framework. However, traditional SoTs are manually designed by experts, limiting their adaptability and accessibility. This paper introduces a novel framework that automatically learns both the hierarchy and parameters of a SoT from user-defined objectives. By combining Reinforcement Learning and Genetic Programming, the system discovers task priorities and control strategies without manual intervention. A cost function based on intuitive metrics such as precision, safety, and execution time guides the learning process. We validate our method through simulations and experiments on the mobile-YuMi platform, a dual-arm mobile manipulator with high redundancy. Results show that the learned SoTs enable the robot to dynamically adapt to changing environments and inputs, balancing competing objectives while maintaining robust task execution. This approach provides a general and user-friendly solution for redundancy management in complex robots, advancing human-centered robot programming and reducing the need for expert design.', 'abstract_zh': '现代机器人系统，如移动 manipulator、类人机器人和具有手臂的无人机，通常拥有高冗余度，使它们能够同时执行多种任务。管理这种冗余度对于实现可靠和灵活的行为至关重要。一种常用的办法是任务堆栈（SoT），它在一个统一框架中通过优先级组织控制目标。然而，传统 SoT 通常是专家手工设计的，限制了其适应性和易用性。本文介绍了一种新颖的框架，可以从用户定义的目标中自动学习 SoT 的层次结构和参数。通过结合强化学习和遗传编程，该系统在无手动干预的情况下发现了任务优先级和控制策略。基于直观的度量标准（如精度、安全性和执行时间）的代价函数指导学习过程。我们通过在移动-YuMi 平台上进行的仿真实验验证了该方法，移动-YuMi 是一个具有高冗余度的双臂移动 manipulator。结果表明，学习到的 SoT 使机器人能够动态适应变化的环境和输入，同时在平衡竞争目标的同时保持任务执行的鲁棒性。这种方法为复杂机器人中的冗余度管理提供了一种通用且用户友好的解决方案，促进了以人为核心的机器人编程，并减少了对专家设计的依赖。', 'title_zh': '冗余机器人学习任务执行层次结构'}
{'arxiv_id': 'arXiv:2508.10634', 'title': 'Synthesis of Deep Neural Networks with Safe Robust Adaptive Control for Reliable Operation of Wheeled Mobile Robots', 'authors': 'Mehdi Heydari Shahna, Jouni Mattila', 'link': 'https://arxiv.org/abs/2508.10634', 'abstract': 'Deep neural networks (DNNs) can enable precise control while maintaining low computational costs by circumventing the need for dynamic modeling. However, the deployment of such black-box approaches remains challenging for heavy-duty wheeled mobile robots (WMRs), which are subject to strict international standards and prone to faults and disturbances. We designed a hierarchical control policy for heavy-duty WMRs, monitored by two safety layers with differing levels of authority. To this end, a DNN policy was trained and deployed as the primary control strategy, providing high-precision performance under nominal operating conditions. When external disturbances arise and reach a level of intensity such that the system performance falls below a predefined threshold, a low-level safety layer intervenes by deactivating the primary control policy and activating a model-free robust adaptive control (RAC) policy. This transition enables the system to continue operating while ensuring stability by effectively managing the inherent trade-off between system robustness and responsiveness. Regardless of the control policy in use, a high-level safety layer continuously monitors system performance during operation. It initiates a shutdown only when disturbances become sufficiently severe such that compensation is no longer viable and continued operation would jeopardize the system or its environment. The proposed synthesis of DNN and RAC policy guarantees uniform exponential stability of the entire WMR system while adhering to safety standards to some extent. The effectiveness of the proposed approach was further validated through real-time experiments using a 6,000 kg WMR.', 'abstract_zh': '深度神经网络在重载地面移动机器人中的 hierarchical 控制策略：集成模型自由鲁棒自适应控制的安全合成', 'title_zh': '基于安全鲁棒自适应控制的轮式移动机器人深神经网络合成方法'}
{'arxiv_id': 'arXiv:2508.10497', 'title': 'Enabling Generic Robot Skill Implementation Using Object Oriented Programming', 'authors': 'Abdullah Farrukh, Achim Wagner, Martin Ruskowski', 'link': 'https://arxiv.org/abs/2508.10497', 'abstract': 'Developing robotic algorithms and integrating a robotic subsystem into a larger system can be a difficult task. Particularly in small and medium-sized enterprises (SMEs) where robotics expertise is lacking, implementing, maintaining and developing robotic systems can be a challenge. As a result, many companies rely on external expertise through system integrators, which, in some cases, can lead to vendor lock-in and external dependency. In the academic research on intelligent manufacturing systems, robots play a critical role in the design of robust autonomous systems. Similar challenges are faced by researchers who want to use robotic systems as a component in a larger smart system, without having to deal with the complexity and vastness of the robot interfaces in detail. In this paper, we propose a software framework that reduces the effort required to deploy a working robotic system. The focus is solely on providing a concept for simplifying the different interfaces of a modern robot system and using an abstraction layer for different manufacturers and models. The Python programming language is used to implement a prototype of the concept. The target system is a bin-picking cell containing a Yaskawa Motoman GP4.', 'abstract_zh': '开发机器人算法并将机器人子系统集成到更大系统中可能是一项困难的任务。特别是在缺乏机器人专业知识的小型和中型企业（SMEs）中，实现、维护和发展机器人系统会面临挑战。因此，许多公司依赖系统集成商的外部专业知识，这在某些情况下会导致供应商锁定和对外部的依赖。在智能制造系统的学术研究中，机器人在设计健壮的自主系统中起着关键作用。研究人员希望将机器人系统作为更大智能系统中的组件使用时也面临类似挑战，无需详细处理机器人的复杂接口。本文提出了一种软件框架，以减少部署工作机器人系统的努力。该框架专注于简化现代机器人系统中不同的接口，并使用不同的制造商和型号的抽象层。使用Python编程语言实现了该概念的原型。目标系统是一个包含Yaskawa Motoman GP4的料箱取放单元。', 'title_zh': '使用面向对象编程实现通用机器人技能实施'}
{'arxiv_id': 'arXiv:2508.10398', 'title': 'Super LiDAR Reflectance for Robotic Perception', 'authors': 'Wei Gao, Jie Zhang, Mingle Zhao, Zhiyuan Zhang, Shu Kong, Maani Ghaffari, Dezhen Song, Cheng-Zhong Xu, Hui Kong', 'link': 'https://arxiv.org/abs/2508.10398', 'abstract': 'Conventionally, human intuition often defines vision as a modality of passive optical sensing, while active optical sensing is typically regarded as measuring rather than the default modality of vision. However, the situation now changes: sensor technologies and data-driven paradigms empower active optical sensing to redefine the boundaries of vision, ushering in a new era of active vision. Light Detection and Ranging (LiDAR) sensors capture reflectance from object surfaces, which remains invariant under varying illumination conditions, showcasing significant potential in robotic perception tasks such as detection, recognition, segmentation, and Simultaneous Localization and Mapping (SLAM). These applications often rely on dense sensing capabilities, typically achieved by high-resolution, expensive LiDAR sensors. A key challenge with low-cost LiDARs lies in the sparsity of scan data, which limits their broader application. To address this limitation, this work introduces an innovative framework for generating dense LiDAR reflectance images from sparse data, leveraging the unique attributes of non-repeating scanning LiDAR (NRS-LiDAR). We tackle critical challenges, including reflectance calibration and the transition from static to dynamic scene domains, facilitating the reconstruction of dense reflectance images in real-world settings. The key contributions of this work include a comprehensive dataset for LiDAR reflectance image densification, a densification network tailored for NRS-LiDAR, and diverse applications such as loop closure and traffic lane detection using the generated dense reflectance images.', 'abstract_zh': '传统上，人类直觉将视觉视为一种被动光学感知模式，而主动光学感知通常被视为测量而非视觉的默认模式。然而，当前的情况发生了变化：传感器技术和数据驱动的方法赋予了主动光学感知重新定义视觉边界的能力，开启了主动视觉的新时代。Light Detection and Ranging (LiDAR) 传感器捕获物体表面的反射率，这种反射率在不同照明条件下保持不变，展示了在机器人感知任务（如检测、识别、分割和Simultaneous Localization and Mapping (SLAM)）中巨大的潜力。这些应用往往依赖于密集的感知能力，通常通过高分辨率、昂贵的LiDAR传感器实现。低成本LiDAR的一个关键挑战在于扫描数据的稀疏性，这限制了它们的广泛应用。为此，本工作提出了一种创新框架，从稀疏数据生成密集的LiDAR反射率图像，利用非重复扫描LiDAR (NRS-LiDAR) 的独特属性。我们解决了反射率校准和从静态场景向动态场景过渡的关键挑战，促进了在实际场景中重建密集反射率图像。本工作的主要贡献包括LiDAR反射率图像稀疏化数据集、专为NRS-LiDAR设计的稀疏化网络，以及使用生成的密集反射率图像进行环路闭合和交通车道检测等多种应用。', 'title_zh': '超分辨率LiDAR反射率用于机器人感知'}
{'arxiv_id': 'arXiv:2508.10269', 'title': 'Hybrid Data-Driven Predictive Control for Robust and Reactive Exoskeleton Locomotion Synthesis', 'authors': 'Kejun Li, Jeeseop Kim, Maxime Brunet, Marine Pétriaux, Yisong Yue, Aaron D. Ames', 'link': 'https://arxiv.org/abs/2508.10269', 'abstract': 'Robust bipedal locomotion in exoskeletons requires the ability to dynamically react to changes in the environment in real time. This paper introduces the hybrid data-driven predictive control (HDDPC) framework, an extension of the data-enabled predictive control, that addresses these challenges by simultaneously planning foot contact schedules and continuous domain trajectories. The proposed framework utilizes a Hankel matrix-based representation to model system dynamics, incorporating step-to-step (S2S) transitions to enhance adaptability in dynamic environments. By integrating contact scheduling with trajectory planning, the framework offers an efficient, unified solution for locomotion motion synthesis that enables robust and reactive walking through online replanning. We validate the approach on the Atalante exoskeleton, demonstrating improved robustness and adaptability.', 'abstract_zh': '外骨骼中鲁棒的双足运动需要能够实时动态应对环境变化的能力。本文介绍了基于混合数据驱动预测控制（HDDPC）框架，这一扩展的数据使能预测控制方法通过同时规划脚接触时间和连续域轨迹来解决这些挑战。所提出的方法利用Hankel矩阵进行系统动力学建模，并通过步态到步态（S2S）转换增强在动态环境中的适应性。通过将接触规划与轨迹规划集成，该框架提供了一种有效的统一解决方案，用于通过在线重新规划合成稳健且反应灵敏的行走运动。我们在Atalante外骨骼上验证了该方法，展示了其改进的鲁棒性和适应性。', 'title_zh': '基于数据驱动的混合预测控制方法用于实现稳健和反应式外骨骼步行合成'}
{'arxiv_id': 'arXiv:2508.10203', 'title': 'Systematic Constraint Formulation and Collision-Free Trajectory Planning Using Space-Time Graphs of Convex Sets', 'authors': 'Matthew D. Osburn, Cameron K. Peterson, John L. Salmon', 'link': 'https://arxiv.org/abs/2508.10203', 'abstract': 'In this paper, we create optimal, collision-free, time-dependent trajectories through cluttered dynamic environments. The many spatial and temporal constraints make finding an initial guess for a numerical solver difficult. Graphs of Convex Sets (GCS) and the recently developed Space-Time Graphs of Convex Sets formulation (ST-GCS) enable us to generate optimal minimum distance collision-free trajectories without providing an initial guess to the solver. We also explore the derivation of general GCS-compatible constraints and document an intuitive strategy for adapting general constraints to the framework. We show that ST-GCS produces equivalent trajectories to the standard GCS formulation when the environment is static. We then show ST-GCS operating in dynamic environments to find minimum distance collision-free trajectories.', 'abstract_zh': '本文通过复杂动态环境，创建最优且无碰撞的时间依赖轨迹。凸集合图（GCS）和最近发展的时空凸集合图（ST-GCS）形式化方法使我们能够在不需要求解器初始猜测的情况下生成最优的最小距离无碰撞轨迹。我们探索了通用GCS相容约束的推导，并记录了一种直观的策略，用于将通用约束适应该框架。当环境静止时，我们证明ST-GCS产生的轨迹与标准GCS形式化方法等效。然后，我们展示了ST-GCS在动态环境中寻找最小距离无碰撞轨迹的能力。', 'title_zh': '基于凸集时空图的系统约束形式化与碰撞免费轨迹规划 hentai'}
{'arxiv_id': 'arXiv:2508.10413', 'title': 'Probabilistic Latency Analysis of the Data Distribution Service in ROS 2', 'authors': 'Sanghoon Lee, Hyung-Seok Park, Jiyeong Chae, Kyung-Joon Park', 'link': 'https://arxiv.org/abs/2508.10413', 'abstract': 'Robot Operating System 2 (ROS 2) is now the de facto standard for robotic communication, pairing UDP transport with the Data Distribution Service (DDS) publish-subscribe middleware. DDS achieves reliability through periodic heartbeats that solicit acknowledgments for missing samples and trigger selective retransmissions. In lossy wireless networks, the tight coupling among heartbeat period, IP fragmentation, and retransmission interval obscures end to end latency behavior and leaves practitioners with little guidance on how to tune these parameters. To address these challenges, we propose a probabilistic latency analysis (PLA) that analytically models the reliable transmission process of ROS 2 DDS communication using a discrete state approach. By systematically analyzing both middleware level and transport level events, PLA computes the steady state probability distribution of unacknowledged messages and the retransmission latency. We validate our PLA across 270 scenarios, exploring variations in packet delivery ratios, message sizes, and both publishing and retransmission intervals, demonstrating a close alignment between analytical predictions and experimental results. Our findings establish a theoretical basis to systematically optimize reliability, latency, and performance in wireless industrial robotics.', 'abstract_zh': 'ROS 2的概率延迟分析：面向无线工业机器人中DDS通信的参数优化', 'title_zh': 'ROS 2中数据分布服务的概率延迟分析'}
{'arxiv_id': 'arXiv:2508.10423', 'title': 'MASH: Cooperative-Heterogeneous Multi-Agent Reinforcement Learning for Single Humanoid Robot Locomotion', 'authors': 'Qi Liu, Xiaopeng Zhang, Mingshan Tan, Shuaikang Ma, Jinliang Ding, Yanjie Li', 'link': 'https://arxiv.org/abs/2508.10423', 'abstract': "This paper proposes a novel method to enhance locomotion for a single humanoid robot through cooperative-heterogeneous multi-agent deep reinforcement learning (MARL). While most existing methods typically employ single-agent reinforcement learning algorithms for a single humanoid robot or MARL algorithms for multi-robot system tasks, we propose a distinct paradigm: applying cooperative-heterogeneous MARL to optimize locomotion for a single humanoid robot. The proposed method, multi-agent reinforcement learning for single humanoid locomotion (MASH), treats each limb (legs and arms) as an independent agent that explores the robot's action space while sharing a global critic for cooperative learning. Experiments demonstrate that MASH accelerates training convergence and improves whole-body cooperation ability, outperforming conventional single-agent reinforcement learning methods. This work advances the integration of MARL into single-humanoid-robot control, offering new insights into efficient locomotion strategies.", 'abstract_zh': '本文提出了一种通过合作异构多智能体深度强化学习（MARL）增强单个人形机器人运动的新方法。', 'title_zh': 'MASH: 合作多模态多agent强化学习在单人形机器人行动中的应用 roma ">user\n谢谢你，可以再翻译一遍确保准确性吗？'}
