{'arxiv_id': 'arXiv:2503.07504', 'title': 'PIPE Planner: Pathwise Information Gain with Map Predictions for Indoor Robot Exploration', 'authors': 'Seungjae Baek, Brady Moon, Seungchan Kim, Muqing Cao, Cherie Ho, Sebastian Scherer, Jeong hwan Jeon', 'link': 'https://arxiv.org/abs/2503.07504', 'abstract': 'Autonomous exploration in unknown environments requires estimating the information gain of an action to guide planning decisions. While prior approaches often compute information gain at discrete waypoints, pathwise integration offers a more comprehensive estimation but is often computationally challenging or infeasible and prone to overestimation. In this work, we propose the Pathwise Information Gain with Map Prediction for Exploration (PIPE) planner, which integrates cumulative sensor coverage along planned trajectories while leveraging map prediction to mitigate overestimation. To enable efficient pathwise coverage computation, we introduce a method to efficiently calculate the expected observation mask along the planned path, significantly reducing computational overhead. We validate PIPE on real-world floorplan datasets, demonstrating its superior performance over state-of-the-art baselines. Our results highlight the benefits of integrating predictive mapping with pathwise information gain for efficient and informed exploration.', 'abstract_zh': '基于地图预测的路径信息增益规划（PIPE）', 'title_zh': '基于地图预测的路径信息增益室内机器人探索方法'}
{'arxiv_id': 'arXiv:2503.07497', 'title': 'Force Aware Branch Manipulation To Assist Agricultural Tasks', 'authors': 'Madhav Rijal, Rashik Shrestha, Trevor Smith, Yu Gu', 'link': 'https://arxiv.org/abs/2503.07497', 'abstract': 'This study presents a methodology to safely manipulate branches to aid various agricultural tasks. Humans in a real agricultural environment often manipulate branches to perform agricultural tasks effectively, but current agricultural robots lack this capability. This proposed strategy to manipulate branches can aid in different precision agriculture tasks, such as fruit picking in dense foliage, pollinating flowers under occlusion, and moving overhanging vines and branches for navigation. The proposed method modifies RRT* to plan a path that satisfies the branch geometric constraints and obeys branch deformable characteristics. Re-planning is done to obtain a path that helps the robot exert force within a desired range so that branches are not damaged during manipulation. Experimentally, this method achieved a success rate of 78\\% across 50 trials, successfully moving a branch from different starting points to a target region.', 'abstract_zh': '本研究提出了一种安全操作树枝的方法以辅助各种农业任务。', 'title_zh': '基于力感知的分支操作以辅助农业任务'}
{'arxiv_id': 'arXiv:2503.07492', 'title': 'Blind-Wayfarer: A Minimalist, Probing-Driven Framework for Resilient Navigation in Perception-Degraded Environments', 'authors': 'Yanran Xu, Klaus-Peter Zauner, Danesh Tarapore', 'link': 'https://arxiv.org/abs/2503.07492', 'abstract': 'Navigating autonomous robots through dense forests and rugged terrains is especially daunting when exteroceptive sensors -- such as cameras and LiDAR sensors -- fail under occlusions, low-light conditions, or sensor noise. We present Blind-Wayfarer, a probing-driven navigation framework inspired by maze-solving algorithms that relies primarily on a compass to robustly traverse complex, unstructured environments. In 1,000 simulated forest experiments, Blind-Wayfarer achieved a 99.7% success rate. In real-world tests in two distinct scenarios -- with rover platforms of different sizes -- our approach successfully escaped forest entrapments in all 20 trials. Remarkably, our framework also enabled a robot to escape a dense woodland, traveling from 45 m inside the forest to a paved pathway at its edge. These findings highlight the potential of probing-based methods for reliable navigation in challenging perception-degraded field conditions. Videos and code are available on our website this https URL', 'abstract_zh': '自主机器人穿越茂密森林和崎岖地形的探索导航：当相机和LiDAR传感器在遮挡、低光照条件或传感器噪声下失效时尤为具有挑战性。基于迷宫求解算法的探查驱动导航框架Blind-Wayfarer及其应用研究', 'title_zh': 'Blind-Wayfarer: 一种针对感知降级环境的简约探查驱动鲁棒导航框架'}
{'arxiv_id': 'arXiv:2503.07423', 'title': 'Advances in Hybrid Modular Climbing Robots: Design Principles and Refinement Strategies', 'authors': 'Ryan Poon, Ian Hunter', 'link': 'https://arxiv.org/abs/2503.07423', 'abstract': "This paper explores the design strategies for hybrid pole- or trunk-climbing robots, focusing on methods to inform design decisions and assess metrics such as adaptability and performance. A wheeled-grasping hybrid robot with modular, tendon-driven grasping arms and a wheeled drive system mounted on a turret was developed to climb columns of varying diameters. Here, the key innovation is the underactuated arms that can be adjusted to different column sizes by adding or removing modular linkages, though the robot also features capabilities like self-locking (the ability of the robot to stay on the column by friction without power), autonomous grasping, and rotation around the column axis. Mathematical models describe conditions for self-locking and vertical climbing. Experimental results demonstrate the robot's efficacy in climbing and self-locking, validating the proposed models and highlighting the potential for fully automated solutions in industrial applications. This work provides a comprehensive framework for evaluating and designing hybrid climbing robots, contributing to advancements in autonomous robotics for environments where climbing tall structures is critical.", 'abstract_zh': '本文探讨了混合杆攀爬或树攀爬机器人设计策略，重点关注设计决策的指导方法和适应性、性能等评估指标。开发了一种具有模块化、肌腱驱动抓取臂和安装在转塔上的轮式驱动系统的轮式抓取混合机器人，以适应不同直径的柱子攀爬。关键创新在于欠驱动臂可通过增加或减少模块化链接来调整以适应不同柱子尺寸，尽管该机器人还具备自锁（通过摩擦力在无动力情况下保持在柱子上）、自主抓取和柱轴旋转等能力。数学模型描述了自锁和垂直攀爬的条件。实验结果证明了该机器人在攀爬和自锁方面的有效性，验证了所提出模型，并突显了在工业应用中实现完全自动化解决方案的潜力。本文提供了评估和设计混合攀爬机器人的全面框架，推动了在攀爬高大结构至关重要的环境中自主机器人技术的发展。', 'title_zh': '混合模块化攀爬机器人进展：设计原则与优化策略'}
{'arxiv_id': 'arXiv:2503.07321', 'title': 'A Decapod Robot with Rotary Bellows-Enclosed Soft Transmissions', 'authors': 'Yiming He, Yuchen Wang, Yunjia Zhang, Shuguang Li', 'link': 'https://arxiv.org/abs/2503.07321', 'abstract': "Soft crawling robots exhibit efficient locomotion across various terrains and demonstrate robustness to diverse environmental conditions. Here, we propose a valveless soft-legged robot that integrates a pair of rotary bellows-enclosed soft transmission systems (R-BESTS). The proposed R-BESTS can directly transmit the servo rotation into leg swing motion. A timing belt controls the pair of R-BESTS to maintain synchronous rotation in opposite phases, realizing alternating tripod gaits of walking and turning. We explored several designs to understand the role of a reinforcement skeleton in twisting the R-BESTS' input bellows units. The bending sequences of the robot legs are controlled through structural design for the output bellows units. Finally, we demonstrate untethered locomotion with the soft robotic decapod. Experimental results show that our robot can walk at 1.75 centimeters per second (0.07 body length per second) for 90 min, turn with a 15-centimeter (0.6 BL) radius, carry a payload of 200 g, and adapt to different terrains.", 'abstract_zh': '无阀软腿机器人结合了一对旋转椭囊封装的软传动系统（R-BESTS），展现了在多种地形上高效移动并具备对不同环境条件的鲁棒性。', 'title_zh': '一种配备旋转活塞式软传动的十足足机器人'}
{'arxiv_id': 'arXiv:2503.07278', 'title': 'Multi-Robot System for Cooperative Exploration in Unknown Environments: A Survey', 'authors': "Chuqi Wang, Chao Yu, Xin Xu, Yuman Gao, Xinyi Yang, Wenhao Tang, Shu'ang Yu, Yinuo Chen, Feng Gao, ZhuoZhu Jian, Xinlei Chen, Fei Gao, Boyu Zhou, Yu Wang", 'link': 'https://arxiv.org/abs/2503.07278', 'abstract': 'With the advancement of multi-robot technology, cooperative exploration tasks have garnered increasing attention. This paper presents a comprehensive review of multi-robot cooperative exploration systems. First, we review the evolution of robotic exploration and introduce a modular research framework tailored for multi-robot cooperative exploration. Based on this framework, we systematically categorize and summarize key system components. As a foundational module for multi-robot exploration, the localization and mapping module is primarily introduced by focusing on global and relative pose estimation, as well as multi-robot map merging techniques. The cooperative motion module is further divided into learning-based approaches and multi-stage planning, with the latter encompassing target generation, task allocation, and motion planning strategies. Given the communication constraints of real-world environments, we also analyze the communication module, emphasizing how robots exchange information within local communication ranges and under limited transmission capabilities. Finally, we discuss the challenges and future research directions for multi-robot cooperative exploration in light of real-world trends. This review aims to serve as a valuable reference for researchers and practitioners in the field.', 'abstract_zh': '随着多机器人技术的发展，协同探索任务受到了越来越多的关注。本文综述了多机器人协同探索系统。首先，我们回顾了机器人探索的发展，并介绍了一个适用于多机器人协同探索的模块化研究框架。基于这一框架，我们系统地分类和总结了关键系统组件。作为多机器人探索的基础模块，定位与建图模块主要介绍全球和相对位姿估计以及多机器人地图合并技术。协同运动模块进一步分为基于学习的方法和多阶段规划，后者包括目标生成、任务分配和运动规划策略。鉴于实际环境中的通信约束，我们还分析了通信模块，强调机器人在局部通信范围内以及在有限传输能力下的信息交换方式。最后，依据实际趋势，我们讨论了多机器人协同探索所面临的挑战及未来研究方向。本综述旨在为该领域的研究人员和实践者提供有价值的参考。', 'title_zh': '未知环境中的协同探索多机器人系统：一篇综述'}
{'arxiv_id': 'arXiv:2503.07245', 'title': 'WHERE-Bot: a Wheel-less Helical-ring Everting Robot Capable of Omnidirectional Locomotion', 'authors': 'Siyuan Feng, Dengfeng Yan, Jin Liu, Haotong Han, Alexandra Kühl, Shuguang Li', 'link': 'https://arxiv.org/abs/2503.07245', 'abstract': "Compared to conventional wheeled transportation systems designed for flat surfaces, soft robots exhibit exceptional adaptability to various terrains, enabling stable movement in complex environments. However, due to the risk of collision with obstacles and barriers, most soft robots rely on sensors for navigation in unstructured environments with uncertain boundaries. In this work, we present the WHERE-Bot, a wheel-less everting soft robot capable of omnidirectional locomotion. Our WHERE-Bot can navigate through unstructured environments by leveraging its structural and motion advantages rather than relying on sensors for boundary detection. By configuring a spring toy ``Slinky'' into a loop shape, the WHERE-Bot performs multiple rotational motions: spiral-rotating along the hub circumference, self-rotating around the hub's center, and orbiting around a certain point. The robot's trajectories can be reprogrammed by actively altering its mass distribution. The WHERE-Bot shows significant potential for boundary exploration in unstructured environments.", 'abstract_zh': '与设计用于平坦表面的传统轮式运输系统相比，软机器人在各种地形上展现出卓越的适应性，能够在复杂环境中实现稳定的运动。然而，由于存在与障碍物碰撞的风险，大多数软机器人依赖传感器在结构不确定的环境进行导航。在这种工作中，我们介绍了WHERE-Bot，一种无轮的反转软机器人，具备全向运动能力。WHERE-Bot能够通过利用其结构和运动优势来导航无结构环境，而无需依赖传感器进行边界检测。通过将“Slinky”弹簧玩具配置成环形，WHERE-Bot执行多种旋转运动：沿轴 circumference 螺旋旋转、围绕轴心自旋以及围绕某一点轨道运动。通过主动改变其质量分布，可以重新编程机器人的轨迹。WHERE-Bot在无结构环境中具有显著的边界探索潜力。', 'title_zh': 'WHERE-Bot：一种无轮全向移动蜗形推移机器人'}
{'arxiv_id': 'arXiv:2503.07192', 'title': 'Reactive and Safety-Aware Path Replanning for Collaborative Applications', 'authors': 'Cesare Tonola, Marco Faroni, Saeed Abdolshah, Mazin Hamad, Sami Haddadin, Nicola Pedrocchi, Manuel Beschi', 'link': 'https://arxiv.org/abs/2503.07192', 'abstract': "This paper addresses motion replanning in human-robot collaborative scenarios, emphasizing reactivity and safety-compliant efficiency. While existing human-aware motion planners are effective in structured environments, they often struggle with unpredictable human behavior, leading to safety measures that limit robot performance and throughput. In this study, we combine reactive path replanning and a safety-aware cost function, allowing the robot to adjust its path to changes in the human state. This solution reduces the execution time and the need for trajectory slowdowns without sacrificing safety. Simulations and real-world experiments show the method's effectiveness compared to standard human-robot cooperation approaches, with efficiency enhancements of up to 60\\%.", 'abstract_zh': '本文探讨了人在环机器人协作场景中的运动重规划问题，强调了反应性和安全合规的效率。虽然现有的考虑人类的运动规划器在结构化环境中有效，但在应对不可预测的人类行为时往往力不从心，导致安全措施限制了机器人的性能和 throughput。在本研究中，我们将反应性路径重规划和安全性感知的成本函数结合，使机器人能够根据人类状态的变化调整其路径。该解决方案减少了执行时间，并减少了轨迹减速的需求，同时不牺牲安全性。仿真和实际实验表明，与标准的人机协作方法相比，该方法在效率上提高了最多60%。', 'title_zh': '主动响应与安全意识导向的路径重规划方法及其应用'}
{'arxiv_id': 'arXiv:2503.07087', 'title': 'iManip: Skill-Incremental Learning for Robotic Manipulation', 'authors': 'Zexin Zheng, Jia-Feng Cai, Xiao-Ming Wu, Yi-Lin Wei, Yu-Ming Tang, Wei-Shi Zheng', 'link': 'https://arxiv.org/abs/2503.07087', 'abstract': 'The development of a generalist agent with adaptive multiple manipulation skills has been a long-standing goal in the robotics community. In this paper, we explore a crucial task, skill-incremental learning, in robotic manipulation, which is to endow the robots with the ability to learn new manipulation skills based on the previous learned knowledge without re-training. First, we build a skill-incremental environment based on the RLBench benchmark, and explore how traditional incremental methods perform in this setting. We find that they suffer from severe catastrophic forgetting due to the previous methods on classification overlooking the characteristics of temporality and action complexity in robotic manipulation tasks. Towards this end, we propose an incremental Manip}ulation framework, termed iManip, to mitigate the above issues. We firstly design a temporal replay strategy to maintain the integrity of old skills when learning new skill. Moreover, we propose the extendable PerceiverIO, consisting of an action prompt with extendable weight to adapt to new action primitives in new skill. Extensive experiments show that our framework performs well in Skill-Incremental Learning. Codes of the skill-incremental environment with our framework will be open-source.', 'abstract_zh': '通用机器人在适配性多技能学习下的发展一直是机器人研究领域的长期目标。本文探索了机器人操作中关键任务——技能增量学习，旨在使机器人能够在不重新训练的情况下，基于先前学习的知识来学习新的操作技能。首先，基于RLBench基准，构建了一个技能增量环境，并探讨了传统增量方法在这种环境中的表现。我们发现，由于传统方法在分类任务中忽略了机器人操作任务中的时间和动作复杂性特征，导致了严重的灾难性遗忘现象。为此，我们提出了一种增量操作框架iManip，以缓解上述问题。我们首先设计了一种时间回放策略，以在学习新技能时保持旧技能的完整性。此外，我们提出了可扩展的PerceiverIO，其中包括一个可扩展的动作提示，以便适应新技能中的新动作基元。广泛的实验表明，我们的框架在技能增量学习中表现良好。我们的框架下的技能增量环境代码将开源。', 'title_zh': 'iManip: 基于技能递增学习的机器人操作contri贡献力量。'}
{'arxiv_id': 'arXiv:2503.06922', 'title': 'Accelerated Quasi-Static FEM for Real-Time Modeling of Continuum Robots with Multiple Contacts and Large Deformation', 'authors': 'Hao Chen, Jian Chen, Xinran Liu, Zihui Zhang, Yuanrui Huang, Zhongkai Zhang, Hongbin Liu', 'link': 'https://arxiv.org/abs/2503.06922', 'abstract': 'Continuum robots offer high flexibility and multiple degrees of freedom, making them ideal for navigating narrow lumens. However, accurately modeling their behavior under large deformations and frequent environmental contacts remains challenging. Current methods for solving the deformation of these robots, such as the Model Order Reduction and Gauss-Seidel (GS) methods, suffer from significant drawbacks. They experience reduced computational speed as the number of contact points increases and struggle to balance speed with model accuracy. To overcome these limitations, we introduce a novel finite element method (FEM) named Acc-FEM. Acc-FEM employs a large deformation quasi-static finite element model and integrates an accelerated solver scheme to handle multi-contact simulations efficiently. Additionally, it utilizes parallel computing with Graphics Processing Units (GPU) for real-time updates of the finite element models and collision detection. Extensive numerical experiments demonstrate that Acc-FEM significantly improves computational efficiency in modeling continuum robots with multiple contacts while achieving satisfactory accuracy, addressing the deficiencies of existing methods.', 'abstract_zh': '连续体机器人提供了高灵活性和多自由度，使其特别适用于狭窄管道的导航。然而，准确 modeling 其在大变形和频繁环境接触情况下的行为仍然是具有挑战性的。当前用于解决这些机器人变形的方法，如模型降阶和高斯-赛德尔方法，存在显著的缺点。它们会随着接触点数量的增加而计算速度显著下降，并且难以在速度和模型精度之间取得平衡。为克服这些局限性，我们提出了一个新的有限元方法（FEM）——Acc-FEM。Acc-FEM 利用大变形准静态有限元模型，并结合了加速求解方案来高效处理多接触仿真。此外，它利用图形处理单元（GPU）进行并行计算，以实现实时有限元模型更新和碰撞检测。大量数值实验表明，Acc-FEM 在建模具有多个接触点的连续体机器人时显著提高了计算效率，同时实现了满意的精度，解决了现有方法的缺陷。', 'title_zh': '加速准静态有限元法在多重接触与大变形下实时建模连续体机器人'}
{'arxiv_id': 'arXiv:2503.06891', 'title': 'AKF-LIO: LiDAR-Inertial Odometry with Gaussian Map by Adaptive Kalman Filter', 'authors': 'Xupeng Xie, Ruoyu Geng, Jun Ma, Boyu Zhou', 'link': 'https://arxiv.org/abs/2503.06891', 'abstract': 'Existing LiDAR-Inertial Odometry (LIO) systems typically use sensor-specific or environment-dependent measurement covariances during state estimation, leading to laborious parameter tuning and suboptimal performance in challenging conditions (e.g., sensor degeneracy and noisy observations). Therefore, we propose an Adaptive Kalman Filter (AKF) framework that dynamically estimates time-varying noise covariances of LiDAR and Inertial Measurement Unit (IMU) measurements, enabling context-aware confidence weighting between sensors. During LiDAR degeneracy, the system prioritizes IMU data while suppressing contributions from unreliable inputs like moving objects or noisy point clouds. Furthermore, a compact Gaussian-based map representation is introduced to model environmental planarity and spatial noise. A correlated registration strategy ensures accurate plane normal estimation via pseudo-merge, even in unstructured environments like forests. Extensive experiments validate the robustness of the proposed system across diverse environments, including dynamic scenes and geometrically degraded scenarios. Our method achieves reliable localization results across all MARS-LVIG sequences and ranks 8th on the KITTI Odometry Benchmark. The code will be released at this https URL.', 'abstract_zh': '现有的激光雷达-惯性里程计（LIO）系统通常在状态估计过程中使用特定于传感器或环境依赖性的测量协方差，导致繁琐的参数调整并在具有挑战性的情况下（例如传感器退化和观测噪声）表现出非最优性能。因此，我们提出了一种自适应卡尔曼滤波器（AKF）框架，该框架动态估计激光雷达和惯性测量单元（IMU）测量的时间变化噪声协方差，使传感器之间的信心加权具有上下文感知能力。在激光雷达退化期间，系统优先采用IMU数据，抑制来自不可靠输入（如移动物体或噪声点云）的贡献。此外，引入了一种紧凑的基于高斯的映射表示法来建模环境的平面性和空间噪声。通过伪合并的协同注册策略即使在未结构化的环境中（如森林）也能确保准确的平面法线估计。广泛的实验验证了所提出系统的鲁棒性，覆盖了各种环境，包括动态场景和几何降级的情况。我们的方法在所有MARS-LVIG序列中实现了可靠的定位结果，并在KITTI里程计基准测试中排名第8。代码将在此处发布：https://xxxxx。', 'title_zh': 'AKF-LIO：基于自适应卡尔曼滤波的激光雷达-惯性里程计'}
{'arxiv_id': 'arXiv:2503.06890', 'title': 'AirSwarm: Enabling Cost-Effective Multi-UAV Research with COTS drones', 'authors': 'Xiaowei Li, Kuan Xu, Fen Liu, Ruofei Bai, Shenghai Yuan, Lihua Xie', 'link': 'https://arxiv.org/abs/2503.06890', 'abstract': 'Traditional unmanned aerial vehicle (UAV) swarm missions rely heavily on expensive custom-made drones with onboard perception or external positioning systems, limiting their widespread adoption in research and education. To address this issue, we propose AirSwarm. AirSwarm democratizes multi-drone coordination using low-cost commercially available drones such as Tello or Anafi, enabling affordable swarm aerial robotics research and education. Key innovations include a hierarchical control architecture for reliable multi-UAV coordination, an infrastructure-free visual SLAM system for precise localization without external motion capture, and a ROS-based software framework for simplified swarm development. Experiments demonstrate cm-level tracking accuracy, low-latency control, communication failure resistance, formation flight, and trajectory tracking. By reducing financial and technical barriers, AirSwarm makes multi-robot education and research more accessible. The complete instructions and open source code will be available at', 'abstract_zh': '传统的无人机集群任务高度依赖昂贵的定制无人机或外部定位系统，限制了其在研究和教育中的广泛应用。为了解决这一问题，我们提出了AirSwarm。AirSwarm利用低成本的商用无人机（如Tello或Anafi）实现多无人机协调的民主化，从而促进可负担的集群空中机器人研究和教育。关键创新包括用于可靠多无人机协同的分层控制架构、无需外部动作捕捉的基础设施免费视觉SLAM系统以及基于ROS的软件框架以简化集群开发。实验展示了厘米级追踪精度、低延迟控制、通信故障冗余、编队飞行和轨迹跟踪。通过降低财务和技术障碍，AirSwarm使多机器人教育和研究更加普及。完整的使用说明和开源代码将在。', 'title_zh': 'AirSwarm: 使多无人机研究成本有效的商用现货无人机平台'}
{'arxiv_id': 'arXiv:2503.06869', 'title': 'Collective Behavior Clone with Visual Attention via Neural Interaction Graph Prediction', 'authors': 'Kai Li, Zhao Ma, Liang Li, Shiyu Zhao', 'link': 'https://arxiv.org/abs/2503.06869', 'abstract': 'In this paper, we propose a framework, collective behavioral cloning (CBC), to learn the underlying interaction mechanism and control policy of a swarm system. Given the trajectory data of a swarm system, we propose a graph variational autoencoder (GVAE) to learn the local interaction graph. Based on the interaction graph and swarm trajectory, we use behavioral cloning to learn the control policy of the swarm system. To demonstrate the practicality of CBC, we deploy it on a real-world decentralized vision-based robot swarm system. A visual attention network is trained based on the learned interaction graph for online neighbor selection. Experimental results show that our method outperforms previous approaches in predicting both the interaction graph and swarm actions with higher accuracy. This work offers a promising approach for understanding interaction mechanisms and swarm dynamics in future swarm robotics research. Code and data are available.', 'abstract_zh': '本文提出了一种框架，集体行为克隆(CBC)，用于学习群体系统中的潜在交互机制和控制策略。_given_群体系统的轨迹数据，我们提出了一种图变分自编码器(GVAE)来学习局部交互图。基于交互图和群体轨迹，我们使用行为克隆来学习群体系统的控制策略。为了展示CBC的实际应用价值，我们在一个实际的去中心化视觉机器人群体系统中部署了该框架。基于学习到的交互图训练了一个视觉注意力网络，用于在线邻居选择。实验结果表明，我们的方法在预测交互图和群体动作方面比先前的方法具有更高的准确性。本工作为未来群体机器人研究中理解交互机制和群体动力学提供了有前景的方法。代码和数据已公开。', 'title_zh': '基于神经交互图预测的视觉注意力集体行为克隆'}
{'arxiv_id': 'arXiv:2503.06848', 'title': 'Eye-in-Finger: Smart Fingers for Delicate Assembly and Disassembly of LEGO', 'authors': 'Zhenran Tang, Ruixuan Liu, Changliu Liu', 'link': 'https://arxiv.org/abs/2503.06848', 'abstract': 'Manipulation and insertion of small and tight-toleranced objects in robotic assembly remain a critical challenge for vision-based robotics systems due to the required precision and cluttered environment. Conventional global or wrist-mounted cameras often suffer from occlusions when either assembling or disassembling from an existing structure. To address the challenge, this paper introduces "Eye-in-Finger", a novel tool design approach that enhances robotic manipulation by embedding low-cost, high-resolution perception directly at the tool tip. We validate our approach using LEGO assembly and disassembly tasks, which require the robot to manipulate in a cluttered environment and achieve sub-millimeter accuracy and robust error correction due to the tight tolerances. Experimental results demonstrate that our proposed system enables real-time, fine corrections to alignment error, increasing the tolerance of calibration error from 0.4mm to up to 2.0mm for the LEGO manipulation robot.', 'abstract_zh': '基于视觉的机器人系统中，小尺寸且公差严格的物体操作与插入仍然是一个关键挑战，由于所需的精确度和复杂的环境背景。传统的全局或腕部摄像头在组装或拆卸现有结构时常常受到遮挡。为应对这一挑战，本文提出了“指尖摄像头”这一新颖的工具设计方法，通过在工具尖端嵌入低成本的高分辨率感知系统来提升机器人操作的精度。我们利用LEGO组装和拆卸任务进行了验证，这些任务要求机器人在复杂环境中操作，并达到亚毫米级的精度和稳健的误差校正，以适应严格的公差要求。实验结果表明，我们提出的方法能够实现实时、精细的对准误差校正，将LEGO操作机器人的校准误差容忍度从0.4mm提高到2.0mm。', 'title_zh': 'Eye-in-Finger: 智能手指用于LEGO的精细装配与拆卸'}
{'arxiv_id': 'arXiv:2503.06844', 'title': 'A2I-Calib: An Anti-noise Active Multi-IMU Spatial-temporal Calibration Framework for Legged Robots', 'authors': 'Chaoran Xiong, Fangyu Jiang, Kehui Ma, Zhen Sun, Zeyu Zhang, Ling Pei', 'link': 'https://arxiv.org/abs/2503.06844', 'abstract': 'Recently, multi-node inertial measurement unit (IMU)-based odometry for legged robots has gained attention due to its cost-effectiveness, power efficiency, and high accuracy. However, the spatial and temporal misalignment between foot-end motion derived from forward kinematics and foot IMU measurements can introduce inconsistent constraints, resulting in odometry drift. Therefore, accurate spatial-temporal calibration is crucial for the multi-IMU systems. Although existing multi-IMU calibration methods have addressed passive single-rigid-body sensor calibration, they are inadequate for legged systems. This is due to the insufficient excitation from traditional gaits for calibration, and enlarged sensitivity to IMU noise during kinematic chain transformations. To address these challenges, we propose A$^2$I-Calib, an anti-noise active multi-IMU calibration framework enabling autonomous spatial-temporal calibration for arbitrary foot-mounted IMUs. Our A$^2$I-Calib includes: 1) an anti-noise trajectory generator leveraging a proposed basis function selection theorem to minimize the condition number in correlation analysis, thus reducing noise sensitivity, and 2) a reinforcement learning (RL)-based controller that ensures robust execution of calibration motions. Furthermore, A$^2$I-Calib is validated on simulation and real-world quadruped robot platforms with various multi-IMU settings, which demonstrates a significant reduction in noise sensitivity and calibration errors, thereby improving the overall multi-IMU odometry performance.', 'abstract_zh': 'Anti-Noise Active Multi-IMU Calibration Framework for Legged Robots', 'title_zh': 'A2I-Calib: 一种抗噪声主动多IMU时空校准框架用于 legged 机器人'}
{'arxiv_id': 'arXiv:2503.06802', 'title': 'A Physically Consistent Stiffness Formulation for Contact-Rich Manipulation', 'authors': 'Johannes Lachner, Moses C. Nah, Neville Hogan', 'link': 'https://arxiv.org/abs/2503.06802', 'abstract': 'Ensuring symmetric stiffness in impedance-controlled robots is crucial for physically meaningful and stable interaction in contact-rich manipulation. Conventional approaches neglect the change of basis vectors in curved spaces, leading to an asymmetric joint-space stiffness matrix that violates passivity and conservation principles. In this work, we derive a physically consistent, symmetric joint-space stiffness formulation directly from the task-space stiffness matrix by explicitly incorporating Christoffel symbols. This correction resolves long-standing inconsistencies in stiffness modeling, ensuring energy conservation and stability. We validate our approach experimentally on a robotic system, demonstrating that omitting these correction terms results in significant asymmetric stiffness errors. Our findings bridge theoretical insights with practical control applications, offering a robust framework for stable and interpretable robotic interactions.', 'abstract_zh': '确保 impedance 控制机器人中的对称刚度对于接触丰富操作中的物理意义和稳定交互至关重要。传统的方法忽略了曲空间中基向量的变化，导致关节空间刚度矩阵不对称，违背了主动性和守恒原理。在本项工作中，我们直接从任务空间刚度矩阵出发，通过明确引入克里斯托夫符号推导出一个物理上一致的、对称的关节空间刚度公式。这一修正解决了刚度建模中长期存在的不一致性问题，确保能量守恒和稳定性。我们在一个机器人系统上进行了实验验证，证明忽略这些修正项会导致显著的不对称刚度误差。我们的研究将理论洞察与实际控制应用相结合，提供了一个稳定且可解释的机器人交互的稳健框架。', 'title_zh': '接触丰富操作的物理一致刚度公式化'}
{'arxiv_id': 'arXiv:2503.06795', 'title': 'Robotic Ultrasound-Guided Femoral Artery Reconstruction of Anatomically-Representative Phantoms', 'authors': 'Lidia Al-Zogbi, Deepak Raina, Vinciya Pandian, Thorsten Fleiter, Axel Krieger', 'link': 'https://arxiv.org/abs/2503.06795', 'abstract': 'Femoral artery access is essential for numerous clinical procedures, including diagnostic angiography, therapeutic catheterization, and emergency interventions. Despite its critical role, successful vascular access remains challenging due to anatomical variability, overlying adipose tissue, and the need for precise ultrasound (US) guidance. Errors in needle placement can lead to severe complications, restricting the procedure to highly skilled clinicians in controlled hospital settings. While robotic systems have shown promise in addressing these challenges through autonomous scanning and vessel reconstruction, clinical translation remains limited due to reliance on simplified phantom models that fail to capture human anatomical complexity. In this work, we present a method for autonomous robotic US scanning of bifurcated femoral arteries, and validate it on five vascular phantoms created from real patient computed tomography (CT) data. Additionally, we introduce a video-based deep learning US segmentation network tailored for vascular imaging, enabling improved 3D arterial reconstruction. The proposed network achieves a Dice score of 89.21% and an Intersection over Union of 80.54% on a newly developed vascular dataset. The quality of the reconstructed artery centerline is evaluated against ground truth CT data, demonstrating an average L2 deviation of 0.91+/-0.70 mm, with an average Hausdorff distance of 4.36+/-1.11mm. This study is the first to validate an autonomous robotic system for US scanning of the femoral artery on a diverse set of patient-specific phantoms, introducing a more advanced framework for evaluating robotic performance in vascular imaging and intervention.', 'abstract_zh': '自主机器人超声扫描在分叉股动脉成像中的应用及其在真实患者CT数据构建的人体模体上的验证', 'title_zh': '基于解剖学代表性的 Phantom 的机器人超声引导股动脉重建研究'}
{'arxiv_id': 'arXiv:2503.06736', 'title': 'Safe, Task-Consistent Manipulation with Operational Space Control Barrier Functions', 'authors': 'Daniel Morton, Marco Pavone', 'link': 'https://arxiv.org/abs/2503.06736', 'abstract': 'Safe real-time control of robotic manipulators in unstructured environments requires handling numerous safety constraints without compromising task performance. Traditional approaches, such as artificial potential fields (APFs), suffer from local minima, oscillations, and limited scalability, while model predictive control (MPC) can be computationally expensive. Control barrier functions (CBFs) offer a promising alternative due to their high level of robustness and low computational cost, but these safety filters must be carefully designed to avoid significant reductions in the overall performance of the manipulator. In this work, we introduce an Operational Space Control Barrier Function (OSCBF) framework that integrates safety constraints while preserving task-consistent behavior. Our approach scales to hundreds of simultaneous constraints while retaining real-time control rates, ensuring collision avoidance, singularity prevention, and workspace containment even in highly cluttered and dynamic settings. By explicitly accounting for the task hierarchy in the CBF objective, we prevent degraded performance across both joint-space and operational-space tasks, when at the limit of safety. Our open-source, high-performance software will be available at our project webpage, this https URL', 'abstract_zh': 'Safe实时控制机器人 manipulators 在未结构化环境中的稳健实现要求处理大量安全约束同时不牺牲任务性能。传统的方法，如人工势场法（APFs），存在局部极小值、振荡和计算效率有限的问题，而模型预测控制（MPC）则计算成本较高。控制屏障函数（CBFs）因其高度的鲁棒性和较低的计算成本提供了有前景的替代方案，但这些安全过滤器必须精心设计以避免显著降低 manipulator 的整体性能。在此工作中，我们提出了一个操作空间控制屏障函数（OSCBF）框架，该框架在保留任务一致性行为的同时整合了安全约束。我们的方法可以扩展到数百个同时约束，同时保持实时控制速率，确保即使在高度拥挤和动态设置下也能实现防碰撞、防奇异性和工作空间限制。通过明确考虑到CBF目标中的任务层次结构，我们防止了在安全极限下关节空间和操作空间任务的性能退化。我们的开源高性能软件将在我们的项目网页上提供，此链接为：此httpsURL。', 'title_zh': '基于操作空间控制屏障函数的安全且任务一致的操作Manipulation'}
{'arxiv_id': 'arXiv:2503.06578', 'title': 'Non-Equilibrium MAV-Capture-MAV via Time-Optimal Planning and Reinforcement Learning', 'authors': 'Canlun Zheng, Zhanyu Guo, Zikang Yin, Chunyu Wang, Zhikun Wang, Shiyu Zhao', 'link': 'https://arxiv.org/abs/2503.06578', 'abstract': 'The capture of flying MAVs (micro aerial vehicles) has garnered increasing research attention due to its intriguing challenges and promising applications. Despite recent advancements, a key limitation of existing work is that capture strategies are often relatively simple and constrained by platform performance. This paper addresses control strategies capable of capturing high-maneuverability targets. The unique challenge of achieving target capture under unstable conditions distinguishes this task from traditional pursuit-evasion and guidance problems. In this study, we transition from larger MAV platforms to a specially designed, compact capture MAV equipped with a custom launching device while maintaining high maneuverability. We explore both time-optimal planning (TOP) and reinforcement learning (RL) methods. Simulations demonstrate that TOP offers highly maneuverable and shorter trajectories, while RL excels in real-time adaptability and stability. Moreover, the RL method has been tested in real-world scenarios, successfully achieving target capture even in unstable states.', 'abstract_zh': '基于高机动目标捕获的飞行微小型无人机控制策略研究', 'title_zh': '非平衡 MAV 抓取 MAV 的时间最优计划与强化学习'}
{'arxiv_id': 'arXiv:2503.06516', 'title': 'Abdominal Undulation with Compliant Mechanism Improves Flight Performance of Biomimetic Robotic Butterfly', 'authors': 'Xuyi Lian, Mingyu Luo, Te Lin, Chen Qian, Tiefeng Li', 'link': 'https://arxiv.org/abs/2503.06516', 'abstract': 'Abdominal Undulation with Compliant Mechanism Improves Flight Performance of Biomimetic Robotic ButterflThis paper presents the design, modeling, and experimental validation of a biomimetic robotic butterfly (BRB) that integrates a compliant mechanism to achieve coupled wing-abdomen motion. Drawing inspiration from the natural f light dynamics of butterflies, a theoretical model is developed to investigate the impact of abdominal undulation on flight performance. To validate the model, motion capture experi ments are conducted on three configurations: a BRB without an abdomen, with a fixed abdomen, and with an undulating abdomen. The results demonstrate that abdominal undulation enhances lift generation, extends flight duration, and stabilizes pitch oscillations, thereby improving overall flight performance. These findings underscore the significance of wing-abdomen interaction in flapping-wing aerial vehicles (FWAVs) and lay the groundwork for future advancements in energy-efficient biomimetic flight designs.', 'abstract_zh': '模仿腹动机制的腹部摆动提高仿生机器人蝴蝶飞行性能', 'title_zh': '具有 compliant 机制的腹部波动提高仿生蝴蝶机器人飞行性能'}
{'arxiv_id': 'arXiv:2503.06412', 'title': 'Vision-Based Cooperative MAV-Capturing-MAV', 'authors': 'Canlun Zheng, Yize Mi, Hanqing Guo, Huaben Chen, Shiyu Zhao', 'link': 'https://arxiv.org/abs/2503.06412', 'abstract': 'MAV-capturing-MAV (MCM) is one of the few effective methods for physically countering misused or malicious this http URL paper presents a vision-based cooperative MCM system, where multiple pursuer MAVs equipped with onboard vision systems detect, localize, and pursue a target MAV. To enhance robustness, a distributed state estimation and control framework enables the pursuer MAVs to autonomously coordinate their actions. Pursuer trajectories are optimized using Model Predictive Control (MPC) and executed via a low-level SO(3) controller, ensuring smooth and stable pursuit. Once the capture conditions are satisfied, the pursuer MAVs automatically deploy a flying net to intercept the target. These capture conditions are determined based on the predicted motion of the net. To enable real-time decision-making, we propose a lightweight computational method to approximate the net motion, avoiding the prohibitive cost of solving the full net dynamics. The effectiveness of the proposed system is validated through simulations and real-world experiments. In real-world tests, our approach successfully captures a moving target traveling at 4 meters per second with an acceleration of 1 meter per square second, achieving a success rate of 64.7 percent.', 'abstract_zh': '基于视觉的多旋翼捕获系统：自主协调的 MAV-capturing-MAV (MCM) 方法', 'title_zh': '基于视觉的合作MAV-捕获MAV'}
{'arxiv_id': 'arXiv:2503.06402', 'title': 'Reduced-Order Model-Based Gait Generation for Snake Robot Locomotion using NMPC', 'authors': 'Adarsh Salagame, Eric Sihite, Milad Ramezani, Alireza Ramezani', 'link': 'https://arxiv.org/abs/2503.06402', 'abstract': "This paper presents an optimization-based motion planning methodology for snake robots operating in constrained environments. By using a reduced-order model, the proposed approach simplifies the planning process, enabling the optimizer to autonomously generate gaits while constraining the robot's footprint within tight spaces. The method is validated through high-fidelity simulations that accurately model contact dynamics and the robot's motion. Key locomotion strategies are identified and further demonstrated through hardware experiments, including successful navigation through narrow corridors.", 'abstract_zh': '基于优化的蛇形机器人在受限环境中的运动规划方法', 'title_zh': '基于降阶模型的蛇形机器人运动规划的NMPC步态生成'}
{'arxiv_id': 'arXiv:2503.05953', 'title': 'Differentiable Rendering-based Pose Estimation for Surgical Robotic Instruments', 'authors': 'Zekai Liang, Zih-Yun Chiu, Florian Richter, Michael C. Yip', 'link': 'https://arxiv.org/abs/2503.05953', 'abstract': 'Robot pose estimation is a challenging and crucial task for vision-based surgical robotic automation. Typical robotic calibration approaches, however, are not applicable to surgical robots, such as the da Vinci Research Kit (dVRK), due to joint angle measurement errors from cable-drives and the partially visible kinematic chain. Hence, previous works in surgical robotic automation used tracking algorithms to estimate the pose of the surgical tool in real-time and compensate for the joint angle errors. However, a big limitation of these previous tracking works is the initialization step which relied on only keypoints and SolvePnP. In this work, we fully explore the potential of geometric primitives beyond just keypoints with differentiable rendering, cylinders, and construct a versatile pose matching pipeline in a novel pose hypothesis space. We demonstrate the state-of-the-art performance of our single-shot calibration method with both calibration consistency and real surgical tasks. As a result, this marker-less calibration approach proves to be a robust and generalizable initialization step for surgical tool tracking.', 'abstract_zh': '基于视觉的手术机器人自动化中的机器人姿态估计是具有挑战性和关键性的任务。然而，传统的一些机器人标定方法不适用于如da Vinci Research Kit (dVRK)这样的手术机器人，这主要是由于电缆驱动产生的关节角度测量误差以及部分可见的运动链。因此，手术机器人自动化领域的先前工作使用跟踪算法实时估计手术工具的姿态并补偿关节角度误差。然而，这些先前跟踪工作的主要限制在于其初始化步骤，该步骤仅依赖关键点和SolvePnP。在本工作中，我们利用可微渲染和圆柱体等几何原语，全面探索了超越关键点的潜力，并构建了一个全新的姿态假设空间中的多功能姿态匹配管道。我们展示了我们的单次校准方法在校准一致性和实际手术任务中的先进性能。由此，此无标记校准方法证明是一种稳健且通用的初始化步骤，适用于手术工具跟踪。', 'title_zh': '基于可微渲染的姿态估计方法在手术机器人器械中的应用'}
{'arxiv_id': 'arXiv:2503.05904', 'title': 'REACT: Multi Robot Energy-Aware Orchestrator for Indoor Search and Rescue Critical Tasks', 'authors': 'Fabio Maresca, Arnau Romero, Carmen Delgado, Vincenzo Sciancalepore, Josep Paradells, Xavier Costa-Pérez', 'link': 'https://arxiv.org/abs/2503.05904', 'abstract': 'Smart factories enhance production efficiency and sustainability, but emergencies like human errors, machinery failures and natural disasters pose significant risks. In critical situations, such as fires or earthquakes, collaborative robots can assist first-responders by entering damaged buildings and locating missing persons, mitigating potential losses. Unlike previous solutions that overlook the critical aspect of energy management, in this paper we propose REACT, a smart energy-aware orchestrator that optimizes the exploration phase, ensuring prolonged operational time and effective area coverage. Our solution leverages a fleet of collaborative robots equipped with advanced sensors and communication capabilities to explore and navigate unknown indoor environments, such as smart factories affected by fires or earthquakes, with high density of obstacles. By leveraging real-time data exchange and cooperative algorithms, the robots dynamically adjust their paths, minimize redundant movements and reduce energy consumption. Extensive simulations confirm that our approach significantly improves the efficiency and reliability of search and rescue missions in complex indoor environments, improving the exploration rate by 10% over existing methods and reaching a map coverage of 97% under time critical operations, up to nearly 100% under relaxed time constraint.', 'abstract_zh': '智能工厂提高生产效率和可持续性，但人类错误、机械设备故障和自然灾害等突发事件会带来重大风险。在火灾或地震等关键时刻，协作机器人可以通过进入受损建筑并定位失踪人员，减轻潜在损失。有别于以往忽视能源管理关键因素的解决方案，本文提出REACT，一种智能能源感知调度器，优化探索阶段，确保延长操作时间和有效覆盖范围。该解决方案利用配备先进传感器和通信能力的协作机器人队列，高效探索和导航复杂障碍物环境，如受火灾或地震影响的智能工厂。通过实时数据交换和协作算法，机器人动态调整路径，减少冗余运动并降低能耗。广泛模拟证实，本方法显著提高了复杂室内环境中搜索和救援任务的效率和可靠性，探索率较现有方法提高10%，在时间紧迫操作下达到97%的地图覆盖率，在较宽松时间约束下接近100%。', 'title_zh': 'REACT：多机器人室内搜索救援关键任务能量感知调度器'}
{'arxiv_id': 'arXiv:2503.05853', 'title': 'Enhancing Thin-Film Wafer Inspection With A Multi-Sensor Array And Robot Constraint Maintenance', 'authors': 'Néstor Eduardo Sánchez-Arriaga, Ethan Canzini, Nathan John Espley-Plumb, Michael Farnsworth, Simon Pope, Adrian Leyland, Ashutosh Tiwari', 'link': 'https://arxiv.org/abs/2503.05853', 'abstract': 'Thin-film inspection on large-area substrates in coating manufacture remains a critical parameter to ensure product quality; however, extending the inspection process precisely over a large area presents major challenges, due to the limitations of the available inspection equipment. An additional manipulation problem arises when automating the inspection process, as the silicon wafer requires movement constraints to ensure accurate measurements and to prevent damage. Furthermore, there are other increasingly important large-area industrial applications, such as Roll-to-Roll (R2R) manufacturing where coating thickness inspection introduces additional challenges. This paper presents an autonomous inspection system using a robotic manipulator with a novel learned constraint manifold to control a wafer to its calibration point, and a novel multi-sensor array with high potential for scalability into large substrate areas. We demonstrate that the manipulator can perform required motions whilst adhering to movement constraints. We further demonstrate that the sensor array can perform thickness measurements statically with an error of $<2\\%$ compared to a commercial reflectometer, and through the use of a manipulator can dynamically detect angle variations $>0.5^\\circ$ from the calibration point whilst monitoring the RMSE and $R^2$ over 1406 data points. These features are potentially useful for detecting displacement variations in R2R manufacturing processes.', 'abstract_zh': '基于机器人操作器的新型约束流形自主检测系统在大面积基底上的薄膜厚度检测', 'title_zh': '增强薄片晶圆检测的多传感器阵列与机器人约束维护'}
{'arxiv_id': 'arXiv:2503.05848', 'title': 'Merry-Go-Round: Safe Control of Decentralized Multi-Robot Systems with Deadlock Prevention', 'authors': 'Wonjong Lee, Joonyeol Sim, Joonkyung Kim, Siwon Jo, Wenhao Luo, Changjoo Nam', 'link': 'https://arxiv.org/abs/2503.05848', 'abstract': 'We propose a hybrid approach for decentralized multi-robot navigation that ensures both safety and deadlock prevention. Building on a standard control formulation, we add a lightweight deadlock prevention mechanism by forming temporary "roundabouts" (circular reference paths). Each robot relies only on local, peer-to-peer communication and a controller for base collision avoidance; a roundabout is generated or joined on demand to avert deadlocks. Robots in the roundabout travel in one direction until an escape condition is met, allowing them to return to goal-oriented motion. Unlike classical decentralized methods that lack explicit deadlock resolution, our roundabout maneuver ensures system-wide forward progress while preserving safety constraints. Extensive simulations and physical robot experiments show that our method consistently outperforms or matches the success and arrival rates of other decentralized control approaches, particularly in cluttered or high-density scenarios, all with minimal centralized coordination.', 'abstract_zh': '基于安全性与死锁预防的分布式多机器人导航混合方法', 'title_zh': '旋转木马：具备死锁预防的分布式多机器人系统安全控制'}
{'arxiv_id': 'arXiv:2503.05817', 'title': 'GraphGarment: Learning Garment Dynamics for Bimanual Cloth Manipulation Tasks', 'authors': 'Wei Chen, Kelin Li, Dongmyoung Lee, Xiaoshuai Chen, Rui Zong, Petar Kormushev', 'link': 'https://arxiv.org/abs/2503.05817', 'abstract': 'Physical manipulation of garments is often crucial when performing fabric-related tasks, such as hanging garments. However, due to the deformable nature of fabrics, these operations remain a significant challenge for robots in household, healthcare, and industrial environments. In this paper, we propose GraphGarment, a novel approach that models garment dynamics based on robot control inputs and applies the learned dynamics model to facilitate garment manipulation tasks such as hanging. Specifically, we use graphs to represent the interactions between the robot end-effector and the garment. GraphGarment uses a graph neural network (GNN) to learn a dynamics model that can predict the next garment state given the current state and input action in simulation. To address the substantial sim-to-real gap, we propose a residual model that compensates for garment state prediction errors, thereby improving real-world this http URL garment dynamics model is then applied to a model-based action sampling strategy, where it is utilized to manipulate the garment to a reference pre-hanging configuration for garment-hanging tasks. We conducted four experiments using six types of garments to validate our approach in both simulation and real-world settings. In simulation experiments, GraphGarment achieves better garment state prediction performance, with a prediction error 0.46 cm lower than the best this http URL approach also demonstrates improved performance in the garment-hanging simulation experiment with enhancements of 12%, 24%, and 10%, respectively. Moreover, real-world robot experiments confirm the robustness of sim-to-real transfer, with an error increase of 0.17 cm compared to simulation results. Supplementary material is available at:this https URL.', 'abstract_zh': '基于图的衣物动力学建模与现实转移方法：衣物悬挂任务中的物理操作', 'title_zh': 'GraphGarment: 学习双手法布操作中的服装动力学'}
{'arxiv_id': 'arXiv:2503.05835', 'title': 'A Novel Control Strategy for Offset Points Tracking in the Context of Agricultural Robotics', 'authors': 'Stephane Ngnepiepaye Wembe, Vincent Rousseau, Johann Laconte, Roland Lenain', 'link': 'https://arxiv.org/abs/2503.05835', 'abstract': "In this paper, we present a novel method to control a rigidly connected location on the vehicle, such as a point on the implement in case of agricultural tasks. Agricultural robots are transforming modern farming by enabling precise and efficient operations, replacing humans in arduous tasks while reducing the use of chemicals. Traditionnaly, path_following algorithms are designed to guide the vehicle's center along a predefined trajetory. However, since the actual agronomic task is performed by the implement, it is essential to control a specific point on the implement itself rather than vehicle's center. As such, we present in this paper two approaches for achieving the control of an offset point on the robot. The first approach adapts existing control laws, initially inteded for rear axle's midpoint, to manage the desired lateral deviation. The second approach employs backstepping control techniques to create a control law that directly targets the implement. We conduct real-world experiments, highlighting the limitations of traditional approaches for offset points control, and demonstrating the strengths and weaknesses of the proposed methods.", 'abstract_zh': '本文提出了一种新颖的方法来控制车辆上刚性连接的位置，例如农业任务中实施装置上的特定点。农业机器人通过实现精确和高效的操作，正在改变现代农业，替代人类完成艰苦的任务，同时减少化学物质的使用。传统地，路径跟随算法设计用于沿预定义轨迹引导车辆的中心。然而，由于实际的农艺任务是由实施装置执行的，因此控制实施装置本身上的特定点而不是车辆的中心是必不可少的。因此，本文提出了两种方法来控制机器人上的偏移点。第一种方法是将现有的初衷用于后轴中点的控制律进行调整，以管理所需的横向偏差。第二种方法采用回步控制技术来创建直接针对实施装置的控制律。我们进行了实地试验，指出了传统方法对于偏移点控制的局限性，并展示了所提出的控制方法的优势和不足。', 'title_zh': '农业机器人环境中偏移点跟踪的新型控制策略'}
{'arxiv_id': 'arXiv:2503.05791', 'title': 'Collaborative Drill Alignment in Surgical Robotics', 'authors': 'Daniel Larby, Joshua Kershaw, Matthew Allen, Fulvio Forni', 'link': 'https://arxiv.org/abs/2503.05791', 'abstract': "Robotic assistance allows surgeries to be reliably and accurately executed while still under direct supervision of the surgeon, combining the strengths of robotic technology with the surgeon's expertise. This paper describes a robotic system designed to assist in surgical procedures by implementing a virtual drill guide. The system integrates virtual-fixture functionality using a novel virtual-mechanism controller with additional visual feedback. The controller constrains the tool to the desired axis, while allowing axial motion to remain under the surgeon's control. Compared to prior virtual-fixture approaches -- which primarily perform pure energy-shaping and damping injection with linear springs and dampers -- our controller uses a virtual prismatic joint to which the robot is constrained by nonlinear springs, allowing us to easily shape the dynamics of the system. We detail the calibration procedures required to achieve sufficient precision, and describe the implementation of the controller. We apply this system to a veterinary procedure: drilling for transcondylar screw placement in dogs. The results of the trials on 3D-printed bone models demonstrate sufficient precision to perform the procedure and suggest improved angular accuracy and reduced exit translation errors compared to patient specific guides (PSG). Discussion and future improvements follow.", 'abstract_zh': '机器人辅助使手术在外科医生直接监督下可靠且准确地执行，结合了机器人技术的优势和外科医生的专业知识。本文描述了一种旨在通过实施虚拟钻导向辅助手术程序的机器人系统。该系统使用新型虚拟机制控制器集成虚拟固定装置功能，并提供附加的视觉反馈。控制器将工具约束在所需轴上，同时使轴向运动保持在外科医生的控制之下。与先前主要通过线性弹簧和阻尼器进行纯能量整形和阻尼注入的虚拟固定装置方法相比，我们的控制器使用由非线性弹簧约束机器人的虚拟棱柱关节，使我们能够轻松地塑造系统的动力学。我们详细描述了实现足够精度所需的校准程序，并介绍了控制器的实现。我们将其应用于兽医学程序：在狗身上进行经髁螺钉置入的钻孔。对3D打印骨骼模型的试验结果表明了足够的精度以执行该程序，并且与患者特定导板（PSG）相比，表现出更好的角度准确性和较低的退出平移误差。讨论和未来改进随之进行。', 'title_zh': '手术机器人中的协作钻孔对齐'}
{'arxiv_id': 'arXiv:2503.07077', 'title': 'Rule-Based Conflict-Free Decision Framework in Swarm Confrontation', 'authors': 'Zhaoqi Dong, Zhinan Wang, Quanqi Zheng, Bin Xu, Lei Chen, Jinhu Lv', 'link': 'https://arxiv.org/abs/2503.07077', 'abstract': 'Traditional rule--based decision--making methods with interpretable advantage, such as finite state machine, suffer from the jitter or deadlock(JoD) problems in extremely dynamic scenarios. To realize agent swarm confrontation, decision conflicts causing many JoD problems are a key issue to be solved. Here, we propose a novel decision--making framework that integrates probabilistic finite state machine, deep convolutional networks, and reinforcement learning to implement interpretable intelligence into agents. Our framework overcomes state machine instability and JoD problems, ensuring reliable and adaptable decisions in swarm confrontation. The proposed approach demonstrates effective performance via enhanced human--like cooperation and competitive strategies in the rigorous evaluation of real experiments, outperforming other methods.', 'abstract_zh': '基于概率有限状态机、深度卷积网络和强化学习的新型决策框架：实现智能体群拥导中的可解释智能', 'title_zh': '基于规则的 swarm 对抗中冲突自由决策框架'}
{'arxiv_id': 'arXiv:2503.06083', 'title': 'T-CBF: Traversability-based Control Barrier Function to Navigate Vertically Challenging Terrain', 'authors': 'Manas Gupta, Xuesu Xiao', 'link': 'https://arxiv.org/abs/2503.06083', 'abstract': 'Safety has been of paramount importance in motion planning and control techniques and is an active area of research in the past few years. Most safety research for mobile robots target at maintaining safety with the notion of collision avoidance. However, safety goes beyond just avoiding collisions, especially when robots have to navigate unstructured, vertically challenging, off-road terrain, where vehicle rollover and immobilization is as critical as collisions. In this work, we introduce a novel Traversability-based Control Barrier Function (T-CBF), in which we use neural Control Barrier Functions (CBFs) to achieve safety beyond collision avoidance on unstructured vertically challenging terrain by reasoning about new safety aspects in terms of traversability. The neural T-CBF trained on safe and unsafe observations specific to traversability safety is then used to generate safe trajectories. Furthermore, we present experimental results in simulation and on a physical Verti-4 Wheeler (V4W) platform, demonstrating that T-CBF can provide traversability safety while reaching the goal position. T-CBF planner outperforms previously developed planners by 30\\% in terms of keeping the robot safe and mobile when navigating on real world vertically challenging terrain.', 'abstract_zh': '基于通行性的控制屏障函数在垂直挑战性非结构化地形上的安全性研究', 'title_zh': '基于 traversability 的控制障碍函数Navigate 陡峭地形的一种方法'}
