{'arxiv_id': 'arXiv:2505.13350', 'title': 'Approximating Global Contact-Implicit MPC via Sampling and Local Complementarity', 'authors': 'Sharanya Venkatesh, Bibit Bianchini, Alp Aydinoglu, William Yang, Michael Posa', 'link': 'https://arxiv.org/abs/2505.13350', 'abstract': 'To achieve general-purpose dexterous manipulation, robots must rapidly devise and execute contact-rich behaviors. Existing model-based controllers are incapable of globally optimizing in real-time over the exponential number of possible contact sequences. Instead, recent progress in contact-implicit control has leveraged simpler models that, while still hybrid, make local approximations. However, the use of local models inherently limits the controller to only exploit nearby interactions, potentially requiring intervention to richly explore the space of possible contacts. We present a novel approach which leverages the strengths of local complementarity-based control in combination with low-dimensional, but global, sampling of possible end-effector locations. Our key insight is to consider a contact-free stage preceding a contact-rich stage at every control loop. Our algorithm, in parallel, samples end effector locations to which the contact-free stage can move the robot, then considers the cost predicted by contact-rich MPC local to each sampled location. The result is a globally-informed, contact-implicit controller capable of real-time dexterous manipulation. We demonstrate our controller on precise, non-prehensile manipulation of non-convex objects using a Franka Panda arm. Project page: this https URL', 'abstract_zh': '为了实现通用灵巧操作，机器人必须快速设计和执行高接触的操作行为。现有的基于模型的控制器无法在实时中对成指数级可能的接触序列进行全局优化。相反，最近在接触隐式控制方面的进展利用了更简单的模型，虽然仍然混合，但仍做出了局部近似。然而，使用局部模型本质上限制了控制器只能利用附近的交互，可能需要干预以丰富地探索可能接触的空间。我们提出了一种新方法，该方法结合了局部共轭控制的优点以及可能末端执行器位置的低维全局采样。我们的关键洞察是，在每一控制循环中考虑一个接触自由阶段在接触丰富阶段之前的阶段。我们的算法并行地采样末端执行器位置，该位置的接触自由阶段可以移动机器人，然后考虑每个采样位置周围的接触丰富MPC预测的成本。结果是一种全局信息丰富的接触隐式控制器，能够进行实时灵巧操作。我们使用Franka Panda机械臂演示了该控制器在非凸对象精确实物操作上的应用。项目页面：这个 https URL。', 'title_zh': '通过采样和局部互补性逼近全局接触隐式MPC'}
{'arxiv_id': 'arXiv:2505.13186', 'title': 'Interpretable Robotic Friction Learning via Symbolic Regression', 'authors': 'Philipp Scholl, Alexander Dietrich, Sebastian Wolf, Jinoh Lee, Alin-Albu Schäffer, Gitta Kutyniok, Maged Iskandar', 'link': 'https://arxiv.org/abs/2505.13186', 'abstract': 'Accurately modeling the friction torque in robotic joints has long been challenging due to the request for a robust mathematical description. Traditional model-based approaches are often labor-intensive, requiring extensive experiments and expert knowledge, and they are difficult to adapt to new scenarios and dependencies. On the other hand, data-driven methods based on neural networks are easier to implement but often lack robustness, interpretability, and trustworthiness--key considerations for robotic hardware and safety-critical applications such as human-robot interaction. To address the limitations of both approaches, we propose the use of symbolic regression (SR) to estimate the friction torque. SR generates interpretable symbolic formulas similar to those produced by model-based methods while being flexible to accommodate various dynamic effects and dependencies. In this work, we apply SR algorithms to approximate the friction torque using collected data from a KUKA LWR-IV+ robot. Our results show that SR not only yields formulas with comparable complexity to model-based approaches but also achieves higher accuracy. Moreover, SR-derived formulas can be seamlessly extended to include load dependencies and other dynamic factors.', 'abstract_zh': '准确建模机器人关节的摩擦扭矩长期存在挑战，需要 robust 的数学描述。基于传统模型的方法通常劳动密集型，需要大量的实验和专家知识，并且难以适应新的场景和依赖关系。另一方面，基于神经网络的数据驱动方法虽然更容易实现，但在稳健性、可解释性和可信度方面常显不足——这些是类似人机交互等关键应用中机器人硬件和安全至关重要的考量因素。为了克服两种方法的局限性，我们提出使用符号回归（SR）来估计摩擦扭矩。SR 生成类似于模型基于方法的可解释符号公式，同时具有灵活性以适应各种动态效应和依赖关系。在本文中，我们应用 SR 算法利用 KUKA LWR-IV+ 机器人收集的数据近似摩擦扭矩。结果表明，SR 不仅产生与模型基于方法具有可比复杂度的公式，还实现了更高的准确性。此外，SR 得到的公式可以无缝扩展以包含载荷依赖性和其他动态因素。', 'title_zh': '可解释的机器人摩擦力学习方法 via 符号回归'}
{'arxiv_id': 'arXiv:2505.13054', 'title': 'Disentangling Coordiante Frames for Task Specific Motion Retargeting in Teleoperation using Shared Control and VR Controllers', 'authors': 'Max Grobbel, Daniel Flögel, Philipp Rigoll, Sören Hohmann', 'link': 'https://arxiv.org/abs/2505.13054', 'abstract': 'Task performance in terms of task completion time in teleoperation is still far behind compared to humans conducting tasks directly. One large identified impact on this is the human capability to perform transformations and alignments, which is directly influenced by the point of view and the motion retargeting strategy. In modern teleoperation systems, motion retargeting is usually implemented through a one time calibration or switching modes. Complex tasks, like concatenated screwing, might be difficult, because the operator has to align (e.g. mirror) rotational and translational input commands. Recent research has shown, that the separation of translation and rotation leads to increased task performance. This work proposes a formal motion retargeting method, which separates translational and rotational input commands. This method is then included in a optimal control based trajectory planner and shown to work on a UR5e manipulator.', 'abstract_zh': '远程操作中任务执行时间的表现仍然远远落后于直接操作任务的人类。一个已识别的主要影响因素是人类执行变换和对齐的能力，这直接受到视角和运动重塑策略的影响。在现代远程操作系统中，运动重塑通常通过一次性校准或切换模式来实现。复杂的任务，如连续拧螺钉，可能很困难，因为操作者需要对齐（例如镜像）旋转和平移输入命令。最近的研究表明，平移和旋转的分离会提高任务表现。本研究提出了一种形式化的运动重塑方法，该方法分离了平移和旋转输入命令。随后，该方法被包含在一个基于最优控制的轨迹规划器中，并在UR5e操作器上进行了验证。', 'title_zh': '基于共享控制和VR控制器的远程操作中特定任务运动转移的坐标框架解耦'}
{'arxiv_id': 'arXiv:2505.12934', 'title': 'Granular Loco-Manipulation: Repositioning Rocks Through Strategic Sand Avalanche', 'authors': 'Haodi Hu, Yue Wu, Feifei Qian, Daniel Seita', 'link': 'https://arxiv.org/abs/2505.12934', 'abstract': 'Legged robots have the potential to leverage obstacles to climb steep sand slopes. However, efficiently repositioning these obstacles to desired locations is challenging. Here we present DiffusiveGRAIN, a learning-based method that enables a multi-legged robot to strategically induce localized sand avalanches during locomotion and indirectly manipulate obstacles. We conducted 375 trials, systematically varying obstacle spacing, robot orientation, and leg actions in 75 of them. Results show that the movement of closely-spaced obstacles exhibits significant interference, requiring joint modeling. In addition, different multi-leg excavation actions could cause distinct robot state changes, necessitating integrated planning of manipulation and locomotion. To address these challenges, DiffusiveGRAIN includes a diffusion-based environment predictor to capture multi-obstacle movements under granular flow interferences and a robot state predictor to estimate changes in robot state from multi-leg action patterns. Deployment experiments (90 trials) demonstrate that by integrating the environment and robot state predictors, the robot can autonomously plan its movements based on loco-manipulation goals, successfully shifting closely located rocks to desired locations in over 65% of trials. Our study showcases the potential for a locomoting robot to strategically manipulate obstacles to achieve improved mobility on challenging terrains.', 'abstract_zh': '基于学习的腿部机器人通过诱导局部沙子雪崩来进行障碍物间接操控的方法：DiffusiveGRAIN', 'title_zh': '颗粒灵巧操作：通过战略性沙崩重新定位岩石'}
{'arxiv_id': 'arXiv:2505.12649', 'title': 'The Robot of Theseus: A modular robotic testbed for legged locomotion', 'authors': 'Karthik Urs, Jessica Carlson, Aditya Srinivas Manohar, Michael Rakowiecki, Abdulhadi Alkayyali, John E. Saunders, Faris Tulbah, Talia Y. Moore', 'link': 'https://arxiv.org/abs/2505.12649', 'abstract': 'Robotic models are useful for independently varying specific features, but most quadrupedal robots differ so greatly from animal morphologies that they have minimal biomechanical relevance. Commercially available quadrupedal robots are also prohibitively expensive for biological research programs and difficult to customize. Here, we present a low-cost quadrupedal robot with modular legs that can match a wide range of animal morphologies for biomechanical hypothesis testing. The Robot Of Theseus (TROT) costs approximately $4000 to build out of 3D printed parts and standard off-the-shelf supplies. Each limb consists of 2 or 3 rigid links; the proximal joint can be rotated to become a knee or elbow. Telescoping mechanisms vary the length of each limb link. The open-source software accommodates user-defined gaits and morphology changes. Effective leg length, or crouch, is determined by the four-bar linkage actuating each joint. The backdrivable motors can vary virtual spring stiffness and range of motion. Full descriptions of the TROT hardware and software are freely available online. We demonstrate the use of TROT to compare locomotion among extant, extinct, and theoretical morphologies. In addition to biomechanical hypothesis testing, we envision a variety of different applications for this low-cost, modular, legged robotic platform, including developing novel control strategies, clearing land mines, or remote exploration. All CAD and code is available for download on the TROT project page.', 'abstract_zh': '低成本模块化Theseus四足机器人：用于运动学假设测试的多功能平台', 'title_zh': 'Theseus 机器人：一种用于腿足移动的模块化机器人试验台'}
{'arxiv_id': 'arXiv:2505.12634', 'title': 'MSCEKF-MIO: Magnetic-Inertial Odometry Based on Multi-State Constraint Extended Kalman Filter', 'authors': 'Jiazhu Li, Jian Kuang, Xiaoji', 'link': 'https://arxiv.org/abs/2505.12634', 'abstract': "To overcome the limitation of existing indoor odometry technologies which often cannot simultaneously meet requirements for accuracy cost-effectiveness, and robustness-this paper proposes a novel magnetometer array-aided inertial odometry approach, MSCEKF-MIO (Multi-State Constraint Extended Kalman Filter-based Magnetic-Inertial Odometry). We construct a magnetic field model by fitting measurements from the magnetometer array and then use temporal variations in this model-extracted from continuous observations-to estimate the carrier's absolute velocity. Furthermore, we implement the MSCEKF framework to fuse observed magnetic field variations with position and attitude estimates from inertial navigation system (INS) integration, thereby enabling autonomous, high-precision indoor relative positioning. Experimental results demonstrate that the proposed algorithm achieves superior velocity estimation accuracy and horizontal positioning precision relative to state-of-the-art magnetic array-aided INS algorithms (MAINS). On datasets with trajectory lengths of 150-250m, the proposed method yields an average horizontal position RMSE of approximately 2.5m. In areas with distinctive magnetic features, the magneto-inertial odometry achieves a velocity estimation accuracy of 0.07m/s. Consequently, the proposed method offers a novel positioning solution characterized by low power consumption, cost-effectiveness, and high reliability in complex indoor environments.", 'abstract_zh': '基于磁阵列辅助多状态约束扩展卡尔曼滤波的惯导里程计方法MSCEKF-MIO', 'title_zh': '基于多状态约束扩展卡尔曼滤波的磁-惯性里程计MSCEKF-MIO'}
{'arxiv_id': 'arXiv:2505.12624', 'title': 'EndoForce: Development of an Intuitive Axial Force Measurement Device for Endoscopic Robotic Systems', 'authors': 'Hansoul Kim, Dong-Ho Lee, Dukyoo Kong, Dong-Soo Kwon, Byungsik Cheon', 'link': 'https://arxiv.org/abs/2505.12624', 'abstract': 'Robotic endoscopic systems provide intuitive control and eliminate radiation exposure, making them a promising alternative to conventional methods. However, the lack of axial force measurement from the robot remains a major challenge, as it can lead to excessive colonic elongation, perforation, or ureteral complications. Although various methods have been proposed in previous studies, limitations such as model dependency, bulkiness, and environmental sensitivity remain challenges that should be addressed before clinical application. In this study, we propose EndoForce, a device designed for intuitive and accurate axial force measurement in endoscopic robotic systems. Inspired by the insertion motion performed by medical doctors during ureteroscopy and gastrointestinal (GI) endoscopy, EndoForce ensures precise force measuring while maintaining compatibility with clinical environments. The device features a streamlined design, allowing for the easy attachment and detachment of a sterile cover, and incorporates a commercial load cell to enhance cost-effectiveness and facilitate practical implementation in real medical applications. To validate the effectiveness of the proposed EndoForce, physical experiments were performed using a testbed that simulates the ureter. We show that the axial force generated during insertion was measured with high accuracy, regardless of whether the pathway was straight or curved, in a testbed simulating the human ureter.', 'abstract_zh': '机器人内窥镜系统提供直观控制并消除辐射暴露，使其成为传统方法的有前途的替代方案。然而，机器人缺乏轴向力测量仍然是一个主要挑战，因为它可能导致结肠过度拉伸、穿孔或输尿管并发症。虽然先前研究中提出了多种方法，但模型依赖性、体积大和环境敏感性等限制仍需在临床应用前克服。在本研究中，我们提出了一种名为EndoForce的设备，用于内窥镜机器人系统中直观而准确的轴向力测量。该设备受到泌尿内镜检查和消化道（GI）内镜检查中医生插入动作的启发，确保了精确的力测量并保持与临床环境的兼容性。设备采用了流线型设计，便于无菌盖的安装和拆卸，并集成了商用载荷细胞以提高成本效益并促进实际医疗应用的实施。为了验证所提出的EndoForce的有效性，我们使用模拟输尿管的试验床进行了物理实验。结果表明，在模拟人体输尿管的试验床中，无论路径是直线还是弯曲，插入过程中产生的轴向力都能被高精度测量。', 'title_zh': 'EndoForce: 一种直觉轴向力测量装置的开发用于内窥镜机器人系统'}
{'arxiv_id': 'arXiv:2505.12361', 'title': 'Adaptive MPC-based quadrupedal robot control under periodic disturbances', 'authors': 'Elizaveta Pestova, Ilya Osokin, Danil Belov, Pavel Osinenko', 'link': 'https://arxiv.org/abs/2505.12361', 'abstract': 'Recent advancements in adaptive control for reference trajectory tracking enable quadrupedal robots to perform locomotion tasks under challenging conditions. There are methods enabling the estimation of the external disturbances in terms of forces and torques. However, a specific case of disturbances that are periodic was not explicitly tackled in application to quadrupeds. This work is devoted to the estimation of the periodic disturbances with a lightweight regressor using simplified robot dynamics and extracting the disturbance properties in terms of the magnitude and frequency. Experimental evidence suggests performance improvement over the baseline static disturbance compensation. All source files, including simulation setups, code, and calculation scripts, are available on GitHub at this https URL.', 'abstract_zh': '近期自适应控制在参考轨迹跟踪方面的进展使四足机器人能够在复杂条件中完成运动任务。这些方法能够估计外部干扰力和力矩，然而对于周期性干扰的具体情形在四足机器人应用中未被明确处理。本工作旨在使用简化机器人动力学和提取干扰的幅度和频率特性，通过轻量级回归器估计周期性干扰。实验结果表明，与基准静态干扰补偿方法相比，性能得到了提升。所有源代码文件，包括仿真设置、代码和计算脚本，均可在以下GitHub链接处获取。', 'title_zh': '基于周期性干扰的自适应MPC四足机器人控制'}
{'arxiv_id': 'arXiv:2505.12327', 'title': 'Robust Planning for Autonomous Driving via Mixed Adversarial Diffusion Predictions', 'authors': 'Albert Zhao, Stefano Soatto', 'link': 'https://arxiv.org/abs/2505.12327', 'abstract': 'We describe a robust planning method for autonomous driving that mixes normal and adversarial agent predictions output by a diffusion model trained for motion prediction. We first train a diffusion model to learn an unbiased distribution of normal agent behaviors. We then generate a distribution of adversarial predictions by biasing the diffusion model at test time to generate predictions that are likely to collide with a candidate plan. We score plans using expected cost with respect to a mixture distribution of normal and adversarial predictions, leading to a planner that is robust against adversarial behaviors but not overly conservative when agents behave normally. Unlike current approaches, we do not use risk measures that over-weight adversarial behaviors while placing little to no weight on low-cost normal behaviors or use hard safety constraints that may not be appropriate for all driving scenarios. We show the effectiveness of our method on single-agent and multi-agent jaywalking scenarios as well as a red light violation scenario.', 'abstract_zh': '我们描述了一种结合正常和 adversarial 行为预测的 robust 规划方法，这些预测由一个用于运动预测的扩散模型生成。我们首先训练一个扩散模型来学习正常代理行为的无偏分布。然后，通过在测试时使扩散模型产生更可能与候选计划发生碰撞的偏倚预测，我们生成了一种 adversarial 预测的分布。我们使用预期成本对计划进行评分，以正常和 adversarial 预测的混合分布为依据，从而得到了一种对 adversarial 行为具有 robust 性的规划器，但在代理正常行为时不会过度保守。与当前的方法不同，我们不使用会给 adversarial 行为过度加权而对低成本正常行为几乎没有加权的风险度量，也不使用可能不适合所有驾驶场景的硬性安全约束。我们在单代理和多代理乱穿马路场景以及闯红灯场景中展示了该方法的有效性。', 'title_zh': '基于混合对抗扩散预测的自动驾驶 robust 规划'}
{'arxiv_id': 'arXiv:2505.12231', 'title': 'Design of a 3-DOF Hopping Robot with an Optimized Gearbox: An Intermediate Platform Toward Bipedal Robots', 'authors': 'JongHun Choe, Gijeong Kim, Hajun Kim, Dongyun Kang, Min-Su Kim, Hae-Won Park', 'link': 'https://arxiv.org/abs/2505.12231', 'abstract': "This paper presents a 3-DOF hopping robot with a human-like lower-limb joint configuration and a flat foot, capable of performing dynamic and repetitive jumping motions. To achieve both high torque output and a large hollow shaft diameter for efficient cable routing, a compact 3K compound planetary gearbox was designed using mixed-integer nonlinear programming for gear tooth optimization. To meet performance requirements within the constrained joint geometry, all major components-including the actuator, motor driver, and communication interface-were custom-designed. The robot weighs 12.45 kg, including a dummy mass, and measures 840 mm in length when the knee joint is fully extended. A reinforcement learning-based controller was employed, and robot's performance was validated through hardware experiments, demonstrating stable and repetitive hopping motions in response to user inputs. These experimental results indicate that the platform serves as a solid foundation for future bipedal robot development.", 'abstract_zh': '一种具有类人下肢关节配置和平足的3-DOF跳跃机器人及其高性能设计与控制', 'title_zh': '优化齿轮箱的3-DOF跳跃机器人设计：双足机器人中间平台'}
{'arxiv_id': 'arXiv:2505.12222', 'title': 'Learning Impact-Rich Rotational Maneuvers via Centroidal Velocity Rewards and Sim-to-Real Techniques: A One-Leg Hopper Flip Case Study', 'authors': 'Dongyun Kang, Gijeong Kim, JongHun Choe, Hajun Kim, Hae-Won Park', 'link': 'https://arxiv.org/abs/2505.12222', 'abstract': 'Dynamic rotational maneuvers, such as front flips, inherently involve large angular momentum generation and intense impact forces, presenting major challenges for reinforcement learning and sim-to-real transfer. In this work, we propose a general framework for learning and deploying impact-rich, rotation-intensive behaviors through centroidal velocity-based rewards and actuator-aware sim-to-real techniques. We identify that conventional link-level reward formulations fail to induce true whole-body rotation and introduce a centroidal angular velocity reward that accurately captures system-wide rotational dynamics. To bridge the sim-to-real gap under extreme conditions, we model motor operating regions (MOR) and apply transmission load regularization to ensure realistic torque commands and mechanical robustness. Using the one-leg hopper front flip as a representative case study, we demonstrate the first successful hardware realization of a full front flip. Our results highlight that incorporating centroidal dynamics and actuator constraints is critical for reliably executing highly dynamic motions.', 'abstract_zh': '动态旋转机动，如前空翻，固有地涉及较大的角动量生成和强烈的冲击力，为强化学习和仿真到现实世界的转移带来了重大挑战。本文提出了一种通过质心速度基奖励和考虑执行器的仿真到现实技术的一般框架，以学习和部署富含冲击、密集旋转的行为。我们发现传统的环节级奖励形式无法诱导真正的全身旋转，并引入了质心角速度奖励以准确捕捉系统的整体旋转动力学。为在极端条件下弥合仿真与现实之间的差距，我们建模了电机工作区域（MOR），并应用传动载荷正则化以确保现实可行的扭矩命令和机械鲁棒性。使用单腿跳跃机器人前空翻作为典型案例，我们展示了首个成功的全尺寸前空翻的硬件实现。我们的结果强调，纳入质心动力学和执行器约束对于可靠执行高度动态动作至关重要。', 'title_zh': '基于质心速度奖励和仿真实践的高冲击旋转机动学习：单腿跳跃器翻转案例研究'}
{'arxiv_id': 'arXiv:2505.12176', 'title': 'Towards Robust Autonomous Landing Systems: Iterative Solutions and Key Lessons Learned', 'authors': 'Sebastian Schroder, Yao Deng, Alice James, Avishkar Seth, Kye Morton, Subhas Mukhopadhyay, Richard Han, Xi Zheng', 'link': 'https://arxiv.org/abs/2505.12176', 'abstract': 'Uncrewed Aerial Vehicles (UAVs) have become a focal point of research, with both established companies and startups investing heavily in their development. This paper presents our iterative process in developing a robust autonomous marker-based landing system, highlighting the key challenges encountered and the solutions implemented. It reviews existing systems for autonomous landing processes, and through this aims to contribute to the community by sharing insights and challenges faced during development and testing.', 'abstract_zh': '无人驾驶航空 vehicles (UAVs)已成为研究的焦点，both established companies and startups are investing heavily in their development. 本文介绍了我们开发稳健的自主标志引导着陆系统的迭代过程，强调了遇到的关键挑战和实施的解决方案，并回顾了现有的自主着陆系统，旨在通过分享开发和测试过程中遇到的见解和挑战来为社区贡献力量。', 'title_zh': '面向鲁棒自主着陆系统的迭代解决方案与关键经验教训'}
{'arxiv_id': 'arXiv:2505.11975', 'title': 'Proactive tactile exploration for object-agnostic shape reconstruction from minimal visual priors', 'authors': 'Paris Oikonomou, George Retsinas, Petros Maragos, Costas S. Tzafestas', 'link': 'https://arxiv.org/abs/2505.11975', 'abstract': "The perception of an object's surface is important for robotic applications enabling robust object manipulation. The level of accuracy in such a representation affects the outcome of the action planning, especially during tasks that require physical contact, e.g. grasping. In this paper, we propose a novel iterative method for 3D shape reconstruction consisting of two steps. At first, a mesh is fitted on data points acquired from the object's surface, based on a single primitive template. Subsequently, the mesh is properly adjusted to adequately represent local deformities. Moreover, a novel proactive tactile exploration strategy aims at minimizing the total uncertainty with the least number of contacts, while reducing the risk of contact failure in case the estimated surface differs significantly from the real one. The performance of the methodology is evaluated both in 3D simulation and on a real setup.", 'abstract_zh': '对物体表面的感知对于实现稳健的物体操作的机器人应用至关重要。此类表示的准确性程度影响动作规划的结果，特别是在需要物理接触的任务中，例如抓取。在本文中，我们提出了一种新颖的迭代3D形状重建方法，由两个步骤组成。首先，根据单一基本模板将网格拟合到从物体表面获得的数据点上。随后，适当调整网格以充分表示局部变形。此外，提出了一种新颖的主动触觉探索策略，旨在在最少的接触次数下最小化总不确定性，并在估计表面与实际表面差异显著时降低接触失败的风险。该方法的性能在3D仿真和实际设置中进行了评估。', 'title_zh': '基于最少视觉先验的物体无关形状重建的主动触觉探索'}
{'arxiv_id': 'arXiv:2505.11879', 'title': 'Experimental Study on Automatically Assembling Custom Catering Packages With a 3-DOF Delta Robot Using Deep Learning Methods', 'authors': 'Reihaneh Yourdkhani, Arash Tavoosian, Navid Asadi Khomami, Mehdi Tale Masouleh', 'link': 'https://arxiv.org/abs/2505.11879', 'abstract': 'This paper introduces a pioneering experimental study on the automated packing of a catering package using a two-fingered gripper affixed to a 3-degree-of-freedom Delta parallel robot. A distinctive contribution lies in the application of a deep learning approach to tackle this challenge. A custom dataset, comprising 1,500 images, is meticulously curated for this endeavor, representing a noteworthy initiative as the first dataset focusing on Persian-manufactured products. The study employs the YOLOV5 model for object detection, followed by segmentation using the FastSAM model. Subsequently, rotation angle calculation is facilitated with segmentation masks, and a rotated rectangle encapsulating the object is generated. This rectangle forms the basis for calculating two grasp points using a novel geometrical approach involving eigenvectors. An extensive experimental study validates the proposed model, where all pertinent information is seamlessly transmitted to the 3-DOF Delta parallel robot. The proposed algorithm ensures real-time detection, calibration, and the fully autonomous packing process of a catering package, boasting an impressive over 80\\% success rate in automatic grasping. This study marks a significant stride in advancing the capabilities of robotic systems for practical applications in packaging automation.', 'abstract_zh': '基于两指夹爪的三自由度Delta并联机器人餐饮包装自动化实验研究', 'title_zh': '基于深度学习方法的3-DOFdelta机器人自动装配定制餐饮包实验研究'}
{'arxiv_id': 'arXiv:2505.11858', 'title': 'Integrating Model-based Control and RL for Sim2Real Transfer of Tight Insertion Policies', 'authors': 'Isidoros Marougkas, Dhruv Metha Ramesh, Joe H. Doerr, Edgar Granados, Aravind Sivaramakrishnan, Abdeslam Boularias, Kostas E. Bekris', 'link': 'https://arxiv.org/abs/2505.11858', 'abstract': "Object insertion under tight tolerances ($< \\hspace{-.02in} 1mm$) is an important but challenging assembly task as even small errors can result in undesirable contacts. Recent efforts focused on Reinforcement Learning (RL), which often depends on careful definition of dense reward functions. This work proposes an effective strategy for such tasks that integrates traditional model-based control with RL to achieve improved insertion accuracy. The policy is trained exclusively in simulation and is zero-shot transferred to the real system. It employs a potential field-based controller to acquire a model-based policy for inserting a plug into a socket given full observability in simulation. This policy is then integrated with residual RL, which is trained in simulation given only a sparse, goal-reaching reward. A curriculum scheme over observation noise and action magnitude is used for training the residual RL policy. Both policy components use as input the SE(3) poses of both the plug and the socket and return the plug's SE(3) pose transform, which is executed by a robotic arm using a controller. The integrated policy is deployed on the real system without further training or fine-tuning, given a visual SE(3) object tracker. The proposed solution and alternatives are evaluated across a variety of objects and conditions in simulation and reality. The proposed approach outperforms recent RL-based methods in this domain and prior efforts with hybrid policies. Ablations highlight the impact of each component of the approach.", 'abstract_zh': '在紧公差下（<1mm）的物体插入是一个重要但具挑战性的装配任务，即使是很小的误差也可能导致不必要的接触。近期的努力集中在强化学习（RL）上，这通常需要仔细定义稠密的奖励函数。本文提出了一种有效的策略，将传统的基于模型的控制与RL结合，以实现改进的插入精度。策略仅在仿真环境中训练，并零样本转移至实际系统。该策略使用基于势场的控制器，在仿真全可观测性条件下获取插入插头到插座的基于模型的策略。然后，将该策略与残差RL结合，后者仅在仿真中使用稀疏的目标导向奖励进行训练。使用观察噪声和动作幅度的学习曲线方案来训练残差RL策略。策略组件均以插头和插座的SE(3)姿态作为输入，并返回插头的SE(3)姿态变换，该变换由机器人手臂通过控制器执行。综合策略在实际系统中部署，无需进一步训练或微调，给定视觉SE(3)物体跟踪器。提出的解决方案及其替代方案在多种物体和条件下，在仿真和实际环境中进行了评估。与基于RL的方法及之前的工作相比，提出的办法表现更优，消融实验突显了该方法各个组件的影响。', 'title_zh': '基于模型的控制与RL相结合实现精确插入策略的仿真实现到真实世界的转移'}
{'arxiv_id': 'arXiv:2505.11808', 'title': 'Human-Centered Development of Guide Dog Robots: Quiet and Stable Locomotion Control', 'authors': 'Shangqun Yu, Hochul Hwang, Trung M. Dang, Joydeep Biswas, Nicholas A. Giudice, Sunghoon Ivan Lee, Donghyun Kim', 'link': 'https://arxiv.org/abs/2505.11808', 'abstract': "A quadruped robot is a promising system that can offer assistance comparable to that of dog guides due to its similar form factor. However, various challenges remain in making these robots a reliable option for blind and low-vision (BLV) individuals. Among these challenges, noise and jerky motion during walking are critical drawbacks of existing quadruped robots. While these issues have largely been overlooked in guide dog robot research, our interviews with guide dog handlers and trainers revealed that acoustic and physical disturbances can be particularly disruptive for BLV individuals, who rely heavily on environmental sounds for navigation. To address these issues, we developed a novel walking controller for slow stepping and smooth foot swing/contact while maintaining human walking speed, as well as robust and stable balance control. The controller integrates with a perception system to facilitate locomotion over non-flat terrains, such as stairs. Our controller was extensively tested on the Unitree Go1 robot and, when compared with other control methods, demonstrated significant noise reduction -- half of the default locomotion controller. In this study, we adopt a mixed-methods approach to evaluate its usability with BLV individuals. In our indoor walking experiments, participants compared our controller to the robot's default controller. Results demonstrated superior acceptance of our controller, highlighting its potential to improve the user experience of guide dog robots. Video demonstration (best viewed with audio) available at: this https URL.", 'abstract_zh': '四足机器人是一种有前景的系统，因其与导盲犬类似的外形可以提供类似辅助。然而，仍有许多挑战需要克服，使其成为盲人和低视力（BLV）个体的可靠选择。在这些挑战中，行走过程中的噪音和不平稳运动是现有四足机器人的重要缺点。虽然这些问题在导盲犬机器人研究中大多被忽视，但我们的采访表明，对于高度依赖环境声音进行导航的BLV个体而言，声学和物理干扰尤其具有干扰性。为解决这些问题，我们开发了一种新型行走控制器，以保持人类行走速度的同时实现缓慢步态和柔和的足部摆动/接触，并且能够提供稳健的平衡控制。该控制器与感知系统集成，便于在非平坦地形（如楼梯）上行走。我们对该控制器进行了广泛测试，并与其它控制方法相比，显示出显著的噪音减少——仅为默认行走控制器的一半。在本研究中，我们采用混合方法评估其在BLV个体中的实用性。在室内行走实验中，参与者将我们的控制器与机器人的默认控制器进行了对比。结果表明，我们的控制器获得了更高的接受度，突显了其提高导盲犬机器人用户体验的潜力。视频演示（建议配有音频）可在以下链接查看：this https URL。', 'title_zh': '基于人类中心设计的导盲机器人开发：安静稳定的运动控制'}
{'arxiv_id': 'arXiv:2505.11663', 'title': 'Adaptive Ergodic Search with Energy-Aware Scheduling for Persistent Multi-Robot Missions', 'authors': 'Kaleb Ben Naveed, Devansh R. Agrawal, Rahul Kumar, Dimitra Panagou', 'link': 'https://arxiv.org/abs/2505.11663', 'abstract': 'Autonomous robots are increasingly deployed for long-term information-gathering tasks, which pose two key challenges: planning informative trajectories in environments that evolve across space and time, and ensuring persistent operation under energy constraints. This paper presents a unified framework, mEclares, that addresses both challenges through adaptive ergodic search and energy-aware scheduling in multi-robot systems. Our contributions are two-fold: (1) we model real-world variability using stochastic spatiotemporal environments, where the underlying information evolves unpredictably due to process uncertainty. To guide exploration, we construct a target information spatial distribution (TISD) based on clarity, a metric that captures the decay of information in the absence of observations and highlights regions of high uncertainty; and (2) we introduce Robustmesch (Rmesch), an online scheduling method that enables persistent operation by coordinating rechargeable robots sharing a single mobile charging station. Unlike prior work, our approach avoids reliance on preplanned schedules, static or dedicated charging stations, and simplified robot dynamics. Instead, the scheduler supports general nonlinear models, accounts for uncertainty in the estimated position of the charging station, and handles central node failures. The proposed framework is validated through real-world hardware experiments, and feasibility guarantees are provided under specific assumptions.', 'abstract_zh': '自主机器人越来越多地被部署在长期信息收集任务中，这提出了两个关键挑战：在随空间和时间演变的环境中规划信息丰富的轨迹，以及在能量限制下确保持续运行。本文提出了一种统一框架mEclares，该框架通过适应性遍历搜索和多机器人系统中的能量感知调度来同时应对这两个挑战。我们的贡献包括两个方面：(1) 我们使用随机时空环境建模现实世界的变异性，其中底层信息由于过程不确定性而无法预测地演变。为了引导探索，我们基于清晰度构建了目标信息空间分布（TISD），清晰度是一个度量信息在缺乏观测时的衰减，并突出显示高不确定性区域；(2) 我们引入了Robustmesch（Rmesch），这是一种在线调度方法，通过协调共享单个移动充电站的可充电机器人来实现持续运行。与先前工作不同，我们的方法避免依赖预先计划的调度、静态或专用充电站以及简化的机器人动力学模型。相反，调度器支持通用非线性模型，考虑了充电站估计位置的不确定性，并处理中心节点故障。所提出的框架通过真实硬件实验得到了验证，并在特定假设下提供了可行性保证。', 'title_zh': '能量感知调度的自适应遍历搜索方法及其在持久化多机器人任务中的应用'}
{'arxiv_id': 'arXiv:2505.11624', 'title': 'Monotone Subsystem Decomposition for Efficient Multi-Objective Robot Design', 'authors': 'Andrew Wilhelm, Nils Napp', 'link': 'https://arxiv.org/abs/2505.11624', 'abstract': 'Automating design minimizes errors, accelerates the design process, and reduces cost. However, automating robot design is challenging due to recursive constraints, multiple design objectives, and cross-domain design complexity possibly spanning multiple abstraction layers. Here we look at the problem of component selection, a combinatorial optimization problem in which a designer, given a robot model, must select compatible components from an extensive catalog. The goal is to satisfy high-level task specifications while optimally balancing trade-offs between competing design objectives. In this paper, we extend our previous constraint programming approach to multi-objective design problems and propose the novel technique of monotone subsystem decomposition to efficiently compute a Pareto front of solutions for large-scale problems. We prove that subsystems can be optimized for their Pareto fronts and, under certain conditions, these results can be used to determine a globally optimal Pareto front. Furthermore, subsystems serve as an intuitive design abstraction and can be reused across various design problems. Using an example quadcopter design problem, we compare our method to a linear programming approach and demonstrate our method scales better for large catalogs, solving a multi-objective problem of 10^25 component combinations in seconds. We then expand the original problem and solve a task-oriented, multi-objective design problem to build a fleet of quadcopters to deliver packages. We compute a Pareto front of solutions in seconds where each solution contains an optimal component-level design and an optimal package delivery schedule for each quadcopter.', 'abstract_zh': '自动化设计减少了错误，加速了设计过程，并降低了成本。然而，由于递归约束、多个设计目标以及可能跨越多个抽象层次的跨域设计复杂性，自动化机器人设计具有挑战性。本文关注组件选择问题，这是一个组合优化问题，设计师根据机器人模型从广泛的组件目录中选择兼容的组件。目标是在满足高层次任务规范的同时，最优地平衡竞争设计目标之间的权衡。在本文中，我们扩展了我们之前的方法，将其应用于多目标设计问题，并提出了一种新颖的技术——单调子系统分解，以高效地计算大规模问题的帕累托前沿。我们证明子系统可以为其帕累托前沿进行优化，在某些条件下，这些结果可以用于确定全局最优的帕累托前沿。此外，子系统作为直观的设计抽象，可以在各种设计问题中重用。通过一个四旋翼设计问题示例，我们将我们的方法与线性规划方法进行比较，并证明我们的方法在大型目录中更具可扩展性，能在秒内解决超过10^25种组件组合的多目标问题。然后，我们将原始问题扩展为一个面向任务的、多目标设计问题，以构建用于包裹配送的四旋翼机队。我们能在秒内计算出帕累托前沿的解决方案，每个解决方案都包括一个最优的组件级设计和每个四旋翼的最佳包裹配送时间表。', 'title_zh': '单调子系统分解以实现高效多目标机器人设计'}
{'arxiv_id': 'arXiv:2505.11593', 'title': 'Mechanically Programming the Cross-Sectional Shape of Soft Growing Robotic Structures for Patient Transfer', 'authors': 'O. Godson Osele, Kentaro Barhydt, Teagan Sullivan, H. Harry Asada, Allison M. Okamura', 'link': 'https://arxiv.org/abs/2505.11593', 'abstract': 'Pneumatic soft everting robotic structures have the potential to facilitate human transfer tasks due to their ability to grow underneath humans without sliding friction and their utility as a flexible sling when deflated. Tubular structures naturally yield circular cross-sections when inflated, whereas a robotic sling must be both thin enough to grow between them and their resting surface and wide enough to cradle the human. Recent works have achieved flattened cross-sections by including rigid components into the structure, but this reduces conformability to the human. We present a method of mechanically programming the cross-section of soft everting robotic structures using flexible strips that constrain radial expansion between points along the outer membrane. Our method enables simultaneously wide and thin profiles while maintaining the full multi-axis flexibility of traditional slings. We develop and validate a model relating the geometric design specifications to the fabrication parameters, and experimentally characterize their effects on growth rate. Finally, we prototype a soft growing robotic sling system and demonstrate its use for assisting a single caregiver in bed-to-chair patient transfer.', 'abstract_zh': '具有机械编程横向截面的 pneumatic 软展开机器人结构在人体转移任务中具有潜力，该结构能够在不产生滑动摩擦的情况下在人体下方生长，并且在泄压时可以作为灵活吊篮使用。尽管管状结构在充气时自然形成圆形横截面，但机器人吊篮必须足够薄以在人体与支撑表面之间生长，同时足够宽以托住人体。近期的研究通过在结构中加入刚性部件实现了扁平化横截面，但这降低了其对身体的适应性。我们提出了一种使用柔性条带机械编程软展开机器人结构横截面的方法，这些条带在外部膜上特定点之间限制径向扩张。该方法同时实现了宽而薄的轮廓，同时保持传统吊篮的全方位灵活性。我们开发并验证了一个模型，该模型将几何设计规范与制造参数相关联，并实验性地表征了这些参数对其生长速率的影响。最后，我们原型化了一个软生长机器人吊篮系统，并展示了其在单个护理人员帮助下从床到椅子进行患者转移的应用。', 'title_zh': '机械编程软生长机器人结构的横截面形状以实现患者转移'}
{'arxiv_id': 'arXiv:2505.13064', 'title': 'When do Lyapunov Subcenter Manifolds become Eigenmanifolds?', 'authors': 'Yannik P. Wotte, Arne Sachtler, Alin Albu-Schäffer, Stefano Stramigioli, Cosimo Della Santina', 'link': 'https://arxiv.org/abs/2505.13064', 'abstract': 'Multi-body mechanical systems have rich internal dynamics, which can be exploited to formulate efficient control targets. For periodic regulation tasks in robotics applications, this motivated the extension of the theory on nonlinear normal modes to Riemannian manifolds, and led to the definition of Eigenmanifolds. This definition is geometric, which is advantageous for generality within robotics but also obscures the connection of Eigenmanifolds to a large body of results from the literature on nonlinear dynamics. We bridge this gap, showing that Eigenmanifolds are instances of Lyapunov subcenter manifolds (LSMs), and that their stronger geometric properties with respect to LSMs follow from a time-symmetry of conservative mechanical systems. This directly leads to local existence and uniqueness results for Eigenmanifolds. Furthermore, we show that an additional spatial symmetry provides Eigenmanifolds with yet stronger properties of Rosenberg manifolds, which can be favorable for control applications, and we present a sufficient condition for their existence and uniqueness. These theoretical results are numerically confirmed on two mechanical systems with a non-constant inertia tensor: a double pendulum and a 5-link pendulum.', 'abstract_zh': '多体机械系统具有丰富的内在动力学，可用于制定高效的控制目标。对于机器人应用中的周期调节任务，这促使了关于非线性规范模式理论的扩展，将其推广到黎曼流形上，并定义了特征流形。该定义是几何性的，在机器人领域具有通用性，但也掩盖了特征流形与非线性动力学文献中大量结果之间的联系。我们弥合了这一差距，证明特征流形是Lyapunov子中心流形（LSMs）的实例，并且它们相对于LSMs的更强几何性质源自保守机械系统的时对称性。这直接导致了特征流形的局部存在性和唯一性结果。此外，我们证明了额外的空间对称性使得特征流形具有更强的Rosenberg流形性质，这在控制应用中可能有利，并且提供了它们存在性和唯一性的充分条件。这些理论结果在具有非恒定惯性张量的两个机械系统上通过数值方法得到了验证：双摆和5连杆摆。', 'title_zh': '当Lyapunov子中心流形成为特征流形？'}
{'arxiv_id': 'arXiv:2505.12525', 'title': 'Development of a non-wearable support robot capable of reproducing natural standing-up movements', 'authors': 'Atsuya Kusui, Susumu Hirai, Asuka Takai', 'link': 'https://arxiv.org/abs/2505.12525', 'abstract': "To reproduce natural standing-up motion, recent studies have emphasized the importance of coordination between the assisting robot and the human. However, many non-wearable assistive devices have struggled to replicate natural motion trajectories. While wearable devices offer better coordination with the human body, they present challenges in completely isolating mechanical and electrical hazards. To address this, we developed a novel standing-assist robot that integrates features of both wearable and non-wearable systems, aiming to achieve high coordination while maintaining safety. The device employs a four-link mechanism aligned with the human joint structure, designed to reproduce the S-shaped trajectory of the hip and the arc trajectory of the knee during natural standing-up motion. Subject-specific trajectory data were obtained using a gyroscope, and the link lengths were determined to drive the seat along the optimal path. A feedforward speed control using a stepping motor was implemented, and the reproducibility of the trajectory was evaluated based on the geometric constraints of the mechanism. A load-bearing experiment with weights fixed to the seat was conducted to assess the trajectory accuracy under different conditions. Results showed that the reproduction errors for the hip and knee trajectories remained within approximately 4 percent of the seat's total displacement, demonstrating high fidelity to the target paths. In addition, durability testing, thermal safety evaluation, and risk assessment confirmed the reliability and safety of the system for indoor use. These findings suggest that the proposed design offers a promising approach for developing assistive technologies that adapt to individual physical characteristics, with potential applications in elderly care and rehabilitation.", 'abstract_zh': '基于可穿戴与非穿戴系统融合的站立辅助机器人以再现自然站立动作', 'title_zh': '能够重现自然站立动作的非穿戴支持机器人'}
{'arxiv_id': 'arXiv:2505.13339', 'title': 'OPA-Pack: Object-Property-Aware Robotic Bin Packing', 'authors': 'Jia-Hui Pan, Yeok Tatt Cheah, Zhengzhe Liu, Ka-Hei Hui, Xiaojie Gao, Pheng-Ann Heng, Yun-Hui Liu, Chi-Wing Fu', 'link': 'https://arxiv.org/abs/2505.13339', 'abstract': 'Robotic bin packing aids in a wide range of real-world scenarios such as e-commerce and warehouses. Yet, existing works focus mainly on considering the shape of objects to optimize packing compactness and neglect object properties such as fragility, edibility, and chemistry that humans typically consider when packing objects. This paper presents OPA-Pack (Object-Property-Aware Packing framework), the first framework that equips the robot with object property considerations in planning the object packing. Technical-wise, we develop a novel object property recognition scheme with retrieval-augmented generation and chain-of-thought reasoning, and build a dataset with object property annotations for 1,032 everyday objects. Also, we formulate OPA-Net, aiming to jointly separate incompatible object pairs and reduce pressure on fragile objects, while compacting the packing. Further, OPA-Net consists of a property embedding layer to encode the property of candidate objects to be packed, together with a fragility heightmap and an avoidance heightmap to keep track of the packed objects. Then, we design a reward function and adopt a deep Q-learning scheme to train OPA-Net. Experimental results manifest that OPA-Pack greatly improves the accuracy of separating incompatible object pairs (from 52% to 95%) and largely reduces pressure on fragile objects (by 29.4%), while maintaining good packing compactness. Besides, we demonstrate the effectiveness of OPA-Pack on a real packing platform, showcasing its practicality in real-world scenarios.', 'abstract_zh': '面向物体属性感知的机器人包装框架（OPA-Pack）', 'title_zh': '基于对象属性的机器人Bins打包方法：OPA-Pack'}
{'arxiv_id': 'arXiv:2505.13253', 'title': 'Composing Dextrous Grasping and In-hand Manipulation via Scoring with a Reinforcement Learning Critic', 'authors': 'Lennart Röstel, Dominik Winkelbauer, Johannes Pitz, Leon Sievers, Berthold Bäuml', 'link': 'https://arxiv.org/abs/2505.13253', 'abstract': 'In-hand manipulation and grasping are fundamental yet often separately addressed tasks in robotics. For deriving in-hand manipulation policies, reinforcement learning has recently shown great success. However, the derived controllers are not yet useful in real-world scenarios because they often require a human operator to place the objects in suitable initial (grasping) states. Finding stable grasps that also promote the desired in-hand manipulation goal is an open problem. In this work, we propose a method for bridging this gap by leveraging the critic network of a reinforcement learning agent trained for in-hand manipulation to score and select initial grasps. Our experiments show that this method significantly increases the success rate of in-hand manipulation without requiring additional training. We also present an implementation of a full grasp manipulation pipeline on a real-world system, enabling autonomous grasping and reorientation even of unwieldy objects.', 'abstract_zh': '基于批评网络的抓取初始化方法以提升手持操作性能', 'title_zh': '基于强化学习批评家评分的灵巧抓取与在手操作compose'}
