{'arxiv_id': 'arXiv:2508.14763', 'title': 'Safe and Transparent Robots for Human-in-the-Loop Meat Processing', 'authors': 'Sagar Parekh, Casey Grothoff, Ryan Wright, Robin White, Dylan P. Losey', 'link': 'https://arxiv.org/abs/2508.14763', 'abstract': "Labor shortages have severely affected the meat processing sector. Automated technology has the potential to support the meat industry, assist workers, and enhance job quality. However, existing automation in meat processing is highly specialized, inflexible, and cost intensive. Instead of forcing manufacturers to buy a separate device for each step of the process, our objective is to develop general-purpose robotic systems that work alongside humans to perform multiple meat processing tasks. Through a recently conducted survey of industry experts, we identified two main challenges associated with integrating these collaborative robots alongside human workers. First, there must be measures to ensure the safety of human coworkers; second, the coworkers need to understand what the robot is doing. This paper addresses both challenges by introducing a safety and transparency framework for general-purpose meat processing robots. For safety, we implement a hand-detection system that continuously monitors nearby humans. This system can halt the robot in situations where the human comes into close proximity of the operating robot. We also develop an instrumented knife equipped with a force sensor that can differentiate contact between objects such as meat, bone, or fixtures. For transparency, we introduce a method that detects the robot's uncertainty about its performance and uses an LED interface to communicate that uncertainty to the human. Additionally, we design a graphical interface that displays the robot's plans and allows the human to provide feedback on the planned cut. Overall, our framework can ensure safe operation while keeping human workers in-the-loop about the robot's actions which we validate through a user study.", 'abstract_zh': '劳动力短缺严重冲击了肉类加工业。自动化技术有望支持肉类行业、辅助工人并提高工作质量。然而，现有的肉类加工自动化技术高度专门化、缺乏灵活性且成本高昂。我们旨在开发通用型机器人系统，与人类工人协同工作，同时执行多种肉类加工任务，而不是要求制造商为每一步骤购买独立设备。本文通过近期对行业专家的调查，识别出将这些协作机器人与人类工人结合时面临的两大挑战：首先，必须采取措施确保人类同事的安全；其次，同事需要理解机器人的行动。本文通过引入通用型肉类加工机器人安全与透明性框架来应对这两个挑战。在安全性方面，我们实现了一个手部检测系统，持续监测附近的人员，在人类接近操作机器人时使机器人暂停。我们还开发了一种带有力传感器的仪器刀，能够区分与肉类、骨骼或其他固定装置的接触。在透明性方面，我们引入了一种方法，用于检测机器人对其自身表现的不确定性，并使用LED界面向人类传达这种不确定性。此外，我们设计了一个图形界面，显示机器人的计划，并允许人类对计划切割提供反馈。总体而言，我们的框架可以在确保安全操作的同时，让人类工人了解机器人的行动，并通过用户研究进行了验证。', 'title_zh': '循环 human 在环肉类加工中安全透明的机器人系统'}
{'arxiv_id': 'arXiv:2508.14661', 'title': 'Consistent Pose Estimation of Unmanned Ground Vehicles through Terrain-Aided Multi-Sensor Fusion on Geometric Manifolds', 'authors': 'Alexander Raab, Stephan Weiss, Alessandro Fornasier, Christian Brommer, Abdalrahman Ibrahim', 'link': 'https://arxiv.org/abs/2508.14661', 'abstract': "Aiming to enhance the consistency and thus long-term accuracy of Extended Kalman Filters for terrestrial vehicle localization, this paper introduces the Manifold Error State Extended Kalman Filter (M-ESEKF). By representing the robot's pose in a space with reduced dimensionality, the approach ensures feasible estimates on generic smooth surfaces, without introducing artificial constraints or simplifications that may degrade a filter's performance. The accompanying measurement models are compatible with common loosely- and tightly-coupled sensor modalities and also implicitly account for the ground geometry. We extend the formulation by introducing a novel correction scheme that embeds additional domain knowledge into the sensor data, giving more accurate uncertainty approximations and further enhancing filter consistency. The proposed estimator is seamlessly integrated into a validated modular state estimation framework, demonstrating compatibility with existing implementations. Extensive Monte Carlo simulations across diverse scenarios and dynamic sensor configurations show that the M-ESEKF outperforms classical filter formulations in terms of consistency and stability. Moreover, it eliminates the need for scenario-specific parameter tuning, enabling its application in a variety of real-world settings.", 'abstract_zh': '面向陆地车辆定位的增强一致性与长期准确性扩展卡尔曼滤波方法：基于流形误差状态扩展卡尔曼滤波器（M-ESEKF）的研究', 'title_zh': '基于地形辅助多传感器融合几何流形上的一致轨迹估计'}
{'arxiv_id': 'arXiv:2508.14636', 'title': 'An Informative Planning Framework for Target Tracking and Active Mapping in Dynamic Environments with ASVs', 'authors': 'Sanjeev Ramkumar Sudha, Marija Popović, Erlend M. Coates', 'link': 'https://arxiv.org/abs/2508.14636', 'abstract': 'Mobile robot platforms are increasingly being used to automate information gathering tasks such as environmental monitoring. Efficient target tracking in dynamic environments is critical for applications such as search and rescue and pollutant cleanups. In this letter, we study active mapping of floating targets that drift due to environmental disturbances such as wind and currents. This is a challenging problem as it involves predicting both spatial and temporal variations in the map due to changing conditions. We propose an informative path planning framework to map an arbitrary number of moving targets with initially unknown positions in dynamic environments. A key component of our approach is a spatiotemporal prediction network that predicts target position distributions over time. We propose an adaptive planning objective for target tracking that leverages these predictions. Simulation experiments show that our proposed planning objective improves target tracking performance compared to existing methods that consider only entropy reduction as the planning objective. Finally, we validate our approach in field tests using an autonomous surface vehicle, showcasing its ability to track targets in real-world monitoring scenarios.', 'abstract_zh': '移动机器人平台被广泛用于自动化信息采集任务，如环境监测。在动态环境中高效的目标跟踪对于搜索救援和污染物清理等应用至关重要。本文研究了由于风、洋流等环境干扰导致漂移的浮动目标的主动映射问题。这是一个具有挑战性的问题，因为它涉及到因条件变化而产生的时空地图变化的预测。我们提出了一种信息路径规划框架，用于在动态环境中对具有未知初始位置的任意数量移动目标进行映射。我们方法的关键环节是一个时空预测网络，该网络预测目标位置随时间的变化分布。我们提出了一种适应性的规划目标，利用这些预测来进行目标跟踪。仿真实验表明，相比于仅考虑熵减少作为规划目标的现有方法，我们提出的方法改善了目标跟踪性能。最后，我们在实地测试中使用自主水面车辆验证了该方法，展示了其在实际监测场景中跟踪目标的能力。', 'title_zh': '基于ASV的动态环境中目标跟踪与主动建图的信息性规划框架'}
{'arxiv_id': 'arXiv:2508.14610', 'title': 'TRUST-Planner: Topology-guided Robust Trajectory Planner for AAVs with Uncertain Obstacle Spatial-temporal Avoidance', 'authors': 'Junzhi Li, Teng Long, Jingliang Sun, Jianxin Zhong', 'link': 'https://arxiv.org/abs/2508.14610', 'abstract': 'Despite extensive developments in motion planning of autonomous aerial vehicles (AAVs), existing frameworks faces the challenges of local minima and deadlock in complex dynamic environments, leading to increased collision risks. To address these challenges, we present TRUST-Planner, a topology-guided hierarchical planning framework for robust spatial-temporal obstacle avoidance. In the frontend, a dynamic enhanced visible probabilistic roadmap (DEV-PRM) is proposed to rapidly explore topological paths for global guidance. The backend utilizes a uniform terminal-free minimum control polynomial (UTF-MINCO) and dynamic distance field (DDF) to enable efficient predictive obstacle avoidance and fast parallel computation. Furthermore, an incremental multi-branch trajectory management framework is introduced to enable spatio-temporal topological decision-making, while efficiently leveraging historical information to reduce replanning time. Simulation results show that TRUST-Planner outperforms baseline competitors, achieving a 96\\% success rate and millisecond-level computation efficiency in tested complex environments. Real-world experiments further validate the feasibility and practicality of the proposed method.', 'abstract_zh': '基于拓扑引导的分层规划框架TRUST-Planner：稳健的空间-时间障碍规避', 'title_zh': 'TRUST-Planner：基于拓扑学的鲁棒轨迹规划器，用于具有不确定障碍物空间时间避免的AAVs'}
{'arxiv_id': 'arXiv:2508.14554', 'title': 'EAROL: Environmental Augmented Perception-Aware Planning and Robust Odometry via Downward-Mounted Tilted LiDAR', 'authors': 'Xinkai Liang, Yigu Ge, Yangxi Shi, Haoyu Yang, Xu Cao, Hao Fang', 'link': 'https://arxiv.org/abs/2508.14554', 'abstract': 'To address the challenges of localization drift and perception-planning coupling in unmanned aerial vehicles (UAVs) operating in open-top scenarios (e.g., collapsed buildings, roofless mazes), this paper proposes EAROL, a novel framework with a downward-mounted tilted LiDAR configuration (20° inclination), integrating a LiDAR-Inertial Odometry (LIO) system and a hierarchical trajectory-yaw optimization algorithm. The hardware innovation enables constraint enhancement via dense ground point cloud acquisition and forward environmental awareness for dynamic obstacle detection. A tightly-coupled LIO system, empowered by an Iterative Error-State Kalman Filter (IESKF) with dynamic motion compensation, achieves high level 6-DoF localization accuracy in feature-sparse environments. The planner, augmented by environment, balancing environmental exploration, target tracking precision, and energy efficiency. Physical experiments demonstrate 81% tracking error reduction, 22% improvement in perceptual coverage, and near-zero vertical drift across indoor maze and 60-meter-scale outdoor scenarios. This work proposes a hardware-algorithm co-design paradigm, offering a robust solution for UAV autonomy in post-disaster search and rescue missions. We will release our software and hardware as an open-source package for the community. Video: this https URL.', 'abstract_zh': '面向开放顶场景下无人机定位漂移与感知规划耦合挑战的EAROL新型框架：硬件-算法协同设计', 'title_zh': 'EAROL：环境增强感知aware规划与向下倾斜安装LiDAR的稳健 odometry'}
{'arxiv_id': 'arXiv:2508.14542', 'title': 'Taming VR Teleoperation and Learning from Demonstration for Multi-Task Bimanual Table Service Manipulation', 'authors': 'Weize Li, Zhengxiao Han, Lixin Xu, Xiangyu Chen, Harrison Bounds, Chenrui Zhang, Yifan Xu', 'link': 'https://arxiv.org/abs/2508.14542', 'abstract': 'This technical report presents the champion solution of the Table Service Track in the ICRA 2025 What Bimanuals Can Do (WBCD) competition. We tackled a series of demanding tasks under strict requirements for speed, precision, and reliability: unfolding a tablecloth (deformable-object manipulation), placing a pizza onto the table (pick-and-place), and opening and closing a food container with the lid. Our solution combines VR-based teleoperation and Learning from Demonstrations (LfD) to balance robustness and autonomy. Most subtasks were executed through high-fidelity remote teleoperation, while the pizza placement was handled by an ACT-based policy trained from 100 in-person teleoperated demonstrations with randomized initial configurations. By carefully integrating scoring rules, task characteristics, and current technical capabilities, our approach achieved both high efficiency and reliability, ultimately securing the first place in the competition.', 'abstract_zh': '本技术报告展示了在ICRA 2025 What Bimanuals Can Do (WBCD) 比赛中Table Service Track的冠军解决方案。我们针对严格的速度、精度和可靠性要求，应对了一系列挑战任务：铺设桌布（变形物体操作）、将披萨放在桌子上（抓取和放置）以及开启和关闭带盖的食物容器。我们的解决方案结合了基于VR的远程操作和学习从示范（LfD）技术，以平衡稳健性和自主性。大多数子任务通过高保真远程操作执行，而披萨放置任务则由一个基于ACT的策略处理，该策略是从100个随机初始配置的人工示范中训练得到的。通过仔细整合评分规则、任务特性及当前的技术能力，我们的方法在效率和可靠性方面都取得了优异成绩，最终赢得了比赛的第一名。', 'title_zh': '驯化VR远程操作并从演示学习以实现多任务双臂桌上传感器操作'}
{'arxiv_id': 'arXiv:2508.14381', 'title': 'FiReFly: Fair Distributed Receding Horizon Planning for Multiple UAVs', 'authors': 'Nicole Fronda, Bardh Hoxha, Houssam Abbas', 'link': 'https://arxiv.org/abs/2508.14381', 'abstract': "We propose injecting notions of fairness into multi-robot motion planning. When robots have competing interests, it is important to optimize for some kind of fairness in their usage of resources. In this work, we explore how the robots' energy expenditures might be fairly distributed among them, while maintaining mission success. We formulate a distributed fair motion planner and integrate it with safe controllers in a algorithm called FiReFly. For simulated reach-avoid missions, FiReFly produces fairer trajectories and improves mission success rates over a non-fair planner. We find that real-time performance is achievable up to 15 UAVs, and that scaling up to 50 UAVs is possible with trade-offs between runtime and fairness improvements.", 'abstract_zh': '我们将公平性概念注入到多机器人运动规划中。当机器人之间存在竞争利益时，优化它们对资源的使用公平性变得尤为重要。在本工作中，我们探讨了如何在保持任务成功的同时，公平地分配机器人的能量消耗。我们提出了一个分布式公平运动规划算法，并将其与安全控制器集成于名为FiReFly的算法中。对于模拟的接近-避免任务，FiReFly生成了更加公平的轨迹，并提高了任务成功率，超过了非公平规划器的表现。我们发现实时性能在15架无人机时是可行的，而在扩展到50架无人机时，可以通过牺牲运行时间和公平性改进来实现。', 'title_zh': 'FiReFly：公平分布式的回溯_horizon 计划算法在多无人机系统中的应用'}
{'arxiv_id': 'arXiv:2508.14355', 'title': 'D$^2$-LIO: Enhanced Optimization for LiDAR-IMU Odometry Considering Directional Degeneracy', 'authors': 'Guodong Yao, Hao Wang, Qing Chang', 'link': 'https://arxiv.org/abs/2508.14355', 'abstract': 'LiDAR-inertial odometry (LIO) plays a vital role in achieving accurate localization and mapping, especially in complex environments. However, the presence of LiDAR feature degeneracy poses a major challenge to reliable state estimation. To overcome this issue, we propose an enhanced LIO framework that integrates adaptive outlier-tolerant correspondence with a scan-to-submap registration strategy. The core contribution lies in an adaptive outlier removal threshold, which dynamically adjusts based on point-to-sensor distance and the motion amplitude of platform. This mechanism improves the robustness of feature matching in varying conditions. Moreover, we introduce a flexible scan-to-submap registration method that leverages IMU data to refine pose estimation, particularly in degenerate geometric configurations. To further enhance localization accuracy, we design a novel weighting matrix that fuses IMU preintegration covariance with a degeneration metric derived from the scan-to-submap process. Extensive experiments conducted in both indoor and outdoor environments-characterized by sparse or degenerate features-demonstrate that our method consistently outperforms state-of-the-art approaches in terms of both robustness and accuracy.', 'abstract_zh': 'LiDAR-惯性里程计（LIO）在实现精确定位和建图中起着关键作用，尤其是在复杂环境中。然而，LiDAR特征退化现象对可靠状态估计构成了重大挑战。为克服这一问题，我们提出了一种增强的LIO框架，该框架结合了自适应鲁棒对应关系和扫描到子地图注册策略。核心贡献在于一种自适应离群值移除阈值，该阈值根据点到传感器距离和平台的运动幅度动态调整，从而在不同条件下提高特征匹配的鲁棒性。此外，我们引入了一种灵活的扫描到子地图注册方法，该方法利用IMU数据来细化姿态估计，特别是在退化几何构型中。为了进一步提高定位精度，我们设计了一种新的加权矩阵，该矩阵将IMU前积分协方差与从扫描到子地图过程提取的退化度度量融合起来。在包括稀疏或退化特征在内的室内外环境中进行的广泛实验表明，我们的方法在鲁棒性和精度方面均优于现有先进方法。', 'title_zh': 'D$^2$-LIO：考虑方向退化时的LiDAR-IMU里程计增强优化'}
{'arxiv_id': 'arXiv:2508.14258', 'title': 'Adapting Biological Reflexes for Dynamic Reorientation in Space Manipulator Systems', 'authors': 'Daegyun Choi, Alhim Vera, Donghoon Kim', 'link': 'https://arxiv.org/abs/2508.14258', 'abstract': 'Robotic arms mounted on spacecraft, known as space manipulator systems (SMSs), are critical for enabling on-orbit assembly, satellite servicing, and debris removal. However, controlling these systems in microgravity remains a significant challenge due to the dynamic coupling between the manipulator and the spacecraft base. This study explores the potential of using biological inspiration to address this issue, focusing on animals, particularly lizards, that exhibit mid-air righting reflexes. Based on similarities between SMSs and these animals in terms of behavior, morphology, and environment, their air-righting motion trajectories are extracted from high-speed video recordings using computer vision techniques. These trajectories are analyzed within a multi-objective optimization framework to identify the key behavioral goals and assess their relative importance. The resulting motion profiles are then applied as reference trajectories for SMS control, with baseline controllers used to track them. The findings provide a step toward translating evolved animal behaviors into interpretable, adaptive control strategies for space robotics, with implications for improving maneuverability and robustness in future missions.', 'abstract_zh': '基于生物启发的空间操纵系统在微重力环境下空气翻转运动轨迹的研究及其在空间机器人控制中的应用', 'title_zh': '适应生物学反射的空间 manipulator 系统动态重定向'}
{'arxiv_id': 'arXiv:2508.14235', 'title': 'SLAM-based Safe Indoor Exploration Strategy', 'authors': 'Omar Mostafa, Nikolaos Evangeliou, Anthony Tzes', 'link': 'https://arxiv.org/abs/2508.14235', 'abstract': "This paper suggests a 2D exploration strategy for a planar space cluttered with obstacles. Rather than using point robots capable of adjusting their position and altitude instantly, this research is tailored to classical agents with circular footprints that cannot control instantly their pose. Inhere, a self-balanced dual-wheeled differential drive system is used to explore the place. The system is equipped with linear accelerometers and angular gyroscopes, a 3D-LiDAR, and a forward-facing RGB-D camera. The system performs RTAB-SLAM using the IMU and the LiDAR, while the camera is used for loop closures. The mobile agent explores the planar space using a safe skeleton approach that places the agent as far as possible from the static obstacles. During the exploration strategy, the heading is towards any offered openings of the space. This space exploration strategy has as its highest priority the agent's safety in avoiding the obstacles followed by the exploration of undetected space. Experimental studies with a ROS-enabled mobile agent are presented indicating the path planning strategy while exploring the space.", 'abstract_zh': '本文建议了一种用于充满障碍的平面空间的2D探索策略。该研究适用于无法即时控制姿态的经典圆形足式机器人，使用自平衡双轮差动驱动系统进行探索。该系统配备线性加速度计和角速率陀螺仪、3D-LiDAR以及前置RGB-D相机。系统使用IMU和LiDAR进行RTAB-SLAM，而相机用于环视闭合。移动代理使用安全骨架方法探索平面空间，尽可能远离静态障碍物。在探索策略中，方向指向空间中的任何开口。该空间探索策略的最高优先级是代理的安全性，以避免障碍物，其次是探索未发现的空间。呈现了使用ROS启用的移动代理的实验研究，表明在探索空间时的路径规划策略。', 'title_zh': '基于SLAM的安全室内探索策略'}
{'arxiv_id': 'arXiv:2508.14185', 'title': 'Lightweight Tracking Control for Computationally Constrained Aerial Systems with the Newton-Raphson Method', 'authors': 'Evanns Morales-Cuadrado, Luke Baird, Yorai Wardi, Samuel Coogan', 'link': 'https://arxiv.org/abs/2508.14185', 'abstract': "We investigate the performance of a lightweight tracking controller, based on a flow version of the Newton-Raphson method, applied to a miniature blimp and a mid-size quadrotor. This tracking technique has been shown to enjoy theoretical guarantees of performance and has been applied with success in simulation studies and on mobile robots with simple motion models. This paper investigates the technique through real-world flight experiments on aerial hardware platforms subject to realistic deployment and onboard computational constraints. The technique's performance is assessed in comparison with the established control frameworks of feedback linearization for the blimp, and nonlinear model predictive control for both quadrotor and blimp. The performance metrics under consideration are (i) root mean square error of flight trajectories with respect to target trajectories, (ii) algorithms' computation times, and (iii) CPU energy consumption associated with the control algorithms. The experimental findings show that the Newton-Raphson flow-based tracking controller achieves comparable or superior tracking performance to the baseline methods with substantially reduced computation time and energy expenditure.", 'abstract_zh': '我们调查了一种基于流版本的Newton-Raphson方法的轻量级跟踪控制器在微型气球和中型四旋翼无人机上的应用性能。', 'title_zh': '基于牛顿-拉夫森方法的计算受限空中系统轻量跟踪控制'}
{'arxiv_id': 'arXiv:2508.14096', 'title': 'Research on UAV Applications in Public Administration: Based on an Improved RRT Algorithm', 'authors': 'Zhanxi Xie, Baili Lu, Yanzhao Gu, Zikun Li, Junhao Wei, Ngai Cheong', 'link': 'https://arxiv.org/abs/2508.14096', 'abstract': "This study investigates the application of unmanned aerial vehicles (UAVs) in public management, focusing on optimizing path planning to address challenges such as energy consumption, obstacle avoidance, and airspace constraints. As UAVs transition from 'technical tools' to 'governance infrastructure', driven by advancements in low-altitude economy policies and smart city demands, efficient path planning becomes critical. The research proposes an enhanced Rapidly-exploring Random Tree algorithm (dRRT), incorporating four strategies: Target Bias (to accelerate convergence), Dynamic Step Size (to balance exploration and obstacle navigation), Detour Priority (to prioritize horizontal detours over vertical ascents), and B-spline smoothing (to enhance path smoothness). Simulations in a 500 m3 urban environment with randomized buildings demonstrate dRRT's superiority over traditional RRT, A*, and Ant Colony Optimization (ACO). Results show dRRT achieves a 100\\% success rate with an average runtime of 0.01468s, shorter path lengths, fewer waypoints, and smoother trajectories (maximum yaw angles <45°). Despite improvements, limitations include increased computational overhead from added mechanisms and potential local optima due to goal biasing. The study highlights dRRT's potential for efficient UAV deployment in public management scenarios like emergency response and traffic monitoring, while underscoring the need for integration with real-time obstacle avoidance frameworks. This work contributes to interdisciplinary advancements in urban governance, robotics, and computational optimization.", 'abstract_zh': '本研究探讨了无人机在公共管理中的应用，重点优化路径规划以应对能耗、障碍物规避和 airspace限制等挑战。随着无人机从“技术工具”转变为“治理基础设施”，受低空经济政策和智能城市需求推动，高效路径规划变得至关重要。研究提出了增强型快速扩展随机树算法（dRRT），结合了四种策略：目标偏置（加速收敛）、动态步长（平衡探索与障碍物导航）、绕行优先（优先水平绕行而非垂直上升）和B样条平滑（提高路径平滑度）。在具有随机建筑的500 m³城市环境中模拟结果显示，dRRT在成功率、运行时间、路径长度、航点数量和轨迹平滑度方面优于传统RRT、A*和蚂蚁 colony优化算法（ACO）。结果表明，dRRT 的成功率达到了100%，平均运行时间为0.01468秒，路径较短、航点较少且轨迹更加平滑（最大偏航角<45°）。尽管有所改进，但仍存在因增加机制而导致的计算开销增加以及目标偏置可能陷入局部最优的问题。本研究强调了dRRT在应急响应和交通监控等公共管理场景中高效无人机部署的潜力，并指出了与实时障碍物规避框架集成的必要性。本研究为城市治理、机器人技术和计算优化的跨学科进步做出了贡献。', 'title_zh': '基于改进RRT算法的无人机在公共管理中的应用研究'}
