{'arxiv_id': 'arXiv:2503.08545', 'title': 'Deformable Linear Object Surface Placement Using Elastica Planning and Local Shape Control', 'authors': 'I. Grinberg, A. Levin, E. D. Rimon', 'link': 'https://arxiv.org/abs/2503.08545', 'abstract': "Manipulation of deformable linear objects (DLOs) in constrained environments is a challenging task. This paper describes a two-layered approach for placing DLOs on a flat surface using a single robot hand. The high-level layer is a novel DLO surface placement method based on Euler's elastica solutions. During this process one DLO endpoint is manipulated by the robot gripper while a variable interior point of the DLO serves as the start point of the portion aligned with the placement surface. The low-level layer forms a pipeline controller. The controller estimates the DLO current shape using a Residual Neural Network (ResNet) and uses low-level feedback to ensure task execution in the presence of modeling and placement errors. The resulting DLO placement approach can recover from states where the high-level manipulation planner has failed as required by practical robot manipulation systems. The DLO placement approach is demonstrated with simulations and experiments that use silicon mock-up objects prepared for fresh food applications.", 'abstract_zh': '使用单个机器人手在受限环境中的可变形线性对象(DLOs)在平面上的放置：一种两层方法', 'title_zh': '可变形线性对象表面放置的弹性规划与局部形状控制'}
{'arxiv_id': 'arXiv:2503.08470', 'title': 'Automatic Robotic-Assisted Diffuse Reflectance Spectroscopy Scanning System', 'authors': 'Kaizhong Deng, Christopher J. Peters, George P. Mylonas, Daniel S. Elson', 'link': 'https://arxiv.org/abs/2503.08470', 'abstract': 'Diffuse Reflectance Spectroscopy (DRS) is a well-established optical technique for tissue composition assessment which has been clinically evaluated for tumour detection to ensure the complete removal of cancerous tissue. While point-wise assessment has many potential applications, incorporating automated large-area scanning would enable holistic tissue sampling with higher consistency. We propose a robotic system to facilitate autonomous DRS scanning with hybrid visual servoing control. A specially designed height compensation module enables precise contact condition control. The evaluation results show that the system can accurately execute the scanning command and acquire consistent DRS spectra with comparable results to the manual collection, which is the current gold standard protocol. Integrating the proposed system into surgery lays the groundwork for autonomous intra-operative DRS tissue assessment with high reliability and repeatability. This could reduce the need for manual scanning by the surgeon while ensuring complete tumor removal in clinical practice.', 'abstract_zh': '基于混合视觉伺服控制的机器人化弥散反射光谱成像系统', 'title_zh': '自动机器人辅助散射光谱扫描系统'}
{'arxiv_id': 'arXiv:2503.08222', 'title': 'Trajectory Optimization for In-Hand Manipulation with Tactile Force Control', 'authors': 'Haegu Lee, Yitaek Kim, Victor Melbye Staven, Christoffer Sloth', 'link': 'https://arxiv.org/abs/2503.08222', 'abstract': 'The strength of the human hand lies in its ability to manipulate small objects precisely and robustly. In contrast, simple robotic grippers have low dexterity and fail to handle small objects effectively. This is why many automation tasks remain unsolved by robots. This paper presents an optimization-based framework for in-hand manipulation with a robotic hand equipped with compact Magnetic Tactile Sensors (MTSs). The small form factor of the robotic hand from Shadow Robot introduces challenges in estimating the state of the object while satisfying contact constraints. To address this, we formulate a trajectory optimization problem using Nonlinear Programming (NLP) for finger movements while ensuring contact points to change along the geometry of the fingers. Using the optimized trajectory from the solver, we implement and test an open-loop controller for rolling motion. To further enhance robustness and accuracy, we introduce a force controller for the fingers and a state estimator for the object utilizing MTSs. The proposed framework is validated through comparative experiments, showing that incorporating the force control with compliance consideration improves the accuracy and robustness of the rolling motion. Rolling an object with the force controller is 30\\% more likely to succeed than running an open-loop controller. The demonstration video is available at this https URL.', 'abstract_zh': '基于优化的方法实现装备紧凑型磁触觉传感器的机器人手的在手操作', 'title_zh': '基于触觉力控制的手内操作轨迹优化'}
{'arxiv_id': 'arXiv:2503.08214', 'title': 'Safety-Ensured Control Framework for Robotic Endoscopic Task Automation', 'authors': 'Yitaek Kim, Iñigo Iturrate, Christoffer Sloth, Hansoul Kim', 'link': 'https://arxiv.org/abs/2503.08214', 'abstract': 'There is growing interest in automating surgical tasks using robotic systems, such as endoscopy for treating gastrointestinal (GI) cancer. However, previous studies have primarily focused on detecting and analyzing objects or robots, with limited attention to ensuring safety, which is critical for clinical applications, where accidents can be caused by unsafe robot motions. In this study, we propose a new control framework that can formally ensure the safety of automating certain processes involved in endoscopic submucosal dissection (ESD), a representative endoscopic surgical method for the treatment of early GI cancer, by using an endoscopic robot. The proposed framework utilizes Control Barrier Functions (CBFs) to accurately identify the boundaries of individual tumors, even in close proximity within the GI tract, ensuring precise treatment and removal while preserving the surrounding normal tissue. Additionally, by adopting a model-free control scheme, safety assurance is made possible even in endoscopic robotic systems where dynamic modeling is challenging. We demonstrate the proposed framework in cases where the tumors to be removed are close to each other, showing that the safety constraints are enforced. We show that the model-free CBF-based controlled robot eliminates one tumor completely without damaging it, while not invading another nearby tumor.', 'abstract_zh': '使用内窥镜机器人自动化早期胃肠癌内镜下粘膜下剥离术（ESD）过程中安全保障的新控制框架', 'title_zh': '基于安全保证的机器人内oscopic任务自动化控制框架'}
{'arxiv_id': 'arXiv:2503.08076', 'title': 'Efficient Trajectory Generation Based on Traversable Planes in 3D Complex Architectural Spaces', 'authors': 'Mengke Zhang, Zhihao Tian, Yaoguang Xia, Chao Xu, Fei Gao, Yanjun Cao', 'link': 'https://arxiv.org/abs/2503.08076', 'abstract': "With the increasing integration of robots into human life, their role in architectural spaces where people spend most of their time has become more prominent. While motion capabilities and accurate localization for automated robots have rapidly developed, the challenge remains to generate efficient, smooth, comprehensive, and high-quality trajectories in these areas. In this paper, we propose a novel efficient planner for ground robots to autonomously navigate in large complex multi-layered architectural spaces. Considering that traversable regions typically include ground, slopes, and stairs, which are planar or nearly planar structures, we simplify the problem to navigation within and between complex intersecting planes. We first extract traversable planes from 3D point clouds through segmenting, merging, classifying, and connecting to build a plane-graph, which is lightweight but fully represents the traversable regions. We then build a trajectory optimization based on motion state trajectory and fully consider special constraints when crossing multi-layer planes to maximize the robot's maneuverability. We conduct experiments in simulated environments and test on a CubeTrack robot in real-world scenarios, validating the method's effectiveness and practicality.", 'abstract_zh': '随着机器人在人类生活中集成度的不断增加，它们在人们 spending 大部分时间的建筑空间中的角色变得更加突出。虽然自动机器人在移动能力和精准定位方面迅速发展，但在这些区域生成高效、平滑、全面和高质量轨迹的挑战仍然存在。本文提出了一种新型高效的地面机器人自主导航规划器，用于在大型复杂的多层建筑空间中导航。考虑到可通行区域通常包括地面、斜坡和楼梯，这些结构通常是平面或几乎平面的结构，我们将问题简化为在复杂的相交平面内和之间的导航。首先，通过分割、合并、分类和连接从三维点云中提取可通行平面以构建轻量级但完全表示可通行区域的平面图。然后，基于运动状态轨迹进行轨迹优化，并在穿越多层平面时充分考虑特殊约束，以最大化机器人的机动性。我们在仿真环境中进行了实验，并在真实场景中测试了一款 CubeTrack 机器人，验证了该方法的有效性和实用性。', 'title_zh': '基于3D复杂建筑空间可通行平面的高效轨迹生成'}
{'arxiv_id': 'arXiv:2503.08029', 'title': 'Elastic Motion Policy: An Adaptive Dynamical System for Robust and Efficient One-Shot Imitation Learning', 'authors': 'Tianyu Li, Sunan Sun, Shubhodeep Shiv Aditya, Nadia Figueroa', 'link': 'https://arxiv.org/abs/2503.08029', 'abstract': 'Behavior cloning (BC) has become a staple imitation learning paradigm in robotics due to its ease of teaching robots complex skills directly from expert demonstrations. However, BC suffers from an inherent generalization issue. To solve this, the status quo solution is to gather more data. Yet, regardless of how much training data is available, out-of-distribution performance is still sub-par, lacks any formal guarantee of convergence and success, and is incapable of allowing and recovering from physical interactions with humans. These are critical flaws when robots are deployed in ever-changing human-centric environments. Thus, we propose Elastic Motion Policy (EMP), a one-shot imitation learning framework that allows robots to adjust their behavior based on the scene change while respecting the task specification. Trained from a single demonstration, EMP follows the dynamical systems paradigm where motion planning and control are governed by first-order differential equations with convergence guarantees. We leverage Laplacian editing in full end-effector space, $\\mathbb{R}^3\\times SO(3)$, and online convex learning of Lyapunov functions, to adapt EMP online to new contexts, avoiding the need to collect new demonstrations. We extensively validate our framework in real robot experiments, demonstrating its robust and efficient performance in dynamic environments, with obstacle avoidance and multi-step task capabilities. Project Website: this https URL', 'abstract_zh': '行为克隆(BC)已成为机器人领域常用的模仿学习范式，因为它可以直接从专家演示中教授机器人复杂的技能。然而，BC 存在固有的泛化问题。为了解决这一问题，现有解决方案是收集更多数据。然而，无论训练数据量多大，其在分布外的表现仍然不尽如人意，缺乏任何正式收敛和成功的保证，也无法从与人类的物理互动中适应和恢复。当机器人部署在不断变化的人本环境中时，这是关键缺陷。因此，我们提出了一种弹性运动策略(EMP)，这是一种允许机器人根据场景变化调整其行为并尊重任务规范的一次性模仿学习框架。从单一演示中训练，EMP 遵循动力系统范式，其中运动规划和控制由具有收敛保证的一阶微分方程控制。我们利用全末端执行器空间中的拉普拉斯编辑，$\\mathbb{R}^3 \\times SO(3)$，以及在线凸学习李雅普un夫函数，来在线适应EMP到新场景，避免收集新演示的需要。我们通过真实机器人实验广泛验证了该框架，展示了其在动态环境中的稳健和高效性能，具备障碍物规避和多步任务能力。项目网站: [this https URL](this https URL)', 'title_zh': '弹性运动策略：一种用于鲁棒且高效的一次性模仿学习的自适应动力系统'}
{'arxiv_id': 'arXiv:2503.07989', 'title': 'Bio-Skin: A Cost-Effective Thermostatic Tactile Sensor with Multi-Modal Force and Temperature Detection', 'authors': 'Haoran Guo, Haoyang Wang, Zhengxiong Li, Lingfeng Tao', 'link': 'https://arxiv.org/abs/2503.07989', 'abstract': "Tactile sensors can significantly enhance the perception of humanoid robotics systems by providing contact information that facilitates human-like interactions. However, existing commercial tactile sensors focus on improving the resolution and sensitivity of single-modal detection with high-cost components and densely integrated design, incurring complex manufacturing processes and unaffordable prices. In this work, we present Bio-Skin, a cost-effective multi-modal tactile sensor that utilizes single-axis Hall-effect sensors for planar normal force measurement and bar-shape piezo resistors for 2D shear force measurement. A thermistor coupling with a heating wire is integrated into a silicone body to achieve temperature sensation and thermostatic function analogous to human skin. We also present a cross-reference framework to validate the two modalities of the force sensing signal, improving the sensing fidelity in a complex electromagnetic environment. Bio-Skin has a multi-layer design, and each layer is manufactured sequentially and subsequently integrated, thereby offering a fast production pathway. After calibration, Bio-Skin demonstrates performance metrics-including signal-to-range ratio, sampling rate, and measurement range-comparable to current commercial products, with one-tenth of the cost. The sensor's real-world performance is evaluated using an Allegro hand in object grasping tasks, while its temperature regulation functionality was assessed in a material detection task.", 'abstract_zh': '触觉传感器可以显著增强类人机器人系统的感知能力，通过提供有助于类人交互的接触信息。然而，现有的商用触觉传感器侧重于通过高成本组件和密集集成设计提升单模态检测的分辨率和敏感度，导致复杂的制造过程和高昂的价格。本文中，我们提出了一种经济有效的多模态触觉传感器Bio-Skin，利用单轴霍尔效应传感器进行平面法向力测量，使用棒状压电电阻器进行二维切向力测量。将热电阻与加热线集成到硅胶体内，以实现类似于人类皮肤的温觉和温控功能。我们也提出了一种交叉引用框架来验证力感受信号的两种模态，从而在复杂电磁环境中提高感知精度。Bio-Skin具有多层设计，每层依次制造并集成，从而提供快速的生产路径。校准后，Bio-Skin在信号/距离比、采样率和测量范围等方面的性能指标与当前商用产品相当，但成本仅为十分之一。使用Allegro手在物体抓取任务中评估传感器的实际性能，同时通过材料检测任务评估其温度调节功能。', 'title_zh': '生物皮肤：一种多模态力和温度检测的低成本热控触觉传感器'}
{'arxiv_id': 'arXiv:2503.07986', 'title': 'HEATS: A Hierarchical Framework for Efficient Autonomous Target Search with Mobile Manipulators', 'authors': 'Hao Zhang, Yifei Wang, Weifan Zhang, Yu Wang, Haoyao Chen', 'link': 'https://arxiv.org/abs/2503.07986', 'abstract': 'Utilizing robots for autonomous target search in complex and unknown environments can greatly improve the efficiency of search and rescue missions. However, existing methods have shown inadequate performance due to hardware platform limitations, inefficient viewpoint selection strategies, and conservative motion planning. In this work, we propose HEATS, which enhances the search capability of mobile manipulators in complex and unknown environments. We design a target viewpoint planner tailored to the strengths of mobile manipulators, ensuring efficient and comprehensive viewpoint planning. Supported by this, a whole-body motion planner integrates global path search with local IPC optimization, enabling the mobile manipulator to safely and agilely visit target viewpoints, significantly improving search performance. We present extensive simulated and real-world tests, in which our method demonstrates reduced search time, higher target search completeness, and lower movement cost compared to classic and state-of-the-art approaches. Our method will be open-sourced for community benefit.', 'abstract_zh': '利用机器人在复杂未知环境中自主目标搜索可以大幅提高搜救任务的效率。然而，现有方法因硬件平台限制、低效的视角选择策略以及保守的运动规划而表现出不足。在本工作中，我们提出了HEATS，以增强移动 manipulator 在复杂未知环境中的搜索能力。我们设计了一种针对移动 manipulator 特点的目标视角规划器，确保高效且全面的视角规划。通过这一规划器的支持，全身运动规划器将全局路径搜索与局部 IPC 优化相结合，使移动 manipulator 能够安全且灵活地访问目标视角，显著提高搜索性能。我们在广泛的模拟和实际测试中展示了本方法相比经典和最先进的方法具有更短的搜索时间、更高的目标搜索完整性和更低的运动成本。本方法将开源以造福社区。', 'title_zh': 'HEATS：一种高效的自主目标搜索层次框架（基于移动 manipulator）'}
{'arxiv_id': 'arXiv:2503.07963', 'title': 'Hierarchical Contact-Rich Trajectory Optimization for Multi-Modal Manipulation using Tight Convex Relaxations', 'authors': 'Yuki Shirai, Arvind Raghunathan, Devesh K. Jha', 'link': 'https://arxiv.org/abs/2503.07963', 'abstract': 'Designing trajectories for manipulation through contact is challenging as it requires reasoning of object \\& robot trajectories as well as complex contact sequences simultaneously. In this paper, we present a novel framework for simultaneously designing trajectories of robots, objects, and contacts efficiently for contact-rich manipulation. We propose a hierarchical optimization framework where Mixed-Integer Linear Program (MILP) selects optimal contacts between robot \\& object using approximate dynamical constraints, and then a NonLinear Program (NLP) optimizes trajectory of the robot(s) and object considering full nonlinear constraints. We present a convex relaxation of bilinear constraints using binary encoding technique such that MILP can provide tighter solutions with better computational complexity. The proposed framework is evaluated on various manipulation tasks where it can reason about complex multi-contact interactions while providing computational advantages. We also demonstrate our framework in hardware experiments using a bimanual robot system.', 'abstract_zh': '通过接触进行操作的轨迹设计具有挑战性，因为它需要同时推理物体和机器人轨迹以及复杂的接触序列。本文提出了一种新型框架，用于高效同时设计机器人、物体和接触的轨迹，以应对富含接触的操作需求。我们提出了一种层次优化框架，其中混合整数线性规划（MILP）使用近似动力学约束选择机器人与物体之间的最优接触点，然后使用非线性规划（NLP）在全面考虑非线性约束的情况下优化机器人和物体的轨迹。我们使用二进制编码技术对双线性约束进行凸松弛处理，使得MILP能够提供更紧致的解决方案，且具有更好的计算复杂度。所提出框架已在多种操作任务中进行评估，能够处理复杂的多接触交互，同时提供计算优势。我们还在双臂机器人系统中进行了硬件实验，验证了所提出框架的有效性。', 'title_zh': '多模态操作中基于紧密凸松弛的层次密集接触轨迹优化'}
{'arxiv_id': 'arXiv:2503.07900', 'title': 'A Landmark-Aided Navigation Approach Using Side-Scan Sonar', 'authors': 'Ellen Davenport, Khoa Nguyen, Junsu Jang, Clair Ma, Sean Fish, Luc Lenain, Florian Meyer', 'link': 'https://arxiv.org/abs/2503.07900', 'abstract': 'Cost-effective localization methods for Autonomous Underwater Vehicle (AUV) navigation are key for ocean monitoring and data collection at high resolution in time and space. Algorithmic solutions suitable for real-time processing that handle nonlinear measurement models and different forms of measurement uncertainty will accelerate the development of field-ready technology. This paper details a Bayesian estimation method for landmark-aided navigation using a Side-scan Sonar (SSS) sensor. The method bounds navigation filter error in the GPS-denied undersea environment and captures the highly nonlinear nature of slant range measurements while remaining computationally tractable. Combining a novel measurement model with the chosen statistical framework facilitates the efficient use of SSS data and, in the future, could be used in real time. The proposed filter has two primary steps: a prediction step using an unscented transform and an update step utilizing particles. The update step performs probabilistic association of sonar detections with known landmarks. We evaluate algorithm performance and tractability using synthetic data and real data collected field experiments. Field experiments were performed using two different marine robotic platforms with two different SSS and at two different sites. Finally, we discuss the computational requirements of the proposed method and how it extends to real-time applications.', 'abstract_zh': '自主水下vehicle (AUV) 导航的经济高效定位方法对于海洋监测和高时空分辨率数据收集至关重要。适用于实时处理且能够处理非线性测量模型和不同形式测量不确定性的算法解决方案将加速现场可用技术的发展。本文详细介绍了使用侧扫声呐 (SSS) 传感器的地标辅助导航的贝叶斯估计方法。该方法在GPS受限的海底环境中界定了导航滤波器误差，并捕捉斜距测量的高度非线性特性，同时保持计算上的可行性。结合新颖的测量模型与选定的统计框架，便于有效地利用SSS数据，未来可能实现实时应用。所提出的滤波器有两个主要步骤：使用无迹变换的预测步骤和利用粒子的更新步骤。更新步骤执行声呐检测与已知地标之间概率关联。我们使用合成数据和实地实验收集的真实数据评估算法性能和可行性。实地实验使用了两种不同的海洋机器人平台和两种不同的SSS，在两个不同的地点进行。最后，我们讨论了所提出方法的计算需求及其如何扩展到实时应用。', 'title_zh': '基于地标辅助的侧扫声纳导航方法'}
{'arxiv_id': 'arXiv:2503.07855', 'title': 'Evaluating Path Planning Strategies for Efficient Nitrate Sampling in Crop Rows', 'authors': 'Ruiji Liu, Abigail Breitfeld, Srinivasan Vijayarangan, George Kantor, Francisco Yandun', 'link': 'https://arxiv.org/abs/2503.07855', 'abstract': 'This paper presents a pipeline that combines high-resolution orthomosaic maps generated from UAS imagery with GPS-based global navigation to guide a skid-steered ground robot. We evaluated three path planning strategies: A* Graph search, Deep Q-learning (DQN) model, and Heuristic search, benchmarking them on planning time and success rate in realistic simulation environments. Experimental results reveal that the Heuristic search achieves the fastest planning times (0.28 ms) and a 100% success rate, while the A* approach delivers near-optimal performance, and the DQN model, despite its adaptability, incurs longer planning delays and occasional suboptimal routing. These results highlight the advantages of deterministic rule-based methods in geometrically constrained crop-row environments and lay the groundwork for future hybrid strategies in precision agriculture.', 'abstract_zh': '基于UAS影像和GPS全局导航的高分辨率正射影像管道引导滑移转向地面机器人路径规划研究', 'title_zh': '评估作物行中高效硝酸盐采样路径规划策略'}
{'arxiv_id': 'arXiv:2503.07762', 'title': 'Multi-layer Motion Planning with Kinodynamic and Spatio-Temporal Constraints', 'authors': 'Jeel Chatrola, Abhiroop Ajith, Kevin Leahy, Constantinos Chamzas', 'link': 'https://arxiv.org/abs/2503.07762', 'abstract': 'We propose a novel, multi-layered planning approach for computing paths that satisfy both kinodynamic and spatiotemporal constraints. Our three-part framework first establishes potential sequences to meet spatial constraints, using them to calculate a geometric lead path. This path then guides an asymptotically optimal sampling-based kinodynamic planner, which minimizes an STL-robustness cost to jointly satisfy spatiotemporal and kinodynamic constraints. In our experiments, we test our method with a velocity-controlled Ackerman-car model and demonstrate significant efficiency gains compared to prior art. Additionally, our method is able to generate complex path maneuvers, such as crossovers, something that previous methods had not demonstrated.', 'abstract_zh': '我们提出了一种新颖的多层规划方法，用于计算同时满足时空和动力学约束的路径。我们的三部分框架首先建立潜在序列以满足空间约束，并使用这些序列计算一个几何先导路径。该路径随后引导一个渐近最优的基于采样的动力学规划器，该规划器最小化一种STL稳健性成本，以同时满足时空和动力学约束。在我们的实验中，我们使用速度可控的Ackerman车模型测试了我们的方法，并与现有技术相比展示了显著的效率提升。此外，我们的方法能够生成复杂的路径操作，如交叉操作，这是以前的方法所未能实现的。', 'title_zh': '多层动力学与时空约束运动规划'}
{'arxiv_id': 'arXiv:2503.07757', 'title': 'Focused Blind Switching Manipulation Based on Constrained and Regional Touch States of Multi-Fingered Hand Using Deep Learning', 'authors': 'Satoshi Funabashi, Atsumu Hiramoto, Naoya Chiba, Alexander Schmitz, Shardul Kulkarni, Tetsuya Ogata', 'link': 'https://arxiv.org/abs/2503.07757', 'abstract': 'To achieve a desired grasping posture (including object position and orientation), multi-finger motions need to be conducted according to the the current touch state. Specifically, when subtle changes happen during correcting the object state, not only proprioception but also tactile information from the entire hand can be beneficial. However, switching motions with high-DOFs of multiple fingers and abundant tactile information is still challenging. In this study, we propose a loss function with constraints of touch states and an attention mechanism for focusing on important modalities depending on the touch states. The policy model is AE-LSTM which consists of Autoencoder (AE) which compresses abundant tactile information and Long Short-Term Memory (LSTM) which switches the motion depending on the touch states. Motion for cap-opening was chosen as a target task which consists of subtasks of sliding an object and opening its cap. As a result, the proposed method achieved the best success rates with a variety of objects for real time cap-opening manipulation. Furthermore, we could confirm that the proposed model acquired the features of each subtask and attention on specific modalities.', 'abstract_zh': '为了实现期望的抓取姿态（包括物体的位置和方向），需要根据当前触觉状态调整多指运动。具体来说，当在纠正物体状态时发生细微变化时，不仅需要利用本体感受，还需要利用手部的整体触觉信息。然而，针对多指高自由度运动和丰富触觉信息进行切换仍然很具有挑战性。本研究提出了一种具有触觉状态约束的损失函数和一种注意力机制，以根据触觉状态聚焦于重要模态。该策略模型为AE-LSTM，由自动编码器（AE）压缩丰富触觉信息和长短期记忆网络（LSTM）根据触觉状态切换运动组成。以瓶盖打开作为目标任务，该任务包含滑动物体和打开瓶盖的子任务。结果表明，所提出的方法在多种物体的实时瓶盖操作中实现了最高的成功率。此外，我们证实所提出模型学会了每个子任务的特征并专注于特定模态。', 'title_zh': '基于多指手受限区域触觉状态的集中盲切换操作 manipulation 用深度学习实现'}
{'arxiv_id': 'arXiv:2503.08106', 'title': 'Control Barrier Functions for Prescribed-time Reach-Avoid-Stay Tasks using Spatiotemporal Tubes', 'authors': 'Ratnangshu Das, Pranav Bakshi, Pushpak Jagtap', 'link': 'https://arxiv.org/abs/2503.08106', 'abstract': 'Prescribed-time reach-avoid-stay (PT-RAS) specifications are crucial in applications requiring precise timing, state constraints, and safety guarantees. While control carrier functions (CBFs) have emerged as a promising approach, providing formal guarantees of safety, constructing CBFs that satisfy PT-RAS specifications remains challenging. In this paper, we present a novel approach using a spatiotemporal tubes (STTs) framework to construct CBFs for PT-RAS tasks. The STT framework allows for the systematic design of CBFs that dynamically manage both spatial and temporal constraints, ensuring the system remains within a safe operational envelope while achieving the desired temporal objectives. The proposed method is validated with two case studies: temporal motion planning of an omnidirectional robot and temporal waypoint navigation of a drone with obstacles, using higher-order CBFs.', 'abstract_zh': '基于时空管的 Prescribed 时间到达-避免-驻留 (PT-RAS) 控制载荷函数合成方法', 'title_zh': '基于时空管的指定时间达到避免停留任务的控制障碍函数方法'}
{'arxiv_id': 'arXiv:2503.07777', 'title': 'Serious Play to Encourage Socialization between Unfamiliar Children Facilitated by a LEGO Robot', 'authors': 'Nicklas Lind, Nilan Paramarajah, Timothy Merritt', 'link': 'https://arxiv.org/abs/2503.07777', 'abstract': "Socialization is an essential development skill for preschool children. In collaboration with the LEGO Group, we developed Robert Robot, a simplified robot, which enables socialization between children and facilitates shared experiences when meeting for the first time. An exploratory study to observe socialization between preschool children was conducted with 30 respondents in pairs. Additionally, observational data from 212 play sessions with four Robert Robots in the wild were collected. Subsequent analysis found that children have fun as Robert Robot breaks the ice between unfamiliar children. The children relayed audio cues related to the imaginative world of Robert Robot's personalities and mimicked each other as a method of initiating social play and communication with their unfamiliar peers. Furthermore, the study contributes four implications for the design of robots for socialization between children. This chapter provides an example case of serious storytelling using playful interactions engaging children with the character of the robot and the mini-narratives around the build requests.", 'abstract_zh': '社交化是学前儿童发展的一项重要技能。与乐高集团合作，我们开发了罗伯特机器人，一种简化版的机器人，它能够促进儿童之间的社交互动，并帮助初次见面的儿童共同体验。一项探索性研究观察了30对学前儿童之间的社交互动，此外，还收集了212场配备四台罗伯特机器人的自然玩乐会 observational 数据。后续分析发现，当罗伯特机器人打破陌生儿童之间的冰点时，儿童感到很有趣。儿童通过传递与罗伯特机器人性格相关的声音提示，并模仿彼此，以引发与陌生同伴的社交游戏和交流。此外，这项研究为设计促进儿童之间社交互动的机器人提供了四个设计建议。本章节提供了通过有趣互动吸引儿童参与机器人角色及其构建请求的小故事示例。', 'title_zh': '通过LEGO机器人促进陌生儿童社交的严肃游戏'}
{'arxiv_id': 'arXiv:2503.07737', 'title': 'A Simple Approach to Constraint-Aware Imitation Learning with Application to Autonomous Racing', 'authors': 'Shengfan Cao, Eunhyek Joa, Francesco Borrelli', 'link': 'https://arxiv.org/abs/2503.07737', 'abstract': "Guaranteeing constraint satisfaction is challenging in imitation learning (IL), particularly in tasks that require operating near a system's handling limits. Traditional IL methods often struggle to enforce constraints, leading to suboptimal performance in high-precision tasks. In this paper, we present a simple approach to incorporating safety into the IL objective. Through simulations, we empirically validate our approach on an autonomous racing task with both full-state and image feedback, demonstrating improved constraint satisfaction and greater consistency in task performance compared to a baseline method.", 'abstract_zh': '确保约束满足在模仿学习中具有挑战性，特别是在系统操作极限附近执行任务时。传统的模仿学习方法往往难以强制执行约束，导致在高精度任务中表现出色。在本文中，我们提出了一种将安全性纳入模仿学习目标的简单方法。通过仿真，我们在配备全状态和图像反馈的自主赛车任务中 empirically 验证了该方法的有效性，结果显示约束满足程度提高且任务性能更为一致，相比基准方法具有显著优势。', 'title_zh': '具有约束意识的模仿学习的简单方法及其在自主赛车中的应用'}
