{'arxiv_id': 'arXiv:2511.15520', 'title': 'Theoretical Closed-loop Stability Bounds for Dynamical System Coupled with Diffusion Policies', 'authors': 'Gabriel Lauzier, Alexandre Girard, François Ferland', 'link': 'https://arxiv.org/abs/2511.15520', 'abstract': 'Diffusion Policy has shown great performance in robotic manipulation tasks under stochastic perturbations, due to its ability to model multimodal action distributions. Nonetheless, its reliance on a computationally expensive reverse-time diffusion (denoising) process, for action inference, makes it challenging to use for real-time applications where quick decision-making is mandatory. This work studies the possibility of conducting the denoising process only partially before executing an action, allowing the plant to evolve according to its dynamics in parallel to the reverse-time diffusion dynamics ongoing on the computer. In a classical diffusion policy setting, the plant dynamics are usually slow and the two dynamical processes are uncoupled. Here, we investigate theoretical bounds on the stability of closed-loop systems using diffusion policies when the plant dynamics and the denoising dynamics are coupled. The contribution of this work gives a framework for faster imitation learning and a metric that yields if a controller will be stable based on the variance of the demonstrations.', 'abstract_zh': '扩散策略在随机扰动下的机器人 manipulation 任务中表现出色，得益于其能够建模多模态动作分布的能力。然而，其依赖于计算成本高昂的逆时扩散（去噪）过程，用于动作推断，这使其难以应用于要求快速决策的实时应用。本文研究了在执行动作之前仅部分进行去噪过程的可能性，允许执行动作的系统根据其动力学与计算机上的逆时扩散动力学并行演化。在传统的扩散策略设置中，系统动力学通常较慢且两者不耦合。本文探讨了当系统动力学和去噪动力学耦合时，使用扩散策略的闭环系统稳定性理论界。本文的贡献提供了一种更快速的模仿学习框架以及一个基于示范方差的稳定性评估指标。', 'title_zh': '带有扩散策略耦合的动力系统闭环稳定性理论界值'}
{'arxiv_id': 'arXiv:2511.15414', 'title': 'RRT*former: Environment-Aware Sampling-Based Motion Planning using Transformer', 'authors': 'Mingyang Feng, Shaoyuan Li, Xiang Yin', 'link': 'https://arxiv.org/abs/2511.15414', 'abstract': 'We investigate the sampling-based optimal path planning problem for robotics in complex and dynamic environments. Most existing sampling-based algorithms neglect environmental information or the information from previous samples. Yet, these pieces of information are highly informative, as leveraging them can provide better heuristics when sampling the next state. In this paper, we propose a novel sampling-based planning algorithm, called \\emph{RRT*former}, which integrates the standard RRT* algorithm with a Transformer network in a novel way. Specifically, the Transformer is used to extract features from the environment and leverage information from previous samples to better guide the sampling process. Our extensive experiments demonstrate that, compared to existing sampling-based approaches such as RRT*, Neural RRT*, and their variants, our algorithm achieves considerable improvements in both the optimality of the path and sampling efficiency. The code for our implementation is available on this https URL.', 'abstract_zh': '基于采样的机器人在复杂动态环境中的最优路径规划问题研究：一种新型的结合Transformer网络的RRT*算法', 'title_zh': 'RRT*former: 基于环境aware采样并使用Transformer的运动规划'}
{'arxiv_id': 'arXiv:2511.15274', 'title': 'Behavior Trees vs Executable Ontologies: a Comparative Analysis of Robot Control Paradigms', 'authors': 'Alexander Boldachev', 'link': 'https://arxiv.org/abs/2511.15274', 'abstract': 'This paper compares two distinct approaches to modeling robotic behavior: imperative Behavior Trees (BTs) and declarative Executable Ontologies (EO), implemented through the boldsea framework. BTs structure behavior hierarchically using control-flow, whereas EO represents the domain as a temporal, event-based semantic graph driven by dataflow rules. We demonstrate that EO achieves comparable reactivity and modularity to BTs through a fundamentally different architecture: replacing polling-based tick execution with event-driven state propagation. We propose that EO offers an alternative framework, moving from procedural programming to semantic domain modeling, to address the semantic-process gap in traditional robotic control. EO supports runtime model modification, full temporal traceability, and a unified representation of data, logic, and interface - features that are difficult or sometimes impossible to achieve with BTs, although BTs excel in established, predictable scenarios. The comparison is grounded in a practical mobile manipulation task. This comparison highlights the respective operational strengths of each approach in dynamic, evolving robotic systems.', 'abstract_zh': '本文比较了两种不同的机器人行为建模方法：命令式的Behavior Trees (BTs)和声明式的Executable Ontologies (EO)，并通过boldsea框架实现。BTs通过控制流将行为分层结构化，而EO则通过数据流规则表示领域为基于事件的时间语义图。我们通过根本不同的架构展示了EO能够达到与BTs相当的反应性和模块性：用事件驱动的状态传播替换基于轮询的时钟执行。我们提出，EO提供了一种替代框架，从过程编程转向语义领域建模，以解决传统机器人控制中的语义-过程差距。EO支持运行时模型修改、完整的时态可追踪性以及数据、逻辑和界面的统一表示——这些功能在某些情况下对于BTs来说难以实现或根本无法实现，尽管BTs在传统的、可预测的场景中表现出色。此比较基于一个实际的移动操作任务。该比较突显了每种方法在动态演变的机器人系统中的各自操作优势。', 'title_zh': '行为树 vs 可执行本体：机器人控制范式的比较分析'}
{'arxiv_id': 'arXiv:2511.15194', 'title': 'Eq.Bot: Enhance Robotic Manipulation Learning via Group Equivariant Canonicalization', 'authors': 'Jian Deng, Yuandong Wang, Yangfu Zhu, Tao Feng, Tianyu Wo, Zhenzhou Shao', 'link': 'https://arxiv.org/abs/2511.15194', 'abstract': 'Robotic manipulation systems are increasingly deployed across diverse domains. Yet existing multi-modal learning frameworks lack inherent guarantees of geometric consistency, struggling to handle spatial transformations such as rotations and translations. While recent works attempt to introduce equivariance through bespoke architectural modifications, these methods suffer from high implementation complexity, computational cost, and poor portability. Inspired by human cognitive processes in spatial reasoning, we propose this http URL, a universal canonicalization framework grounded in SE(2) group equivariant theory for robotic manipulation learning. Our framework transforms observations into a canonical space, applies an existing policy, and maps the resulting actions back to the original space. As a model-agnostic solution, this http URL aims to endow models with spatial equivariance without requiring architectural modifications. Extensive experiments demonstrate the superiority of this http URL under both CNN-based (e.g., CLIPort) and Transformer-based (e.g., OpenVLA-OFT) architectures over existing methods on various robotic manipulation tasks, where the most significant improvement can reach 50.0%.', 'abstract_zh': '基于SE(2)群不变理论的通用标准化框架：用于机器人 manipulation 学习的空间不变性赋能', 'title_zh': 'Eq.Bot: 通过群不变化标准化提高机器人操作学习 efficiency'}
