{'arxiv_id': 'arXiv:2511.07418', 'title': 'Lightning Grasp: High Performance Procedural Grasp Synthesis with Contact Fields', 'authors': 'Zhao-Heng Yin, Pieter Abbeel', 'link': 'https://arxiv.org/abs/2511.07418', 'abstract': 'Despite years of research, real-time diverse grasp synthesis for dexterous hands remains an unsolved core challenge in robotics and computer graphics. We present Lightning Grasp, a novel high-performance procedural grasp synthesis algorithm that achieves orders-of-magnitude speedups over state-of-the-art approaches, while enabling unsupervised grasp generation for irregular, tool-like objects. The method avoids many limitations of prior approaches, such as the need for carefully tuned energy functions and sensitive initialization. This breakthrough is driven by a key insight: decoupling complex geometric computation from the search process via a simple, efficient data structure - the Contact Field. This abstraction collapses the problem complexity, enabling a procedural search at unprecedented speeds. We open-source our system to propel further innovation in robotic manipulation.', 'abstract_zh': '尽管多年研究，灵巧手的实时多样抓取合成仍然是机器人学和计算机图形学中的一个未解决的核心挑战。我们提出了一种名为Lightning Grasp的新型高性能过程化抓取合成算法，该算法在保持与最新方法相当的抓取质量的同时，实现了数量级的速度提升，并能够无监督生成不规则工具型物体的抓取。该方法克服了以往方法的许多局限性，如需要精细调谐的能量函数和敏感的初始化。这一突破得益于一个关键洞察：通过简单有效的数据结构——接触场，将复杂的几何计算与搜索过程解耦，从而降低问题复杂性，实现前所未有的快速过程化搜索。我们开源该系统以促进机器人操作领域的进一步创新。', 'title_zh': '闪电抓取：基于接触场的高性能程序化抓取合成'}
{'arxiv_id': 'arXiv:2511.07275', 'title': 'Robotic versus Human Teleoperation for Remote Ultrasound', 'authors': 'David Black, Septimiu Salcudean', 'link': 'https://arxiv.org/abs/2511.07275', 'abstract': 'Diagnostic medical ultrasound is widely used, safe, and relatively low cost but requires a high degree of expertise to acquire and interpret the images. Personnel with this expertise are often not available outside of larger cities, leading to difficult, costly travel and long wait times for rural populations. To address this issue, tele-ultrasound techniques are being developed, including robotic teleoperation and recently human teleoperation, in which a novice user is remotely guided in a hand-over-hand manner through mixed reality to perform an ultrasound exam. These methods have not been compared, and their relative strengths are unknown. Human teleoperation may be more practical than robotics for small communities due to its lower cost and complexity, but this is only relevant if the performance is comparable. This paper therefore evaluates the differences between human and robotic teleoperation, examining practical aspects such as setup time and flexibility and experimentally comparing performance metrics such as completion time, position tracking, and force consistency. It is found that human teleoperation does not lead to statistically significant differences in completion time or position accuracy, with mean differences of 1.8% and 0.5%, respectively, and provides more consistent force application despite being substantially more practical and accessible.', 'abstract_zh': '远程操作与机器人操作远程超声：综合实验证明人类操作更具优势', 'title_zh': '机器人操作与人类远程操控在远程超声中的比较'}
{'arxiv_id': 'arXiv:2511.07175', 'title': 'Automated Generation of Continuous-Space Roadmaps for Routing Mobile Robot Fleets', 'authors': 'Marvin Rüdt, Constantin Enke, Kai Furmans', 'link': 'https://arxiv.org/abs/2511.07175', 'abstract': 'Efficient routing of mobile robot fleets is crucial in intralogistics, where delays and deadlocks can substantially reduce system throughput. Roadmap design, specifying feasible transport routes, directly affects fleet coordination and computational performance. Existing approaches are either grid-based, compromising geometric precision, or continuous-space approaches that disregard practical constraints. This paper presents an automated roadmap generation approach that bridges this gap by operating in continuous-space, integrating station-to-station transport demand and enforcing minimum distance constraints for nodes and edges. By combining free space discretization, transport demand-driven $K$-shortest-path optimization, and path smoothing, the approach produces roadmaps tailored to intralogistics applications. Evaluation across multiple intralogistics use cases demonstrates that the proposed approach consistently outperforms established baselines (4-connected grid, 8-connected grid, and random sampling), achieving lower structural complexity, higher redundancy, and near-optimal path lengths, enabling efficient and robust routing of mobile robot fleets.', 'abstract_zh': '高效的移动机器人队列路由对于内部物流至关重要，其中的延迟和死锁会显著降低系统吞吐量。连续空间路径规划设计，规定可行的运输路径，直接关系到车队协调和计算性能。现有方法要么基于网格，牺牲几何精度，要么基于连续空间但忽略实际约束。本文提出了一种自动路径规划生成方法，通过在连续空间中操作，结合站到站的运输需求和节点及边的最小距离约束，填补了这一空白。通过结合自由空间离散化、运输需求驱动的$K$条最短路径优化和路径平滑，该方法生成适用于内部物流应用的路径规划。在多个内部物流应用场景的评估表明，所提出的方法在结构复杂性、冗余性和接近最优路径长度方面均优于现有基准（4连通网格、8连通网格和随机采样），从而能够实现高效的、稳健的移动机器人队列路由。', 'title_zh': '自动生成连续空间 roadmap 用于移动机器人舰队的路径规划'}
{'arxiv_id': 'arXiv:2511.07155', 'title': 'Dynamics-Decoupled Trajectory Alignment for Sim-to-Real Transfer in Reinforcement Learning for Autonomous Driving', 'authors': 'Thomas Steinecker, Alexander Bienemann, Denis Trescher, Thorsten Luettel, Mirko Maehlisch', 'link': 'https://arxiv.org/abs/2511.07155', 'abstract': 'Reinforcement learning (RL) has shown promise in robotics, but deploying RL on real vehicles remains challenging due to the complexity of vehicle dynamics and the mismatch between simulation and reality. Factors such as tire characteristics, road surface conditions, aerodynamic disturbances, and vehicle load make it infeasible to model real-world dynamics accurately, which hinders direct transfer of RL agents trained in simulation. In this paper, we present a framework that decouples motion planning from vehicle control through a spatial and temporal alignment strategy between a virtual vehicle and the real system. An RL agent is first trained in simulation using a kinematic bicycle model to output continuous control actions. Its behavior is then distilled into a trajectory-predicting agent that generates finite-horizon ego-vehicle trajectories, enabling synchronization between virtual and real vehicles. At deployment, a Stanley controller governs lateral dynamics, while longitudinal alignment is maintained through adaptive update mechanisms that compensate for deviations between virtual and real trajectories. We validate our approach on a real vehicle and demonstrate that the proposed alignment strategy enables robust zero-shot transfer of RL-based motion planning from simulation to reality, successfully decoupling high-level trajectory generation from low-level vehicle control.', 'abstract_zh': '基于强化学习的机器人运动规划在真实车辆上的空间和时间对齐框架', 'title_zh': '动力学解藕轨迹对齐在自主驾驶的仿真到现实转移中的应用'}
{'arxiv_id': 'arXiv:2511.06998', 'title': 'Raspi$^2$USBL: An open-source Raspberry Pi-Based Passive Inverted Ultra-Short Baseline Positioning System for Underwater Robotics', 'authors': 'Jin Huang, Yingqiang Wang, Ying Chen', 'link': 'https://arxiv.org/abs/2511.06998', 'abstract': 'Precise underwater positioning remains a fundamental challenge for underwater robotics since global navigation satellite system (GNSS) signals cannot penetrate the sea surface. This paper presents Raspi$^2$USBL, an open-source, Raspberry Pi-based passive inverted ultra-short baseline (piUSBL) positioning system designed to provide a low-cost and accessible solution for underwater robotic research. The system comprises a passive acoustic receiver and an active beacon. The receiver adopts a modular hardware architecture that integrates a hydrophone array, a multichannel preamplifier, an oven-controlled crystal oscillator (OCXO), a Raspberry Pi 5, and an MCC-series data acquisition (DAQ) board. Apart from the Pi 5, OCXO, and MCC board, the beacon comprises an impedance-matching network, a power amplifier, and a transmitting transducer. An open-source C++ software framework provides high-precision clock synchronization and triggering for one-way travel-time (OWTT) messaging, while performing real-time signal processing, including matched filtering, array beamforming, and adaptive gain control, to estimate the time of flight (TOF) and direction of arrival (DOA) of received signals. The Raspi$^2$USBL system was experimentally validated in an anechoic tank, freshwater lake, and open-sea trials. Results demonstrate a slant-range accuracy better than 0.1%, a bearing accuracy within 0.1$^\\circ$, and stable performance over operational distances up to 1.3 km. These findings confirm that low-cost, reproducible hardware can deliver research-grade underwater positioning accuracy. By releasing both the hardware and software as open-source, Raspi$^2$USBL provides a unified reference platform that lowers the entry barrier for underwater robotics laboratories, fosters reproducibility, and promotes collaborative innovation in underwater acoustic navigation and swarm robotics.', 'abstract_zh': '基于Raspberry Pi的开源被动倒置超短基线定位系统（Raspi$^2$USBL）', 'title_zh': 'Raspi$^2$USBL: 一种基于 Raspberry Pi 的开源被动倒置超短基线水下定位系统'}
{'arxiv_id': 'arXiv:2511.06839', 'title': 'Vision-Based System Identification of a Quadrotor', 'authors': 'Selim Ahmet Iz, Mustafa Unel', 'link': 'https://arxiv.org/abs/2511.06839', 'abstract': 'This paper explores the application of vision-based system identification techniques in quadrotor modeling and control. Through experiments and analysis, we address the complexities and limitations of quadrotor modeling, particularly in relation to thrust and drag coefficients. Grey-box modeling is employed to mitigate uncertainties, and the effectiveness of an onboard vision system is evaluated. An LQR controller is designed based on a system identification model using data from the onboard vision system. The results demonstrate consistent performance between the models, validating the efficacy of vision based system identification. This study highlights the potential of vision-based techniques in enhancing quadrotor modeling and control, contributing to improved performance and operational capabilities. Our findings provide insights into the usability and consistency of these techniques, paving the way for future research in quadrotor performance enhancement, fault detection, and decision-making processes.', 'abstract_zh': '基于视觉系统的 quadrotor 模型识别与控制研究', 'title_zh': '基于视觉的四旋翼无人机系统识别'}
{'arxiv_id': 'arXiv:2511.06673', 'title': 'Programmable Telescopic Soft Pneumatic Actuators for Deployable and Shape Morphing Soft Robots', 'authors': 'Joel Kemp, Andre Farinha, David Howard, Krishna Manaswi Digumarti, Josh Pinskier', 'link': 'https://arxiv.org/abs/2511.06673', 'abstract': "Soft Robotics presents a rich canvas for free-form and continuum devices capable of exerting forces in any direction and transforming between arbitrary configurations. However, there is no current way to tractably and directly exploit the design freedom due to the curse of dimensionality. Parameterisable sets of designs offer a pathway towards tractable, modular soft robotics that appropriately harness the behavioural freeform of soft structures to create rich embodied behaviours. In this work, we present a parametrised class of soft actuators, Programmable Telescopic Soft Pneumatic Actuators (PTSPAs). PTSPAs expand axially on inflation for deployable structures and manipulation in challenging confined spaces. We introduce a parametric geometry generator to customise actuator models from high-level inputs, and explore the new design space through semi-automated experimentation and systematic exploration of key parameters. Using it we characterise the actuators' extension/bending, expansion, and stiffness and reveal clear relationships between key design parameters and performance. Finally we demonstrate the application of the actuators in a deployable soft quadruped whose legs deploy to walk, enabling automatic adaptation to confined spaces. PTSPAs present new design paradigm for deployable and shape morphing structures and wherever large length changes are required.", 'abstract_zh': '可编程伸缩软气动执行器为可展开和形状变形结构提供了新的设计范式，尤其适用于需要大长度变化的场合。', 'title_zh': '可编程伸缩软气动执行器用于可展开和形态变化软机器人'}
{'arxiv_id': 'arXiv:2511.06667', 'title': 'Rapidly Learning Soft Robot Control via Implicit Time-Stepping', 'authors': 'Andrew Choi, Dezhong Tong', 'link': 'https://arxiv.org/abs/2511.06667', 'abstract': 'With the explosive growth of rigid-body simulators, policy learning in simulation has become the de facto standard for most rigid morphologies. In contrast, soft robotic simulation frameworks remain scarce and are seldom adopted by the soft robotics community. This gap stems partly from the lack of easy-to-use, general-purpose frameworks and partly from the high computational cost of accurately simulating continuum mechanics, which often renders policy learning infeasible. In this work, we demonstrate that rapid soft robot policy learning is indeed achievable via implicit time-stepping. Our simulator of choice, DisMech, is a general-purpose, fully implicit soft-body simulator capable of handling both soft dynamics and frictional contact. We further introduce delta natural curvature control, a method analogous to delta joint position control in rigid manipulators, providing an intuitive and effective means of enacting control for soft robot learning. To highlight the benefits of implicit time-stepping and delta curvature control, we conduct extensive comparisons across four diverse soft manipulator tasks against one of the most widely used soft-body frameworks, Elastica. With implicit time-stepping, parallel stepping of 500 environments achieves up to 6x faster speeds for non-contact cases and up to 40x faster for contact-rich scenarios. Finally, a comprehensive sim-to-sim gap evaluation--training policies in one simulator and evaluating them in another--demonstrates that implicit time-stepping provides a rare free lunch: dramatic speedups achieved without sacrificing accuracy.', 'abstract_zh': '基于隐式时间步进的快速软体机学习方法：从模拟到模拟的有效加速', 'title_zh': '通过隐式时间步进快速学习软体机器人控制'}
{'arxiv_id': 'arXiv:2511.06578', 'title': 'Underactuated Biomimetic Autonomous Underwater Vehicle for Ecosystem Monitoring', 'authors': 'Kaustubh Singh, Shivam Kumar, Shashikant Pawar, Sandeep Manjanna', 'link': 'https://arxiv.org/abs/2511.06578', 'abstract': 'In this paper, we present an underactuated biomimetic underwater robot that is suitable for ecosystem monitoring in both marine and freshwater environments. We present an updated mechanical design for a fish-like robot and propose minimal actuation behaviors learned using reinforcement learning techniques. We present our preliminary mechanical design of the tail oscillation mechanism and illustrate the swimming behaviors on FishGym simulator, where the reinforcement learning techniques will be tested on', 'abstract_zh': '本文介绍了一种欠驱动仿生水下机器人，适用于海洋和淡水环境的生态系统监测。文中展示了鱼形机器人的一种更新机械设计，并提出了一种利用强化学习技术学习的最小驱动行为。文中呈现了尾巴摇动机制的初步机械设计，并在FishGym模拟器上展示了游泳行为，将在该模拟器上测试强化学习技术。', 'title_zh': '未饱和仿生自主水下机器人用于生态系统监测'}
{'arxiv_id': 'arXiv:2511.06515', 'title': 'Koopman global linearization of contact dynamics for robot locomotion and manipulation enables elaborate control', 'authors': "Cormac O'Neill, Jasmine Terrones, H. Harry Asada", 'link': 'https://arxiv.org/abs/2511.06515', 'abstract': 'Controlling robots that dynamically engage in contact with their environment is a pressing challenge. Whether a legged robot making-and-breaking contact with a floor, or a manipulator grasping objects, contact is everywhere. Unfortunately, the switching of dynamics at contact boundaries makes control difficult. Predictive controllers face non-convex optimization problems when contact is involved. Here, we overcome this difficulty by applying Koopman operators to subsume the segmented dynamics due to contact changes into a unified, globally-linear model in an embedding space. We show that viscoelastic contact at robot-environment interactions underpins the use of Koopman operators without approximation to control inputs. This methodology enables the convex Model Predictive Control of a legged robot, and the real-time control of a manipulator engaged in dynamic pushing. In this work, we show that our method allows robots to discover elaborate control strategies in real-time over time horizons with multiple contact changes, and the method is applicable to broad fields beyond robotics.', 'abstract_zh': '控制与环境动态接触的机器人是一个迫切的挑战。无论是腿部机器人与地面的接触与脱离，还是 manipulator 握持物体，接触无处不在。不幸的是，接触边界的动力学切换使得控制变得困难。涉及接触时，预测控制器面临非凸优化问题。我们通过应用 Koopman 算子将由于接触变化导致的动力学分段融合到嵌入空间中的统一全局线性模型中来克服这一困难。我们证明了，机器人与环境交互中的耗散弹性接触无需近似即可利用 Koopman 算子进行控制输入。该方法使腿部机器人的凸模型预测控制成为可能，并使动态推举过程中 manipulator 的实时控制成为可能。在这项工作中，我们展示了我们的方法允许机器人在包含多次接触变化的时间范围内实时发现复杂的控制策略，并且该方法适用于机器人学之外的广泛领域。', 'title_zh': '接触动力学的Koopman全局线性化方法用于机器人运动与操作，以实现细致控制'}
{'arxiv_id': 'arXiv:2511.06434', 'title': 'Real Garment Benchmark (RGBench): A Comprehensive Benchmark for Robotic Garment Manipulation featuring a High-Fidelity Scalable Simulator', 'authors': 'Wenkang Hu, Xincheng Tang, Yanzhi E, Yitong Li, Zhengjie Shu, Wei Li, Huamin Wang, Ruigang Yang', 'link': 'https://arxiv.org/abs/2511.06434', 'abstract': 'While there has been significant progress to use simulated data to learn robotic manipulation of rigid objects, applying its success to deformable objects has been hindered by the lack of both deformable object models and realistic non-rigid body simulators. In this paper, we present Real Garment Benchmark (RGBench), a comprehensive benchmark for robotic manipulation of garments. It features a diverse set of over 6000 garment mesh models, a new high-performance simulator, and a comprehensive protocol to evaluate garment simulation quality with carefully measured real garment dynamics. Our experiments demonstrate that our simulator outperforms currently available cloth simulators by a large margin, reducing simulation error by 20% while maintaining a speed of 3 times faster. We will publicly release RGBench to accelerate future research in robotic garment manipulation. Website: this https URL', 'abstract_zh': '现实服装基准（RGBench）：一种全面的服装 manipulation 机器人基准测试', 'title_zh': '真实服装基准 (RGBench): 一种用于机器人服装操作的综合性基准,配备高保真可扩展模拟器'}
{'arxiv_id': 'arXiv:2511.06397', 'title': 'Whole-Body Control With Terrain Estimation of A 6-DoF Wheeled Bipedal Robot', 'authors': 'Cong Wen, Yunfei Li, Kexin Liu, Yixin Qiu, Xuanhong Liao, Tianyu Wang, Dingchuan Liu, Tao Zhang, Ximin Lyu', 'link': 'https://arxiv.org/abs/2511.06397', 'abstract': "Wheeled bipedal robots have garnered increasing attention in exploration and inspection. However, most research simplifies calculations by ignoring leg dynamics, thereby restricting the robot's full motion potential. Additionally, robots face challenges when traversing uneven terrain. To address the aforementioned issue, we develop a complete dynamics model and design a whole-body control framework with terrain estimation for a novel 6 degrees of freedom wheeled bipedal robot. This model incorporates the closed-loop dynamics of the robot and a ground contact model based on the estimated ground normal vector. We use a LiDAR inertial odometry framework and improved Principal Component Analysis for terrain estimation. Task controllers, including PD control law and LQR, are employed for pose control and centroidal dynamics-based balance control, respectively. Furthermore, a hierarchical optimization approach is used to solve the whole-body control problem. We validate the performance of the terrain estimation algorithm and demonstrate the algorithm's robustness and ability to traverse uneven terrain through both simulation and real-world experiments.", 'abstract_zh': '具有6自由度的轮式双足机器人垄地动态建模与全身体态控制框架研究', 'title_zh': '基于地形估计的6自由度轮足仿人机器人全身控制'}
{'arxiv_id': 'arXiv:2511.06378', 'title': 'ArtReg: Visuo-Tactile based Pose Tracking and Manipulation of Unseen Articulated Objects', 'authors': 'Prajval Kumar Murali, Mohsen Kaboli', 'link': 'https://arxiv.org/abs/2511.06378', 'abstract': 'Robots operating in real-world environments frequently encounter unknown objects with complex structures and articulated components, such as doors, drawers, cabinets, and tools. The ability to perceive, track, and manipulate these objects without prior knowledge of their geometry or kinematic properties remains a fundamental challenge in robotics. In this work, we present a novel method for visuo-tactile-based tracking of unseen objects (single, multiple, or articulated) during robotic interaction without assuming any prior knowledge regarding object shape or dynamics. Our novel pose tracking approach termed ArtReg (stands for Articulated Registration) integrates visuo-tactile point clouds in an unscented Kalman Filter formulation in the SE(3) Lie Group for point cloud registration. ArtReg is used to detect possible articulated joints in objects using purposeful manipulation maneuvers such as pushing or hold-pulling with a two-robot team. Furthermore, we leverage ArtReg to develop a closed-loop controller for goal-driven manipulation of articulated objects to move the object into the desired pose configuration. We have extensively evaluated our approach on various types of unknown objects through real robot experiments. We also demonstrate the robustness of our method by evaluating objects with varying center of mass, low-light conditions, and with challenging visual backgrounds. Furthermore, we benchmarked our approach on a standard dataset of articulated objects and demonstrated improved performance in terms of pose accuracy compared to state-of-the-art methods. Our experiments indicate that robust and accurate pose tracking leveraging visuo-tactile information enables robots to perceive and interact with unseen complex articulated objects (with revolute or prismatic joints).', 'abstract_zh': '基于视觉-触觉的未知复杂 articulated 对象操作中姿态跟踪方法', 'title_zh': 'ArtReg: 基于视觉-触觉的未见articulated物体姿态追踪与操作'}
{'arxiv_id': 'arXiv:2511.06311', 'title': 'External Photoreflective Tactile Sensing Based on Surface Deformation Measurement', 'authors': 'Seiichi Yamamoto, Hiroki Ishizuka, Takumi Kawasetsu, Koh Hosoda, Takayuki Kameoka, Kango Yanagida, Takato Horii, Sei Ikeda, Osamu Oshiro', 'link': 'https://arxiv.org/abs/2511.06311', 'abstract': 'We present a tactile sensing method enabled by the mechanical compliance of soft robots; an externally attachable photoreflective module reads surface deformation of silicone skin to estimate contact force without embedding tactile transducers. Locating the sensor off the contact interface reduces damage risk, preserves softness, and simplifies fabrication and maintenance. We first characterize the optical sensing element and the compliant skin, thendetermine the design of a prototype tactile sensor. Compression experiments validate the approach, exhibiting a monotonic force output relationship consistent with theory, low hysteresis, high repeatability over repeated cycles, and small response indentation speeds. We further demonstrate integration on a soft robotic gripper, where the module reliably detects grasp events. Compared with liquid filled or wireembedded tactile skins, the proposed modular add on architecture enhances durability, reduces wiring complexity, and supports straightforward deployment across diverse robot geometries. Because the sensing principle reads skin strain patterns, it also suggests extensions to other somatosensory cues such as joint angle or actuator state estimation from surface deformation. Overall, leveraging surface compliance with an external optical module provides a practical and robust route to equip soft robots with force perception while preserving structural flexibility and manufacturability, paving the way for robotic applications and safe human robot collaboration.', 'abstract_zh': '一种基于软机器人机械顺应性的触觉传感方法：外置光反射模块读取硅胶皮肤表面变形以估计接触力，无需嵌入触觉传感器', 'title_zh': '基于表面变形测量的外部光反射触觉传感'}
{'arxiv_id': 'arXiv:2511.06267', 'title': 'Robust Differentiable Collision Detection for General Objects', 'authors': 'Jiayi Chen, Wei Zhao, Liangwang Ruan, Baoquan Chen, He Wang', 'link': 'https://arxiv.org/abs/2511.06267', 'abstract': 'Collision detection is a core component of robotics applications such as simulation, control, and planning. Traditional algorithms like GJK+EPA compute witness points (i.e., the closest or deepest-penetration pairs between two objects) but are inherently non-differentiable, preventing gradient flow and limiting gradient-based optimization in contact-rich tasks such as grasping and manipulation. Recent work introduced efficient first-order randomized smoothing to make witness points differentiable; however, their direction-based formulation is restricted to convex objects and lacks robustness for complex geometries. In this work, we propose a robust and efficient differentiable collision detection framework that supports both convex and concave objects across diverse scales and configurations. Our method introduces distance-based first-order randomized smoothing, adaptive sampling, and equivalent gradient transport for robust and informative gradient computation. Experiments on complex meshes from DexGraspNet and Objaverse show significant improvements over existing baselines. Finally, we demonstrate a direct application of our method for dexterous grasp synthesis to refine the grasp quality. The code is available at this https URL.', 'abstract_zh': '碰撞检测是机器人应用（如仿真、控制和规划）的核心组件。传统的GJK+EPA算法计算见证点（即两物体之间的最接近点或最深穿透对），但这些算法本质上是非可微分的，阻碍了基于梯度的优化在接触丰富任务（如抓取和操作）中的应用。近期研究引入了高效的随机平滑方法以使见证点可微分；然而，其基于方向的公式仅适用于凸物体，并且对于复杂几何形状缺乏鲁棒性。在本研究中，我们提出了一种既稳健又高效的可微分碰撞检测框架，支持不同规模和配置下的凸性和凹性物体。该方法引入了基于距离的一阶随机平滑、自适应采样以及等效梯度传输，以实现稳健且富有信息量的梯度计算。实验结果表明，该方法在DexGraspNet和Objaverse的复杂网格上显著优于现有基线。最后，我们将该方法直接应用于灵巧抓取合成以提高抓取质量。代码可在以下链接获取。', 'title_zh': '鲁棒可微碰撞检测方法研究（适用于通用物体）'}
{'arxiv_id': 'arXiv:2511.06141', 'title': 'PlaCo: a QP-based robot planning and control framework', 'authors': 'Marc Duclusaud, Grégoire Passault, Vincent Padois, Olivier Ly', 'link': 'https://arxiv.org/abs/2511.06141', 'abstract': 'This article introduces PlaCo, a software framework designed to simplify the formulation and solution of Quadratic Programming (QP)-based planning and control problems for robotic systems. PlaCo provides a high-level interface that abstracts away the low-level mathematical formulation of QP problems, allowing users to specify tasks and constraints in a modular and intuitive manner. The framework supports both Python bindings for rapid prototyping and a C++ implementation for real-time performance.', 'abstract_zh': '本文介绍了PlaCo，一个用于简化基于二次规划（QP）的机器人系统规划与控制问题的软件框架。PlaCo 提供了一个高层接口，抽象了QP问题的低级数学公式，使得用户能够以模块化和直观的方式指定任务和约束。该框架支持用于快速原型设计的Python绑定和用于实时性能的C++实现。', 'title_zh': 'PlaCo：一种基于QP的机器人规划与控制框架'}
{'arxiv_id': 'arXiv:2511.06102', 'title': 'Development and testing of novel soft sleeve actuators', 'authors': 'Mohammed Abboodi', 'link': 'https://arxiv.org/abs/2511.06102', 'abstract': 'Aging populations and the rising prevalence of neurological and musculoskeletal disorders increase the demand for wearable mobility assistive devices that are effective, comfortable, and anatomically compatible. Many existing systems use rigid mechanisms and bulky interfaces that impede force transmission and reduce wearability. This study introduces a soft sleeve actuation architecture that conforms to the limb while transmitting forces and moments efficiently. We develop three soft sleeve actuators that produce linear, bending, and twisting motion, and an omnidirectional design that combines these motions in one device. Actuators are fabricated from thermoplastic elastomers using a customized fused filament fabrication process that produces airtight and compliant structures and resolves leakage observed with conventional methods. A dedicated experimental platform quantifies kinematic outputs such as displacement, angle, and twist, and kinetic outputs such as force and torque under low pneumatic pressures. A parametric study varies geometric features and material properties to determine their influence on performance. Results show reproducible multi axis motion with improved transfer of force to the limb and reduced need for complex attachment hardware. The work establishes a unified and manufacturable framework for soft sleeve actuation that enables compact and user centered assistive technologies with enhanced kinematic and kinetic performance.', 'abstract_zh': '老龄化人口和神经肌肉骨骼疾病发病率的上升增加了对有效、舒适且解剖学兼容的可穿戴移动辅助设备的需求。许多现有系统使用刚性机制和笨重的接口，妨碍力的传递并降低使用性。本研究介绍了一种符合肢体且能高效传递力和力矩的软袖驱动架构。我们开发了三种软袖驱动器以产生线性、弯曲和扭转运动，并设计了一种全方位装置，将这些运动结合在一个设备中。驱动器采用热塑性弹性体通过定制的熔融沉积建模工艺制造，生产出气密性和柔顺性兼具的结构，并解决了传统方法中出现的泄漏问题。专用实验平台在低气动压力下量化了诸如位移、角度、扭转和力、扭矩等运动学和动力学输出。参数研究变动几何特征和材料属性以确定其对性能的影响。结果表明，该驱动架构可以实现可再现的多轴运动，并改善了对肢体的力传递，减少了复杂固定硬件的需求。该工作建立了一个统一且可制造的软袖驱动架构，以实现紧凑且以用户为中心的辅助技术，具有增强的动力学和动力学性能。', 'title_zh': '新型软袖执行器的开发与测试'}
{'arxiv_id': 'arXiv:2511.05995', 'title': 'Robustness study of the bio-inspired musculoskeletal arm robot based on the data-driven iterative learning algorithm', 'authors': 'Jianbo Yuan, Jing Dai, Yerui Fan, Yaxiong Wu, Yunpeng Liang, Weixin Yan', 'link': 'https://arxiv.org/abs/2511.05995', 'abstract': 'The human arm exhibits remarkable capabilities, including both explosive power and precision, which demonstrate dexterity, compliance, and robustness in unstructured environments. Developing robotic systems that emulate human-like operational characteristics through musculoskeletal structures has long been a research focus. In this study, we designed a novel lightweight tendon-driven musculoskeletal arm (LTDM-Arm), featuring a seven degree-of-freedom (DOF) skeletal joint system and a modularized artificial muscular system (MAMS) with 15 actuators. Additionally, we employed a Hilly-type muscle model and data-driven iterative learning control (DDILC) to learn and refine activation signals for repetitive tasks within a finite time frame. We validated the anti-interference capabilities of the musculoskeletal system through both simulations and experiments. The results show that the LTDM-Arm system can effectively achieve desired trajectory tracking tasks, even under load disturbances of 20 % in simulation and 15 % in experiments. This research lays the foundation for developing advanced robotic systems with human-like operational performance.', 'abstract_zh': '人类手臂表现出卓越的能力，包括爆发力和精确度，展示了在非结构化环境中灵活、顺应性和鲁棒性。通过肌骨结构模拟人类操作特征的机器人系统一直是研究的重点。本研究设计了一种新型轻量化肌腱驱动的肌骨手臂（LTDM-Arm），配备了七自由度骨骼关节系统和模块化人工肌肉系统（MAMS），包含15个执行器。此外，我们采用了Hilly型肌肉模型和数据驱动迭代学习控制（DDILC）来学习和优化重复任务内的激活信号。我们通过仿真和实验验证了肌骨系统的抗干扰能力。结果显示，LTDM-Arm系统即使在仿真中承受20%的负载干扰和实验中承受15%的负载干扰下，也能有效实现期望的轨迹跟踪任务。本研究为开发具有人类操作性能的先进机器人系统奠定了基础。', 'title_zh': '基于数据驱动迭代学习算法的生物启发式肌骨臂机器人 robustness 研究'}
{'arxiv_id': 'arXiv:2511.05858', 'title': 'ViTaMIn-B: A Reliable and Efficient Visuo-Tactile Bimanual Manipulation Interface', 'authors': 'Chuanyu Li, Chaoyi Liu, Daotan Wang, Shuyu Zhang, Lusong Li, Zecui Zeng, Fangchen Liu, Jing Xu, Rui Chen', 'link': 'https://arxiv.org/abs/2511.05858', 'abstract': "Handheld devices have opened up unprecedented opportunities to collect large-scale, high-quality demonstrations efficiently. However, existing systems often lack robust tactile sensing or reliable pose tracking to handle complex interaction scenarios, especially for bimanual and contact-rich tasks. In this work, we propose ViTaMIn-B, a more capable and efficient handheld data collection system for such tasks. We first design DuoTact, a novel compliant visuo-tactile sensor built with a flexible frame to withstand large contact forces during manipulation while capturing high-resolution contact geometry. To enhance the cross-sensor generalizability, we propose reconstructing the sensor's global deformation as a 3D point cloud and using it as the policy input. We further develop a robust, unified 6-DoF bimanual pose acquisition process using Meta Quest controllers, which eliminates the trajectory drift issue in common SLAM-based methods. Comprehensive user studies confirm the efficiency and high usability of ViTaMIn-B among novice and expert operators. Furthermore, experiments on four bimanual manipulation tasks demonstrate its superior task performance relative to existing systems.", 'abstract_zh': '手持设备为高效收集大规模高质量演示提供了前所未有的机会。然而，现有系统往往缺乏 robust 触觉传感或可靠的姿态跟踪，以处理复杂的交互场景，尤其是对于双臂和接触密集型任务。在本文中，我们提出 ViTaMIn-B，一种更适合此类任务的更强有力且更高效的手持数据采集系统。我们首先设计了 DuoTact，一种新型的兼容性视觉-触觉传感器，采用柔性框架，在操作过程中能够承受大的接触力同时捕获高分辨率的接触几何形状。为增强跨 sensor 的通用性，我们提出重构传感器的全局变形为 3D 点云，并将其作为策略输入。我们进一步开发了一种鲁棒的、统一的双臂 6 自由度姿态采集流程，使用 Meta Quest 控制器，该流程消除了常见 SLAM 方法中的轨迹漂移问题。全面的用户研究证实了 ViTaMIn-B 在新手和专家操作者中的高效性和高可用性。此外，对四个双臂操作任务的实验表明，其在任务性能方面优于现有系统。', 'title_zh': 'ViTaMIn-B：一种可靠高效的双目视触操作接口'}
{'arxiv_id': 'arXiv:2511.05816', 'title': '3D Mapping Using a Lightweight and Low-Power Monocular Camera Embedded inside a Gripper of Limbed Climbing Robots', 'authors': 'Taku Okawara, Ryo Nishibe, Mao Kasano, Kentaro Uno, Kazuya Yoshida', 'link': 'https://arxiv.org/abs/2511.05816', 'abstract': 'Limbed climbing robots are designed to explore challenging vertical walls, such as the skylights of the Moon and Mars. In such robots, the primary role of a hand-eye camera is to accurately estimate 3D positions of graspable points (i.e., convex terrain surfaces) thanks to its close-up views. While conventional climbing robots often employ RGB-D cameras as hand-eye cameras to facilitate straightforward 3D terrain mapping and graspable point detection, RGB-D cameras are large and consume considerable power.\nThis work presents a 3D terrain mapping system designed for space exploration using limbed climbing robots equipped with a monocular hand-eye camera. Compared to RGB-D cameras, monocular cameras are more lightweight, compact structures, and have lower power consumption. Although monocular SLAM can be used to construct 3D maps, it suffers from scale ambiguity. To address this limitation, we propose a SLAM method that fuses monocular visual constraints with limb forward kinematics. The proposed method jointly estimates time-series gripper poses and the global metric scale of the 3D map based on factor graph optimization.\nWe validate the proposed framework through both physics-based simulations and real-world experiments. The results demonstrate that our framework constructs a metrically scaled 3D terrain map in real-time and enables autonomous grasping of convex terrain surfaces using a monocular hand-eye camera, without relying on RGB-D cameras. Our method contributes to scalable and energy-efficient perception for future space missions involving limbed climbing robots. See the video summary here: this https URL', 'abstract_zh': '基于单目手-眼相机的空间探测用足式攀爬机器人三维地形测绘系统', 'title_zh': '基于握持器内置轻量低功耗单目相机的仿生攀爬机器人三维建模'}
{'arxiv_id': 'arXiv:2511.05809', 'title': 'Adversarial Game-Theoretic Algorithm for Dexterous Grasp Synthesis', 'authors': 'Yu Chen, Botao He, Yuemin Mao, Arthur Jakobsson, Jeffrey Ke, Yiannis Aloimonos, Guanya Shi, Howie Choset, Jiayuan Mao, Jeffrey Ichnowski', 'link': 'https://arxiv.org/abs/2511.05809', 'abstract': "For many complex tasks, multi-finger robot hands are poised to revolutionize how we interact with the world, but reliably grasping objects remains a significant challenge. We focus on the problem of synthesizing grasps for multi-finger robot hands that, given a target object's geometry and pose, computes a hand configuration. Existing approaches often struggle to produce reliable grasps that sufficiently constrain object motion, leading to instability under disturbances and failed grasps. A key reason is that during grasp generation, they typically focus on resisting a single wrench, while ignoring the object's potential for adversarial movements, such as escaping. We propose a new grasp-synthesis approach that explicitly captures and leverages the adversarial object motion in grasp generation by formulating the problem as a two-player game. One player controls the robot to generate feasible grasp configurations, while the other adversarially controls the object to seek motions that attempt to escape from the grasp. Simulation experiments on various robot platforms and target objects show that our approach achieves a success rate of 75.78%, up to 19.61% higher than the state-of-the-art baseline. The two-player game mechanism improves the grasping success rate by 27.40% over the method without the game formulation. Our approach requires only 0.28-1.04 seconds on average to generate a grasp configuration, depending on the robot platform, making it suitable for real-world deployment. In real-world experiments, our approach achieves an average success rate of 85.0% on ShadowHand and 87.5% on LeapHand, which confirms its feasibility and effectiveness in real robot setups.", 'abstract_zh': '多指机器人手基于对抗运动的抓取合成方法研究', 'title_zh': '基于博弈论的对手博弈灵巧抓取合成算法'}
{'arxiv_id': 'arXiv:2511.05798', 'title': 'An Open-Source, Reproducible Tensegrity Robot that can Navigate Among Obstacles', 'authors': 'William R. Johnson III, Patrick Meng, Nelson Chen, Luca Cimatti, Augustin Vercoutere, Mridul Aanjaneya, Rebecca Kramer-Bottiglio, Kostas E. Bekris', 'link': 'https://arxiv.org/abs/2511.05798', 'abstract': "Tensegrity robots, composed of rigid struts and elastic tendons, provide impact resistance, low mass, and adaptability to unstructured terrain. Their compliance and complex, coupled dynamics, however, present modeling and control challenges, hindering path planning and obstacle avoidance. This paper presents a complete, open-source, and reproducible system that enables navigation for a 3-bar tensegrity robot. The system comprises: (i) an inexpensive, open-source hardware design, and (ii) an integrated, open-source software stack for physics-based modeling, system identification, state estimation, path planning, and control. All hardware and software are publicly available at this https URL. The proposed system tracks the robot's pose and executes collision-free paths to a specified goal among known obstacle locations. System robustness is demonstrated through experiments involving unmodeled environmental challenges, including a vertical drop, an incline, and granular media, culminating in an outdoor field demonstration. To validate reproducibility, experiments were conducted using robot instances at two different laboratories. This work provides the robotics community with a complete navigation system for a compliant, impact-resistant, and shape-morphing robot. This system is intended to serve as a springboard for advancing the navigation capabilities of other unconventional robotic platforms.", 'abstract_zh': '基于张拉整体结构的机器人：一种轻质、抗冲击且适应未结构化地形的导航系统', 'title_zh': '开源可再现的流线型机器人，可在障碍物间导航'}
{'arxiv_id': 'arXiv:2511.05785', 'title': 'A Unified Stochastic Mechanism Underlying Collective Behavior in Ants, Physical Systems, and Robotic Swarms', 'authors': 'Lianhao Yin, Haiping Yu, Pascal Spino, Daniela Rus', 'link': 'https://arxiv.org/abs/2511.05785', 'abstract': 'Biological swarms, such as ant colonies, achieve collective goals through decentralized and stochastic individual behaviors. Similarly, physical systems composed of gases, liquids, and solids exhibit random particle motion governed by entropy maximization, yet do not achieve collective objectives. Despite this analogy, no unified framework exists to explain the stochastic behavior in both biological and physical systems. Here, we present empirical evidence from \\textit{Formica polyctena} ants that reveals a shared statistical mechanism underlying both systems: maximization under different energy function constraints. We further demonstrate that robotic swarms governed by this principle can exhibit scalable, decentralized cooperation, mimicking physical phase-like behaviors with minimal individual computation. These findings established a unified stochastic model linking biological, physical, and robotic swarms, offering a scalable principle for designing robust and intelligent swarm robotics.', 'abstract_zh': '生物学蚁群等生物集群通过去中心化和随机个体行为实现集体目标，类似地，由气体、液体和固体组成的物理系统表现出由熵最大化支配的随机粒子运动，但不实现集体目标。尽管存在这种类比，但目前仍缺乏能解释这两种系统中随机行为的统一框架。在这里，我们通过以Formica polyctena蚂蚁为例，提供了来自生物和物理系统的共享统计机制实证证据：在不同能量函数约束下的最大化。进一步证明遵循这一原则的机器人集群可以表现出可扩展的去中心化合作，仅通过最少的个体计算模拟类似物理相变的行为。这些发现建立了一个将生物、物理和机器人集群联系起来的统一随机模型，为设计鲁棒智能机器人集群提供了可扩展的原则。', 'title_zh': '蚂蚁、物理系统和机器人 swarm 中集体行为的统一随机机制'}
{'arxiv_id': 'arXiv:2511.05723', 'title': 'TumorMap: A Laser-based Surgical Platform for 3D Tumor Mapping and Fully-Automated Tumor Resection', 'authors': 'Guangshen Ma, Ravi Prakash, Beatrice Schleupner, Jeffrey Everitt, Arpit Mishra, Junqin Chen, Brian Mann, Boyuan Chen, Leila Bridgeman, Pei Zhong, Mark Draelos, William C. Eward, Patrick J. Codd', 'link': 'https://arxiv.org/abs/2511.05723', 'abstract': 'Surgical resection of malignant solid tumors is critically dependent on the surgeon\'s ability to accurately identify pathological tissue and remove the tumor while preserving surrounding healthy structures. However, building an intraoperative 3D tumor model for subsequent removal faces major challenges due to the lack of high-fidelity tumor reconstruction, difficulties in developing generalized tissue models to handle the inherent complexities of tumor diagnosis, and the natural physical limitations of bimanual operation, physiologic tremor, and fatigue creep during surgery. To overcome these challenges, we introduce "TumorMap", a surgical robotic platform to formulate intraoperative 3D tumor boundaries and achieve autonomous tissue resection using a set of multifunctional lasers. TumorMap integrates a three-laser mechanism (optical coherence tomography, laser-induced endogenous fluorescence, and cutting laser scalpel) combined with deep learning models to achieve fully-automated and noncontact tumor resection. We validated TumorMap in murine osteoscarcoma and soft-tissue sarcoma tumor models, and established a novel histopathological workflow to estimate sensor performance. With submillimeter laser resection accuracy, we demonstrated multimodal sensor-guided autonomous tumor surgery without any human intervention.', 'abstract_zh': '恶性固体肿瘤的手术切除依赖于外科医生准确识别病理性组织并切除肿瘤的同时保留周围健康结构的能力。然而，由于缺乏高保真度的肿瘤重建、难以开发适用于肿瘤诊断复杂性的通用组织模型以及手术中的双手动操作限制、生理颤动和疲劳引起的运动变化，建立术中三维肿瘤模型并进行后续切除面临着重大挑战。为克服这些挑战，我们引入了“TumorMap”手术机器人平台，用于制定术中三维肿瘤边界并通过一组多功能激光实现自主组织切除。TumorMap将三激光机制（光学相干断层扫描、激光诱导内源荧光和切割激光刀）与深度学习模型相结合，以实现全自动化且无需接触的肿瘤切除。我们在小鼠骨肉瘤和软组织肉瘤肿瘤模型中验证了TumorMap，并建立了新的组织病理学工作流程以评估传感器性能。通过亚毫米级激光切除精度，我们展示了多模式传感器引导下的自主肿瘤手术，整个过程中无需任何人为干预。', 'title_zh': 'TumorMap：一种基于激光的三维肿瘤 Mapping 和全自动肿瘤切除手术平台'}
{'arxiv_id': 'arXiv:2511.06226', 'title': 'ROAR: Robust Accident Recognition and Anticipation for Autonomous Driving', 'authors': 'Xingcheng Liu, Yanchen Guan, Haicheng Liao, Zhengbing He, Zhenning Li', 'link': 'https://arxiv.org/abs/2511.06226', 'abstract': "Accurate accident anticipation is essential for enhancing the safety of autonomous vehicles (AVs). However, existing methods often assume ideal conditions, overlooking challenges such as sensor failures, environmental disturbances, and data imperfections, which can significantly degrade prediction accuracy. Additionally, previous models have not adequately addressed the considerable variability in driver behavior and accident rates across different vehicle types. To overcome these limitations, this study introduces ROAR, a novel approach for accident detection and prediction. ROAR combines Discrete Wavelet Transform (DWT), a self adaptive object aware module, and dynamic focal loss to tackle these challenges. The DWT effectively extracts features from noisy and incomplete data, while the object aware module improves accident prediction by focusing on high-risk vehicles and modeling the spatial temporal relationships among traffic agents. Moreover, dynamic focal loss mitigates the impact of class imbalance between positive and negative samples. Evaluated on three widely used datasets, Dashcam Accident Dataset (DAD), Car Crash Dataset (CCD), and AnAn Accident Detection (A3D), our model consistently outperforms existing baselines in key metrics such as Average Precision (AP) and mean Time to Accident (mTTA). These results demonstrate the model's robustness in real-world conditions, particularly in handling sensor degradation, environmental noise, and imbalanced data distributions. This work offers a promising solution for reliable and accurate accident anticipation in complex traffic environments.", 'abstract_zh': '准确的事故预见对于提升自动驾驶车辆的安全性至关重要。然而，现有方法往往假设理想条件，忽视了传感器故障、环境干扰和数据不完善等挑战，这些因素会显著降低预测精度。此外，以往模型未能充分解决不同类型车辆之间驾驶员行为和事故率的显著变化。为克服这些限制，本研究引入了ROAR，一种新的事故检测与预测方法。ROAR 结合了离散小波变换（DWT）、自适应对象感知模块和动态焦点损失以应对这些挑战。DWT 有效地从噪声和不完整数据中提取特征，而对象感知模块通过关注高风险车辆并建模交通代理之间的空时关系，提高事故预测能力。此外，动态焦点损失减轻了正负样本类别不平衡的影响。在 Dashcam Accident Dataset (DAD)、Car Crash Dataset (CCD) 和 AnAn Accident Detection (A3D) 三个广泛使用的数据集上评估，我们的模型在关键指标如平均精确度（AP）和平均事故发生时间（mTTA）等方面始终优于现有基线。这些结果展示了模型在真实环境条件下的鲁棒性，特别是在处理传感器退化、环境噪声和类别不平衡数据分布方面的表现。此举为在复杂交通环境中实现可靠和准确的事故预见提供了有希望的解决方案。', 'title_zh': 'ROAR：自动驾驶中的鲁棒事故识别与预见'}
