{'arxiv_id': 'arXiv:2507.06824', 'title': 'Friction Estimation for In-Hand Planar Motion', 'authors': 'Gabriel Arslan Waltersson, Yiannis Karayiannidis', 'link': 'https://arxiv.org/abs/2507.06824', 'abstract': 'This paper presents a method for online estimation of contact properties during in-hand sliding manipulation with a parallel gripper. We estimate the static and Coulomb friction as well as the contact radius from tactile measurements of contact forces and sliding velocities. The method is validated in both simulation and real-world experiments. Furthermore, we propose a heuristic to deal with fast slip-stick dynamics which can adversely affect the estimation.', 'abstract_zh': '该文提出了一种基于并联夹爪的手内滑动操作过程中接触属性在线估计的方法。我们利用接触力和滑动速度的触觉测量数据估计静摩擦和库仑摩擦以及接触半径。该方法在仿真和实际实验中得到了验证。此外，我们提出了一种启发式方法来处理会对估计造成负面影响的快速滑移-粘连动态。', 'title_zh': '手持平面运动的摩擦估计'}
{'arxiv_id': 'arXiv:2507.06787', 'title': 'Stream Function-Based Navigation for Complex Quadcopter Obstacle Avoidance', 'authors': 'Sean Smith, Emmanuel Witrant, Ya-Jun Pan', 'link': 'https://arxiv.org/abs/2507.06787', 'abstract': 'This article presents a novel stream function-based navigational control system for obstacle avoidance, where obstacles are represented as two-dimensional (2D) rigid surfaces in inviscid, incompressible flows. The approach leverages the vortex panel method (VPM) and incorporates safety margins to control the stream function and flow properties around virtual surfaces, enabling navigation in complex, partially observed environments using real-time sensing. To address the limitations of the VPM in managing relative distance and avoiding rapidly accelerating obstacles at close proximity, the system integrates a model predictive controller (MPC) based on higher-order control barrier functions (HOCBF). This integration incorporates VPM trajectory generation, state estimation, and constraint handling into a receding-horizon optimization problem. The 2D rigid surfaces are enclosed using minimum bounding ellipses (MBEs), while an adaptive Kalman filter (AKF) captures and predicts obstacle dynamics, propagating these estimates into the MPC-HOCBF for rapid avoidance maneuvers. Evaluation is conducted using a PX4-powered Clover drone Gazebo simulator and real-time experiments involving a COEX Clover quadcopter equipped with a 360 degree LiDAR sensor.', 'abstract_zh': '基于涡旋面板方法的新型流函数导向导航控制系统：用于障碍物 avoidance 的实时 sensing 和复杂环境下的鲁棒避障', 'title_zh': '基于流函数的复杂环境中四旋翼避障导航'}
{'arxiv_id': 'arXiv:2507.06519', 'title': 'Failure Forecasting Boosts Robustness of Sim2Real Rhythmic Insertion Policies', 'authors': 'Yuhan Liu, Xinyu Zhang, Haonan Chang, Abdeslam Boularias', 'link': 'https://arxiv.org/abs/2507.06519', 'abstract': "This paper addresses the challenges of Rhythmic Insertion Tasks (RIT), where a robot must repeatedly perform high-precision insertions, such as screwing a nut into a bolt with a wrench. The inherent difficulty of RIT lies in achieving millimeter-level accuracy and maintaining consistent performance over multiple repetitions, particularly when factors like nut rotation and friction introduce additional complexity. We propose a sim-to-real framework that integrates a reinforcement learning-based insertion policy with a failure forecasting module. By representing the wrench's pose in the nut's coordinate frame rather than the robot's frame, our approach significantly enhances sim-to-real transferability. The insertion policy, trained in simulation, leverages real-time 6D pose tracking to execute precise alignment, insertion, and rotation maneuvers. Simultaneously, a neural network predicts potential execution failures, triggering a simple recovery mechanism that lifts the wrench and retries the insertion. Extensive experiments in both simulated and real-world environments demonstrate that our method not only achieves a high one-time success rate but also robustly maintains performance over long-horizon repetitive tasks.", 'abstract_zh': '本文针对节律插入任务（RIT），其中机器人必须反复执行高精度插入操作，例如使用扳手将螺帽拧入螺栓。RIT 的固有难度在于实现毫米级精度并保持多次重复操作中的一致性能，尤其是当考虑螺帽旋转和摩擦等因素时会增加额外的复杂性。我们提出了一种结合基于强化学习的插入策略和故障预测模块的仿真实验框架。通过将扳手的姿态表示为螺帽坐标系，而非机器人坐标系，我们的方法显著增强了仿真实验到实际应用的可转移性。插入策略在仿真中训练，利用实时六自由度姿态追踪执行精确对准、插入和旋转操作。同时，神经网络预测潜在的执行失败，并触发一个简单的恢复机制以抬起扳手并重新尝试插入。在仿真和实际环境中的大量实验表明，我们的方法不仅能够实现高单次成功率，而且在长时间尺度的重复任务中也能稳健地保持性能。', 'title_zh': 'Failure Forecasting提升Sim2Real节律插入策略的鲁棒性'}
