{'arxiv_id': 'arXiv:2507.15710', 'title': 'Selective Densification for Rapid Motion Planning in High Dimensions with Narrow Passages', 'authors': 'Lu Huang, Lingxiao Meng, Jiankun Wang, Xingjian Jing', 'link': 'https://arxiv.org/abs/2507.15710', 'abstract': 'Sampling-based algorithms are widely used for motion planning in high-dimensional configuration spaces. However, due to low sampling efficiency, their performance often diminishes in complex configuration spaces with narrow corridors. Existing approaches address this issue using handcrafted or learned heuristics to guide sampling toward useful regions. Unfortunately, these strategies often lack generalizability to various problems or require extensive prior training. In this paper, we propose a simple yet efficient sampling-based planning framework along with its bidirectional version that overcomes these issues by integrating different levels of planning granularity. Our approach probes configuration spaces with uniform random samples at varying resolutions and explores these multi-resolution samples online with a bias towards sparse samples when traveling large free configuration spaces. By seamlessly transitioning between sparse and dense samples, our approach can navigate complex configuration spaces while maintaining planning speed and completeness. The simulation results demonstrate that our approach outperforms several state-of-the-art sampling-based planners in $\\mathbb{SE}(2)$, $\\mathbb{SE}(3)$, and $\\mathbb{R}^{14}$ with challenging terrains. Furthermore, experiments conducted with the Franka Emika Panda robot operating in a constrained workspace provide additional evidence of the superiority of the proposed method.', 'abstract_zh': '基于采样的运动规划算法广泛应用于高维配置空间。然而，由于采样效率低，这些算法在具有狭窄通道的复杂配置空间中的性能往往会下降。现有的方法通过手工设计或学习的启发式方法来指导采样向有用区域进行，但这些策略往往缺乏普适性或需要大量的先验训练。本文提出了一种简单而高效的基于采样的规划框架及其双向版本，通过集成不同层次的规划粒度来克服这些问题。该方法使用不同分辨率的均匀随机采样探测配置空间，并在线探索这些多分辨率样本时倾向于稀疏样本，特别是在穿越大量自由配置空间时。通过无缝地转换稀疏和密集样本，该方法可以在保持规划速度和完备性的同时导航复杂的配置空间。仿真结果表明，该方法在$\\mathbb{SE}(2)$、$\\mathbb{SE}(3)$和$\\mathbb{R}^{14}$及其具有挑战性地形的环境中，优于几种最先进的基于采样的规划算法。此外，使用Franka Emika Panda机器人在受限工作空间中的实验进一步证明了所提出方法的优越性。', 'title_zh': '高维狭窄通道快速运动规划的选择性致密化'}
{'arxiv_id': 'arXiv:2507.15693', 'title': 'Strong, Accurate, and Low-Cost Robot Manipulator', 'authors': 'Georges Chebly, Spencer Little, Nisal Perera, Aliya Abedeen, Ken Suzuki, Donghyun Kim', 'link': 'https://arxiv.org/abs/2507.15693', 'abstract': 'This paper presents Forte, a fully 3D-printable, 6-DoF robotic arm designed to achieve near industrial-grade performance - 0.63 kg payload, 0.467 m reach, and sub-millimeter repeatability - at a material cost under $215. As an accessible robot for broad applications across classroom education to AI experiments, Forte pushes forward the performance limitations of existing low-cost educational arms. We introduce a cost-effective mechanical design that combines capstan-based cable drives, timing belts, simple tensioning mechanisms, and lightweight 3D-printed structures, along with topology optimization for structural stiffness. Through careful drivetrain engineering, we minimize backlash and maintain control fidelity without relying on high-power electronics or expensive manufacturing processes. Experimental validation demonstrates that Forte achieves high repeatability and load capacity, offering a compelling robotic platform for both classroom instruction and advanced robotics research.', 'abstract_zh': 'Forte：一款成本低于215美元、可全3D打印、6轴自由度的机器人手臂，实现接近工业级性能', 'title_zh': '强力、精确且低成本的机器人 manipulator'}
{'arxiv_id': 'arXiv:2507.15677', 'title': 'Data-Driven MPC with Data Selection for Flexible Cable-Driven Robotic Arms', 'authors': 'Huayue Liang, Yanbo Chen, Hongyang Cheng, Yanzhao Yu, Shoujie Li, Junbo Tan, Xueqian Wang, Long Zeng', 'link': 'https://arxiv.org/abs/2507.15677', 'abstract': 'Flexible cable-driven robotic arms (FCRAs) offer dexterous and compliant motion. Still, the inherent properties of cables, such as resilience, hysteresis, and friction, often lead to particular difficulties in modeling and control. This paper proposes a model predictive control (MPC) method that relies exclusively on input-output data, without a physical model, to improve the control accuracy of FCRAs. First, we develop an implicit model based on input-output data and integrate it into an MPC optimization framework. Second, a data selection algorithm (DSA) is introduced to filter the data that best characterize the system, thereby reducing the solution time per step to approximately 4 ms, which is an improvement of nearly 80%. Lastly, the influence of hyperparameters on tracking error is investigated through simulation. The proposed method has been validated on a real FCRA platform, including five-point positioning accuracy tests, a five-point response tracking test, and trajectory tracking for letter drawing. The results demonstrate that the average positioning accuracy is approximately 2.070 mm. Moreover, compared to the PID method with an average tracking error of 1.418°, the proposed method achieves an average tracking error of 0.541°.', 'abstract_zh': '柔性缆索驱动机器人手臂的模型预测控制方法：基于输入输出数据的无需物理模型方法', 'title_zh': '基于数据选择的数据驱动 MPC 灵活缆驱机器人臂'}
{'arxiv_id': 'arXiv:2507.15608', 'title': 'Optimizing Force Signals from Human Demonstrations of In-Contact Motions', 'authors': 'Johannes Hartwig, Fabian Viessmann, Dominik Henrich', 'link': 'https://arxiv.org/abs/2507.15608', 'abstract': "For non-robot-programming experts, kinesthetic guiding can be an intuitive input method, as robot programming of in-contact tasks is becoming more prominent. However, imprecise and noisy input signals from human demonstrations pose problems when reproducing motions directly or using the signal as input for machine learning methods. This paper explores optimizing force signals to correspond better to the human intention of the demonstrated signal. We compare different signal filtering methods and propose a peak detection method for dealing with first-contact deviations in the signal. The evaluation of these methods considers a specialized error criterion between the input and the human-intended signal. In addition, we analyze the critical parameters' influence on the filtering methods. The quality for an individual motion could be increased by up to \\SI{20}{\\percent} concerning the error criterion. The proposed contribution can improve the usability of robot programming and the interaction between humans and robots.", 'abstract_zh': '非机器人编程专家的动能引导可以作为一种直观的输入方法，随着接触任务的机器人编程变得更为突出。然而，人类示范过程中的不精确和噪声信号输入给直接重现动作或作为机器学习方法输入带来了问题。本文探讨了优化力信号，使它们更好地对应人类示范信号的意图。我们比较了不同的信号滤波方法，并提出了一种峰值检测方法来处理信号中的初始接触偏差。这些方法的评估考虑了一个针对输入信号和人类意图信号之间的特殊误差标准。此外，我们分析了滤波方法中关键参数的影响。对于单个动作，误差标准下的质量最多可以提高20%。所提出的内容可以改进机器人编程的可用性以及人与机器人之间的交互。', 'title_zh': '优化人演示接触运动中的力信号'}
{'arxiv_id': 'arXiv:2507.15607', 'title': 'A Universal Vehicle-Trailer Navigation System with Neural Kinematics and Online Residual Learning', 'authors': 'Yanbo Chen, Yunzhe Tan, Yaojia Wang, Zhengzhe Xu, Junbo Tan, Xueqian Wang', 'link': 'https://arxiv.org/abs/2507.15607', 'abstract': 'Autonomous navigation of vehicle-trailer systems is crucial in environments like airports, supermarkets, and concert venues, where various types of trailers are needed to navigate with different payloads and conditions. However, accurately modeling such systems remains challenging, especially for trailers with castor wheels. In this work, we propose a novel universal vehicle-trailer navigation system that integrates a hybrid nominal kinematic model--combining classical nonholonomic constraints for vehicles and neural network-based trailer kinematics--with a lightweight online residual learning module to correct real-time modeling discrepancies and disturbances. Additionally, we develop a model predictive control framework with a weighted model combination strategy that improves long-horizon prediction accuracy and ensures safer motion planning. Our approach is validated through extensive real-world experiments involving multiple trailer types and varying payload conditions, demonstrating robust performance without manual tuning or trailer-specific calibration.', 'abstract_zh': '自主导航的车辆-拖车系统在机场、超市和音乐会场等环境中至关重要，需要根据不同载荷和条件导航各种类型的拖车。然而，准确建模此类系统仍然颇具挑战性，尤其对于配备定向轮的拖车。本文提出了一种新型通用车辆-拖车导航系统，该系统结合了混合名义运动模型——经典非完整约束与基于神经网络的拖车运动学相结合，并 integrated 轻量级在线残差学习模块以实时修正建模偏差和干扰。此外，我们还开发了一种带加权模型组合策略的模型预测控制框架，以提高长期预测准确性并确保更安全的运动规划。我们的方法通过涉及多种拖车类型和不同载荷条件的广泛现实世界实验得到了验证，展示了无需手动调谐或特定拖车校准的稳健性能。', 'title_zh': '一种基于神经运动学和在线残差学习的通用车辆-挂车导航系统'}
{'arxiv_id': 'arXiv:2507.15604', 'title': 'Estimation of Payload Inertial Parameters from Human Demonstrations by Hand Guiding', 'authors': 'Johannes Hartwig, Philipp Lienhardt, Dominik Henrich', 'link': 'https://arxiv.org/abs/2507.15604', 'abstract': "As the availability of cobots increases, it is essential to address the needs of users with little to no programming knowledge to operate such systems efficiently. Programming concepts often use intuitive interaction modalities, such as hand guiding, to address this. When programming in-contact motions, such frameworks require knowledge of the robot tool's payload inertial parameters (PIP) in addition to the demonstrated velocities and forces to ensure effective hybrid motion-force control. This paper aims to enable non-expert users to program in-contact motions more efficiently by eliminating the need for a dedicated PIP calibration, thereby enabling flexible robot tool changes. Since demonstrated tasks generally also contain motions with non-contact, our approach uses these parts to estimate the robot's PIP using established estimation techniques. The results show that the estimation of the payload's mass is accurate, whereas the center of mass and the inertia tensor are affected by noise and a lack of excitation. Overall, these findings show the feasibility of PIP estimation during hand guiding but also highlight the need for sufficient payload accelerations for an accurate estimation.", 'abstract_zh': '随着协作机器人的可用性增加，有必要解决那些缺乏或几乎没有编程知识的用户高效操作此类系统的需要。此类框架通常使用直观的交互模态，如手动引导，来解决这一问题。在编程接触运动时，除了演示的速度和力外，还需知道机器人工具的有效载荷惯性参数（PIP），以确保有效的混合运动-力控制。本文旨在通过消除专用PIP校准的需要，使非专家用户更高效地编程接触运动，从而实现灵活的机器人工具更换。由于演示的任务通常也包含非接触运动，本方法利用这些部分采用现有的估计技术估计机器人的PIP。结果表明，有效载荷质量的估计是准确的，而质心和惯性张量则受到噪声和激励不足的影响。总体而言，这些发现表明，在手动引导过程中进行PIP估计是可行的，但也表明需要足够的有效载荷加速度才能获得准确的估计。', 'title_zh': '基于手动引导的人体示范用于载荷惯性参数估计'}
{'arxiv_id': 'arXiv:2507.15484', 'title': 'Robots for Kiwifruit Harvesting and Pollination', 'authors': 'Jamie Bell', 'link': 'https://arxiv.org/abs/2507.15484', 'abstract': 'This research was a part of a project that developed mobile robots that performed targeted pollen spraying and automated harvesting in pergola structured kiwifruit orchards. Multiple kiwifruit detachment mechanisms were designed and field testing of one of the concepts showed that the mechanism could reliably pick kiwifruit. Furthermore, this kiwifruit detachment mechanism was able to reach over 80 percent of fruit in the cluttered kiwifruit canopy, whereas the previous state of the art mechanism was only able to reach less than 70 percent of the fruit. Artificial pollination was performed by detecting flowers and then spraying pollen in solution onto the detected flowers from a line of sprayers on a boom, while driving at up to 1.4 ms-1. In addition, the height of the canopy was measured and the spray boom was moved up and down to keep the boom close enough to the flowers for the spray to reach the flowers, while minimising collisions with the canopy. Mobile robot navigation was performed using a 2D lidar in apple orchards and vineyards. Lidar navigation in kiwifruit orchards was more challenging because the pergola structure only provides a small amount of data for the direction of rows, compared to the amount of data from the overhead canopy, the undulating ground and other objects in the orchards. Multiple methods are presented here for extracting structure defining features from 3D lidar data in kiwifruit orchards. In addition, a 3D lidar navigation system -- which performed row following, row end detection and row end turns -- was tested for over 30 km of autonomous driving in kiwifruit orchards. Computer vision algorithms for row detection and row following were also tested. The computer vision algorithm worked as well as the 3D lidar row following method in testing.', 'abstract_zh': '一种用于 pergola 结构猕猴桃园目标花粉喷洒和自动化收获的移动机器人研究', 'title_zh': '猕研果收获与授粉机器人'}
{'arxiv_id': 'arXiv:2507.15478', 'title': 'The Constitutional Controller: Doubt-Calibrated Steering of Compliant Agents', 'authors': 'Simon Kohaut, Felix Divo, Navid Hamid, Benedict Flade, Julian Eggert, Devendra Singh Dhami, Kristian Kersting', 'link': 'https://arxiv.org/abs/2507.15478', 'abstract': "Ensuring reliable and rule-compliant behavior of autonomous agents in uncertain environments remains a fundamental challenge in modern robotics. Our work shows how neuro-symbolic systems, which integrate probabilistic, symbolic white-box reasoning models with deep learning methods, offer a powerful solution to this challenge. This enables the simultaneous consideration of explicit rules and neural models trained on noisy data, combining the strength of structured reasoning with flexible representations. To this end, we introduce the Constitutional Controller (CoCo), a novel framework designed to enhance the safety and reliability of agents by reasoning over deep probabilistic logic programs representing constraints such as those found in shared traffic spaces. Furthermore, we propose the concept of self-doubt, implemented as a probability density conditioned on doubt features such as travel velocity, employed sensors, or health factors. In a real-world aerial mobility study, we demonstrate CoCo's advantages for intelligent autonomous systems to learn appropriate doubts and navigate complex and uncertain environments safely and compliantly.", 'abstract_zh': '确保自主代理在不确定环境中的可靠和合规行为仍然是现代机器人技术中的一个基本挑战。我们的工作展示了将概率主义和符号白盒推理模型与深度学习方法相结合的神经符号系统如何提供解决这一挑战的强大方案。这使得同时考虑显式规则和基于噪声数据训练的神经模型成为可能，结合了结构化推理的强度与灵活表示的灵活性。为此，我们引入了宪法控制器（CoCo）这一新型框架，通过推理包含约束（例如共享交通空间中的约束）的深层概率逻辑程序来增强代理的安全性和可靠性。此外，我们提出了自我怀疑的概念，将其实现为基于怀疑特征（如旅行速度、使用的传感器或健康状况等）的概率密度。在实际的空中移动研究中，我们展示了CoCo如何帮助智能自主系统学习合适的怀疑并安全、合规地导航复杂和不确定的环境。', 'title_zh': '宪法控制器：疑虑校准的合规代理引导'}
{'arxiv_id': 'arXiv:2507.15444', 'title': 'Low-Latency Event-Based Velocimetry for Quadrotor Control in a Narrow Pipe', 'authors': 'Leonard Bauersfeld, Davide Scaramuzza', 'link': 'https://arxiv.org/abs/2507.15444', 'abstract': 'Autonomous quadrotor flight in confined spaces such as pipes and tunnels presents significant challenges due to unsteady, self-induced aerodynamic disturbances. Very recent advances have enabled flight in such conditions, but they either rely on constant motion through the pipe to mitigate airflow recirculation effects or suffer from limited stability during hovering. In this work, we present the first closed-loop control system for quadrotors for hovering in narrow pipes that leverages real-time flow field measurements. We develop a low-latency, event-based smoke velocimetry method that estimates local airflow at high temporal resolution. This flow information is used by a disturbance estimator based on a recurrent convolutional neural network, which infers force and torque disturbances in real time. The estimated disturbances are integrated into a learning-based controller trained via reinforcement learning. The flow-feedback control proves particularly effective during lateral translation maneuvers in the pipe cross-section. There, the real-time disturbance information enables the controller to effectively counteract transient aerodynamic effects, thereby preventing collisions with the pipe wall. To the best of our knowledge, this work represents the first demonstration of an aerial robot with closed-loop control informed by real-time flow field measurements. This opens new directions for research on flight in aerodynamically complex environments. In addition, our work also sheds light on the characteristic flow structures that emerge during flight in narrow, circular pipes, providing new insights at the intersection of robotics and fluid dynamics.', 'abstract_zh': '自主四旋翼无人机在狭窄管道和隧道等受限空间内的悬停飞行面临着显著挑战，由于不稳定且自诱导的气动干扰。非常近期的进展已经使得在这些条件下飞行成为可能，但这些方法要么依赖于管道内的持续运动以减轻气流回流效应，要么悬停期间稳定性受到限制。在此项工作中，我们提出了第一个基于实时气流场测量的四旋翼无人机悬停在狭窄管道内的闭环控制系统。我们开发了一种低延迟、事件驱动的烟雾速度测量方法，以高时间分辨率估计局部气流。这些流场信息被用于一个基于循环卷积神经网络的干扰估计器中，该估计器可以实时推断出力和力矩干扰。估计得到的干扰信息被集成到一种通过强化学习训练的基于学习的控制器中。流反馈控制在管道横截面内的横向平移机动中显示出特别有效的效果。在那里，实时的干扰信息使得控制器能够有效抵消瞬时气动效应，从而避免与管道壁发生碰撞。据我们所知，这项工作是首个通过实时流场测量指导闭环控制的空中机器人演示。这开启了在气动复杂环境飞行研究的新方向。此外，我们的工作还揭示了在狭窄圆形管道内飞行时出现的典型流场结构，为机器人学与流体力学的交叉领域提供了新的见解。', 'title_zh': '低延迟事件驱动的速度测量在狭窄管道中四旋翼无人机控制'}
{'arxiv_id': 'arXiv:2507.15293', 'title': 'RepILN: Reparameterized Inertial Localization Network', 'authors': 'Shanshan Zhang, Tianshui Wen, Siyue Wang, Qi Zhang, Ziheng Zhou, Lingxiang Zheng, Yu Yang', 'link': 'https://arxiv.org/abs/2507.15293', 'abstract': 'Inertial localization is regarded as a promising positioning solution for consumer-grade IoT devices due to its cost-effectiveness and independence from external infrastructure. However, data-driven inertial localization methods often rely on increasingly complex network architectures to improve accuracy, which challenges the limited computational resources of IoT devices. Moreover, these methods frequently overlook the importance of modeling long-term dependencies in inertial measurements - a critical factor for accurate trajectory reconstruction - thereby limiting localization performance. To address these challenges, we propose a reparameterized inertial localization network that uses a multi-branch structure during training to enhance feature extraction. At inference time, this structure is transformed into an equivalent single-path architecture to improve parameter efficiency. To further capture long-term dependencies in motion trajectories, we introduce a temporal-scale sparse attention mechanism that selectively emphasizes key trajectory segments while suppressing noise. Additionally, a gated convolutional unit is incorporated to effectively integrate long-range dependencies with local fine-grained features. Extensive experiments on public benchmarks demonstrate that our method achieves a favorable trade-off between accuracy and model compactness. For example, on the RoNIN dataset, our approach reduces the Absolute Trajectory Error (ATE) by 2.59% compared to RoNIN-ResNet while reducing the number of parameters by 3.86%.', 'abstract_zh': '基于惯性定位网络：一种多分支结构与时空稀疏注意力机制相结合的方法', 'title_zh': '重构惯性定位网络: 参数化惯性定位网络'}
{'arxiv_id': 'arXiv:2507.15088', 'title': 'Search-Based Autonomous Vehicle Motion Planning Using Game Theory', 'authors': 'Pouya Panahandeh, Mohammad Pirani, Baris Fidan, Amir Khajepour', 'link': 'https://arxiv.org/abs/2507.15088', 'abstract': 'In this paper, we propose a search-based interactive motion planning scheme for autonomous vehicles (AVs), using a game-theoretic approach. In contrast to traditional search-based approaches, the newly developed approach considers other road users (e.g. drivers and pedestrians) as intelligent agents rather than static obstacles. This leads to the generation of a more realistic path for the AV. Due to the low computational time, the proposed motion planning scheme is implementable in real-time applications. The performance of the developed motion planning scheme is compared with existing motion planning techniques and validated through experiments using WATonoBus, an electrical all-weather autonomous shuttle bus.', 'abstract_zh': '基于搜索的游戏论导向自主车辆交互运动规划方法', 'title_zh': '基于搜索的博弈论自主车辆运动规划'}
{'arxiv_id': 'arXiv:2507.14967', 'title': 'Heterogeneous object manipulation on nonlinear soft surface through linear controller', 'authors': 'Pratik Ingle, Kasper Støy, Andres Faiña', 'link': 'https://arxiv.org/abs/2507.14967', 'abstract': 'Manipulation surfaces indirectly control and reposition objects by actively modifying their shape or properties rather than directly gripping objects. These surfaces, equipped with dense actuator arrays, generate dynamic deformations. However, a high-density actuator array introduces considerable complexity due to increased degrees of freedom (DOF), complicating control tasks. High DOF restrict the implementation and utilization of manipulation surfaces in real-world applications as the maintenance and control of such systems exponentially increase with array/surface size. Learning-based control approaches may ease the control complexity, but they require extensive training samples and struggle to generalize for heterogeneous objects. In this study, we introduce a simple, precise and robust PID-based linear close-loop feedback control strategy for heterogeneous object manipulation on MANTA-RAY (Manipulation with Adaptive Non-rigid Textile Actuation with Reduced Actuation density). Our approach employs a geometric transformation-driven PID controller, directly mapping tilt angle control outputs(1D/2D) to actuator commands to eliminate the need for extensive black-box training. We validate the proposed method through simulations and experiments on a physical system, successfully manipulating objects with diverse geometries, weights and textures, including fragile objects like eggs and apples. The outcomes demonstrate that our approach is highly generalized and offers a practical and reliable solution for object manipulation on soft robotic manipulation, facilitating real-world implementation without prohibitive training demands.', 'abstract_zh': '基于MANTA-RAY的异形物体Manipulation的简单、精确和鲁棒PID闭环反馈控制策略', 'title_zh': '非线性软表面上异质物体操控的线性控制器方法'}
{'arxiv_id': 'arXiv:2507.14721', 'title': 'Leveraging Extrinsic Dexterity for Occluded Grasping on Grasp Constraining Walls', 'authors': 'Keita Kobashi, Masayoshi Tomizuka', 'link': 'https://arxiv.org/abs/2507.14721', 'abstract': 'This study addresses the problem of occluded grasping, where primary grasp configurations of an object are not available due to occlusion with environment. Simple parallel grippers often struggle with such tasks due to limited dexterity and actuation constraints. Prior works have explored object pose reorientation such as pivoting by utilizing extrinsic contacts between an object and an environment feature like a wall, to make the object graspable. However, such works often assume the presence of a short wall, and this assumption may not always hold in real-world scenarios. If the wall available for interaction is too large or too tall, the robot may still fail to grasp the object even after pivoting, and the robot must combine different types of actions to grasp. To address this, we propose a hierarchical reinforcement learning (RL) framework. We use Q-learning to train a high-level policy that selects the type of action expected to yield the highest reward. The selected low-level skill then samples a specific robot action in continuous space. To guide the robot to an appropriate location for executing the selected action, we adopt a Conditional Variational Autoencoder (CVAE). We condition the CVAE on the object point cloud and the skill ID, enabling it to infer a suitable location based on the object geometry and the selected skill. To promote generalization, we apply domain randomization during the training of low-level skills. The RL policy is trained entirely in simulation with a box-like object and deployed to six objects in real world. We conduct experiments to evaluate our method and demonstrate both its generalizability and robust sim-to-real transfer performance with promising success rates.', 'abstract_zh': '本研究解决了由于环境遮挡导致物体主要抓持配置不可用的_occluded grasping_问题。简单的并联 gripper 由于灵活性和执行约束有限，在处理此类任务时常常遇到困难。先前的工作通过利用物体与环境特征（如墙壁）之间的外部接触来进行物体姿态重新定向（例如旋转），以使物体变得可抓取。然而，这些工作常常假设存在一个短墙，这在实际场景中并不总是成立的。如果用于交互的墙壁过大或过高，即使在旋转后机器人也可能无法抓取物体，并且机器人必须结合不同类型的行动来完成抓取。为了解决这一问题，我们提出了一种层次强化学习（RL）框架。我们使用Q-learning来训练一个高层策略，以便选择预期能带来最高奖励的操作类型。所选的低层技能随后在连续空间中采样一个具体的操作。为了引导机器人到执行所选操作的合适位置，我们采用了条件变分自编码器（CVAE）。我们将CVAE基于物体点云和技能ID进行条件化，使其能够根据物体几何形状和选定的技能推断出一个合适的位置。为了促进泛化，我们在低层技能的训练过程中应用领域随机化。RL策略完全在仿真中用一个框形物体进行训练，并部署到六个真实世界中的物体上。我们进行了实验来评估我们的方法，并展示了其泛化能力和有希望的成功率，以及模拟到现实世界转移的稳健性能。', 'title_zh': '利用外在灵巧性进行障碍限制下的视觉被遮挡抓取'}
{'arxiv_id': 'arXiv:2507.14700', 'title': 'Corridor-based Adaptive Control Barrier and Lyapunov Functions for Safe Mobile Robot Navigation', 'authors': 'Nicholas Mohammad, Nicola Bezzo', 'link': 'https://arxiv.org/abs/2507.14700', 'abstract': 'Safe navigation in unknown and cluttered environments remains a challenging problem in robotics. Model Predictive Contour Control (MPCC) has shown promise for performant obstacle avoidance by enabling precise and agile trajectory tracking, however, existing methods lack formal safety assurances. To address this issue, we propose a general Control Lyapunov Function (CLF) and Control Barrier Function (CBF) enabled MPCC framework that enforces safety constraints derived from a free-space corridor around the planned trajectory. To enhance feasibility, we dynamically adapt the CBF parameters at runtime using a Soft Actor-Critic (SAC) policy. The approach is validated with extensive simulations and an experiment on mobile robot navigation in unknown cluttered environments.', 'abstract_zh': '在未知且拥挤环境中的安全导航仍然是机器人技术中的一个 Challing 问题。Model Predictive Contour Control (MPCC) 通过使能精确且灵活的轨迹跟踪展现了良好的碰撞避免潜力，然而现有方法缺乏形式化的安全性保证。为了解决这一问题，我们提出了一种通用的基于 Control Lyapunov Function (CLF) 和 Control Barrier Function (CBF) 的 MPCC 框架，该框架通过确保从计划轨迹周围自由空间走廊中导出的安全约束得到满足来实现安全性。为提高可行性，我们使用 Soft Actor-Critic (SAC) 策略在运行时动态调整 CBF 参数。该方法通过详尽的仿真和在未知拥挤环境中的移动机器人导航实验进行了验证。', 'title_zh': '基于走廊的自适应控制屏障和李雅普诺夫函数的安全移动机器人导航'}
{'arxiv_id': 'arXiv:2507.14274', 'title': 'A Recursive Lie-Group Formulation for the Second-Order Time Derivatives of the Inverse Dynamics of parallel Kinematic Manipulators', 'authors': 'Andreas Mueller, Shivesh Kumar, Thomas Kordik', 'link': 'https://arxiv.org/abs/2507.14274', 'abstract': 'Series elastic actuators (SEA) were introduced for serial robotic arms. Their model-based trajectory tracking control requires the second time derivatives of the inverse dynamics solution, for which algorithms were proposed. Trajectory control of parallel kinematics manipulators (PKM) equipped with SEAs has not yet been pursued. Key element for this is the computationally efficient evaluation of the second time derivative of the inverse dynamics solution. This has not been presented in the literature, and is addressed in the present paper for the first time. The special topology of PKM is exploited reusing the recursive algorithms for evaluating the inverse dynamics of serial robots. A Lie group formulation is used and all relations are derived within this framework. Numerical results are presented for a 6-DOF Gough-Stewart platform (as part of an exoskeleton), and for a planar PKM when a flatness-based control scheme is applied.', 'abstract_zh': '基于系列弹性执行器的并联运动 manipulators 轨迹控制：序列弹性执行器 (SEA) 已在串行机器人臂中引入。其基于模型的轨迹跟踪控制需要逆动力学解的二阶时间导数，为此提出了一些算法。装备有 SEA 的并联运动学 manipulators (PKM) 的轨迹控制尚未被研究。这一问题的关键在于逆动力学解的二阶时间导数的高效计算。该问题尚未在文献中被解决，本论文首次对此进行了研究。利用并联运动学的特殊拓扑结构，重用了串行机器人逆动力学计算的递归算法，并使用李群形式表述，推导了所有关系。最后，对于一个 6 自由度 Gough-Stewart 平台 (作为外骨骼的一部分) 和一个平面并联运动学 manipulators，当应用基于平坦性的控制方案时，给出了数值结果。', 'title_zh': '递归群论 formulations 用于并联机械臂逆动力学的二阶时间导数'}
{'arxiv_id': 'arXiv:2507.15594', 'title': 'Improving Functional Reliability of Near-Field Monitoring for Emergency Braking in Autonomous Vehicles', 'authors': 'Junnan Pan, Prodromos Sotiriadis, Vladislav Nenchev, Ferdinand Englberger', 'link': 'https://arxiv.org/abs/2507.15594', 'abstract': 'Autonomous vehicles require reliable hazard detection. However, primary sensor systems may miss near-field obstacles, resulting in safety risks. Although a dedicated fast-reacting near-field monitoring system can mitigate this, it typically suffers from false positives. To mitigate these, in this paper, we introduce three monitoring strategies based on dynamic spatial properties, relevant object sizes, and motion-aware prediction. In experiments in a validated simulation, we compare the initial monitoring strategy against the proposed improvements. The results demonstrate that the proposed strategies can significantly improve the reliability of near-field monitoring systems.', 'abstract_zh': '自主驾驶车辆需要可靠的危险检测。然而，主要传感器系统可能会忽略近场障碍物，导致安全风险。虽然专用的快速反应近场监测系统可以缓解这一问题，但它们通常会面临误报的问题。为缓解这一问题，本文引入了基于动态空间特性、相关对象尺寸和运动感知预测的三种监测策略。在验证模拟实验中，我们将初始监测策略与所提出的改进策略进行了比较。结果表明，所提出的策略可以显著提高近场监测系统的可靠性。', 'title_zh': '提高自动驾驶车辆近场监测在紧急制动功能可靠性'}
{'arxiv_id': 'arXiv:2507.15089', 'title': 'Visual Place Recognition for Large-Scale UAV Applications', 'authors': 'Ioannis Tsampikos Papapetros, Ioannis Kansizoglou, Antonios Gasteratos', 'link': 'https://arxiv.org/abs/2507.15089', 'abstract': 'Visual Place Recognition (vPR) plays a crucial role in Unmanned Aerial Vehicle (UAV) navigation, enabling robust localization across diverse environments. Despite significant advancements, aerial vPR faces unique challenges due to the limited availability of large-scale, high-altitude datasets, which limits model generalization, along with the inherent rotational ambiguity in UAV imagery. To address these challenges, we introduce LASED, a large-scale aerial dataset with approximately one million images, systematically sampled from 170,000 unique locations throughout Estonia over a decade, offering extensive geographic and temporal diversity. Its structured design ensures clear place separation significantly enhancing model training for aerial scenarios. Furthermore, we propose the integration of steerable Convolutional Neural Networks (CNNs) to explicitly handle rotational variance, leveraging their inherent rotational equivariance to produce robust, orientation-invariant feature representations. Our extensive benchmarking demonstrates that models trained on LASED achieve significantly higher recall compared to those trained on smaller, less diverse datasets, highlighting the benefits of extensive geographic coverage and temporal diversity. Moreover, steerable CNNs effectively address rotational ambiguity inherent in aerial imagery, consistently outperforming conventional convolutional architectures, achieving on average 12\\% recall improvement over the best-performing non-steerable network. By combining structured, large-scale datasets with rotation-equivariant neural networks, our approach significantly enhances model robustness and generalization for aerial vPR.', 'abstract_zh': '大规模空中视觉场所识别数据集（LASED）及可旋转的卷积神经网络在空中视觉场所识别中的应用', 'title_zh': '大型无人机应用中的视觉场所识别'}
{'arxiv_id': 'arXiv:2507.15062', 'title': 'Touch in the Wild: Learning Fine-Grained Manipulation with a Portable Visuo-Tactile Gripper', 'authors': 'Xinyue Zhu, Binghao Huang, Yunzhu Li', 'link': 'https://arxiv.org/abs/2507.15062', 'abstract': 'Handheld grippers are increasingly used to collect human demonstrations due to their ease of deployment and versatility. However, most existing designs lack tactile sensing, despite the critical role of tactile feedback in precise manipulation. We present a portable, lightweight gripper with integrated tactile sensors that enables synchronized collection of visual and tactile data in diverse, real-world, and in-the-wild settings. Building on this hardware, we propose a cross-modal representation learning framework that integrates visual and tactile signals while preserving their distinct characteristics. The learning procedure allows the emergence of interpretable representations that consistently focus on contacting regions relevant for physical interactions. When used for downstream manipulation tasks, these representations enable more efficient and effective policy learning, supporting precise robotic manipulation based on multimodal feedback. We validate our approach on fine-grained tasks such as test tube insertion and pipette-based fluid transfer, demonstrating improved accuracy and robustness under external disturbances. Our project page is available at this https URL .', 'abstract_zh': '手持式夹爪越来越多地用于收集人类示范，得益于其易于部署和灵活性。然而，现有大多数设计缺乏触觉感知，尽管触觉反馈在精确操作中起着关键作用。我们提出了一种便携且轻量的集成了触觉传感器的夹爪，能够在多样的现实世界和自然场景中同步收集视觉和触觉数据。基于这一硬件，我们提出了一种跨模态表示学习框架，该框架整合了视觉和触觉信号的同时保留其独特的特征。学习过程使得能够生成可解释的表示，这些表示始终集中在与物理交互相关的接触区域上。在用于下游操作任务时，这些表示能够支持基于多模态反馈的更高效和有效的策略学习，从而实现精确的机器人操作。我们通过细粒度任务如试管插入和移液管液体转移实验验证了该方法，显示了在外部干扰下的改进的准确性和鲁棒性。我们的项目页面可在以下链接访问：this https URL。', 'title_zh': '野生环境中的触觉感知：基于便携式视觉-触觉夹持器的细粒度操作学习'}
