{'arxiv_id': 'arXiv:2509.18084', 'title': 'ByteWrist: A Parallel Robotic Wrist Enabling Flexible and Anthropomorphic Motion for Confined Spaces', 'authors': 'Jiawen Tian, Liqun Huang, Zhongren Cui, Jingchao Qiao, Jiafeng Xu, Xiao Ma, Zeyu Ren', 'link': 'https://arxiv.org/abs/2509.18084', 'abstract': 'This paper introduces ByteWrist, a novel highly-flexible and anthropomorphic parallel wrist for robotic manipulation. ByteWrist addresses the critical limitations of existing serial and parallel wrists in narrow-space operations through a compact three-stage parallel drive mechanism integrated with arc-shaped end linkages. The design achieves precise RPY (Roll-Pitch-Yaw) motion while maintaining exceptional compactness, making it particularly suitable for complex unstructured environments such as home services, medical assistance, and precision assembly. The key innovations include: (1) a nested three-stage motor-driven linkages that minimize volume while enabling independent multi-DOF control, (2) arc-shaped end linkages that optimize force transmission and expand motion range, and (3) a central supporting ball functioning as a spherical joint that enhances structural stiffness without compromising flexibility. Meanwhile, we present comprehensive kinematic modeling including forward / inverse kinematics and a numerical Jacobian solution for precise control. Empirically, we observe ByteWrist demonstrates strong performance in narrow-space maneuverability and dual-arm cooperative manipulation tasks, outperforming Kinova-based systems. Results indicate significant improvements in compactness, efficiency, and stiffness compared to traditional designs, establishing ByteWrist as a promising solution for next-generation robotic manipulation in constrained environments.', 'abstract_zh': 'ByteWrist: 一种新颖的高度灵活类人并联手腕，用于机器人操作', 'title_zh': 'ByteWrist：一种 Enables  Flexible 和类人运动的并行机器人腕部机构 适用于受限空间'}
{'arxiv_id': 'arXiv:2509.17884', 'title': 'The Surprising Effectiveness of Linear Models for Whole-Body Model-Predictive Control', 'authors': 'Arun L. Bishop, Juan Alvarez-Padilla, Sam Schoedel, Ibrahima Sory Sow, Juee Chandrachud, Sheitej Sharma, Will Kraus, Beomyeong Park, Robert J. Griffin, John M. Dolan, Zachary Manchester', 'link': 'https://arxiv.org/abs/2509.17884', 'abstract': 'When do locomotion controllers require reasoning about nonlinearities? In this work, we show that a whole-body model-predictive controller using a simple linear time-invariant approximation of the whole-body dynamics is able to execute basic locomotion tasks on complex legged robots. The formulation requires no online nonlinear dynamics evaluations or matrix inversions. We demonstrate walking, disturbance rejection, and even navigation to a goal position without a separate footstep planner on a quadrupedal robot. In addition, we demonstrate dynamic walking on a hydraulic humanoid, a robot with significant limb inertia, complex actuator dynamics, and large sim-to-real gap.', 'abstract_zh': '当运动控制器需要推理非线性时？在本文中，我们表明，使用全身动力学的简单线性时不变近似值的全身模型预测控制器能够在复杂的腿足机器人上执行基本的运动任务。该公式化不需要在线评估非线性动力学或矩阵求逆。我们证明了四足机器人在没有独立脚步规划器的情况下进行行走、干扰抑制，甚至目标位置导航。此外，我们还在一个液压人形机器人上展示了动态行走，该机器人具有显著的肢体惯性、复杂的致动器动力学以及较大的仿真实际差距。', 'title_zh': '全局人体模型预测控制中线性模型的 surprising 效果'}
{'arxiv_id': 'arXiv:2509.17683', 'title': 'Towards Learning Boulder Excavation with Hydraulic Excavators', 'authors': 'Jonas Gruetter, Lorenzo Terenzi, Pascal Egli, Marco Hutter', 'link': 'https://arxiv.org/abs/2509.17683', 'abstract': 'Construction sites frequently require removing large rocks before excavation or grading can proceed. Human operators typically extract these boulders using only standard digging buckets, avoiding time-consuming tool changes to specialized grippers. This task demands manipulating irregular objects with unknown geometries in harsh outdoor environments where dust, variable lighting, and occlusions hinder perception. The excavator must adapt to varying soil resistance--dragging along hard-packed surfaces or penetrating soft ground--while coordinating multiple hydraulic joints to secure rocks using a shovel. Current autonomous excavation focuses on continuous media (soil, gravel) or uses specialized grippers with detailed geometric planning for discrete objects. These approaches either cannot handle large irregular rocks or require impractical tool changes that interrupt workflow. We train a reinforcement learning policy in simulation using rigid-body dynamics and analytical soil models. The policy processes sparse LiDAR points (just 20 per rock) from vision-based segmentation and proprioceptive feedback to control standard excavator buckets. The learned agent discovers different strategies based on soil resistance: dragging along the surface in hard soil and penetrating directly in soft conditions. Field tests on a 12-ton excavator achieved 70% success across varied rocks (0.4-0.7m) and soil types, compared to 83% for human operators. This demonstrates that standard construction equipment can learn complex manipulation despite sparse perception and challenging outdoor conditions.', 'abstract_zh': '基于强化学习的挖掘机在复杂环境下的大块不规则岩石挖掘策略学习', 'title_zh': '基于液压 excavator 学习石跞开挖'}
{'arxiv_id': 'arXiv:2509.17572', 'title': 'Morphologies of a sagging elastica with intrinsic sensing and actuation', 'authors': 'Vishnu Deo Mishra, S Ganga Prasath', 'link': 'https://arxiv.org/abs/2509.17572', 'abstract': 'The morphology of a slender soft-robot can be modified by sensing its shape via sensors and exerting moments via actuators embedded along its body. The actuating moments required to morph these soft-robots to a desired shape are often difficult to compute due to the geometric non-linearity associated with the structure, the errors in modeling the experimental system, and the limitations in sensing and feedback/actuation capabilities. In this article, we explore the effect of a simple feedback strategy (actuation being proportional to the sensed curvature) on the shape of a soft-robot, modeled as an elastica. The finite number of sensors and actuators, often seen in experiments, is captured in the model via filters of specified widths. Using proportional feedback, we study the simple task of straightening the device by compensating for the sagging introduced by its self-weight. The device undergoes a hierarchy of morphological instabilities defined in the phase-space given by the gravito-bending number, non-dimensional sensing/feedback gain, and the scaled width of the filter. For complex shape-morphing tasks, given a perfect model of the device with limited sensing and actuating capabilities, we find that a trade-off arises (set by the sensor spacing & actuator size) between capturing the long and short wavelength features. We show that the error in shape-morphing is minimal for a fixed filter width when we choose an appropriate actuating gain (whose magnitude goes as a square of the filter width). Our model provides a quantitative lens to study and design slender soft devices with limited sensing and actuating capabilities for complex maneuvering applications.', 'abstract_zh': '一种简单的反馈策略对作为弹性体建模的柔体机器人的形态的影响：有限传感器和执行器数量的建模及其在直立任务中的应用', 'title_zh': '具有内在传感和驱动的下垂弹铁的形态学研究'}
{'arxiv_id': 'arXiv:2509.17450', 'title': 'Learning Dexterous Manipulation with Quantized Hand State', 'authors': 'Ying Feng, Hongjie Fang, Yinong He, Jingjing Chen, Chenxi Wang, Zihao He, Ruonan Liu, Cewu Lu', 'link': 'https://arxiv.org/abs/2509.17450', 'abstract': 'Dexterous robotic hands enable robots to perform complex manipulations that require fine-grained control and adaptability. Achieving such manipulation is challenging because the high degrees of freedom tightly couple hand and arm motions, making learning and control difficult. Successful dexterous manipulation relies not only on precise hand motions, but also on accurate spatial positioning of the arm and coordinated arm-hand dynamics. However, most existing visuomotor policies represent arm and hand actions in a single combined space, which often causes high-dimensional hand actions to dominate the coupled action space and compromise arm control. To address this, we propose DQ-RISE, which quantizes hand states to simplify hand motion prediction while preserving essential patterns, and applies a continuous relaxation that allows arm actions to diffuse jointly with these compact hand states. This design enables the policy to learn arm-hand coordination from data while preventing hand actions from overwhelming the action space. Experiments show that DQ-RISE achieves more balanced and efficient learning, paving the way toward structured and generalizable dexterous manipulation. Project website: this http URL', 'abstract_zh': '灵巧机器人手使机器人能够执行需要精细控制和适应性的复杂操作。实现这种操作具有挑战性，因为高自由度紧密耦合了手部和臂部运动，使得学习和控制变得困难。成功的灵巧操作不仅依赖于精确的手部运动，还依赖于准确的臂部空间定位和协调的手臂-手部动态。然而，大多数现有的视觉-运动策略在单一联合空间中表示臂部和手部动作，这通常会导致高维手部动作主导耦合的动作空间，从而削弱对臂部的控制。为了解决这个问题，我们提出了一种DQ-RISE方法，通过量化手部状态简化手部运动预测并保留关键模式，并应用连续松弛，使臂部动作能够与这些紧凑的手部状态共同扩散。这种设计使得策略能够在数据中学习手臂-手部协调，同时防止手部动作主导动作空间。实验表明，DQ-RISE实现了更均衡高效的训练，为结构化和泛化的灵巧操作铺平了道路。项目网站：这个链接', 'title_zh': '基于量化手部状态的学习灵巧操作'}
{'arxiv_id': 'arXiv:2509.17435', 'title': 'GPS Denied IBVS-Based Navigation and Collision Avoidance of UAV Using a Low-Cost RGB Camera', 'authors': 'Xiaoyu Wang, Yan Rui Tan, William Leong, Sunan Huang, Rodney Teo, Cheng Xiang', 'link': 'https://arxiv.org/abs/2509.17435', 'abstract': 'This paper proposes an image-based visual servoing (IBVS) framework for UAV navigation and collision avoidance using only an RGB camera. While UAV navigation has been extensively studied, it remains challenging to apply IBVS in missions involving multiple visual targets and collision avoidance. The proposed method achieves navigation without explicit path planning, and collision avoidance is realized through AI-based monocular depth estimation from RGB images. Unlike approaches that rely on stereo cameras or external workstations, our framework runs fully onboard a Jetson platform, ensuring a self-contained and deployable system. Experimental results validate that the UAV can navigate across multiple AprilTags and avoid obstacles effectively in GPS-denied environments.', 'abstract_zh': '基于RGB相机的无人机视觉伺服导航与避障框架', 'title_zh': 'GPS拒航基于RGB相机的IBVS导航与避碰 UAV'}
{'arxiv_id': 'arXiv:2509.17389', 'title': '3D Printable Soft Liquid Metal Sensors for Delicate Manipulation Tasks', 'authors': 'Lois Liow, Jonty Milford, Emre Uygun, Andre Farinha, Vinoth Viswanathan, Josh Pinskier, David Howard', 'link': 'https://arxiv.org/abs/2509.17389', 'abstract': "Robotics and automation are key enablers to increase throughput in ongoing conservation efforts across various threatened ecosystems. Cataloguing, digitisation, husbandry, and similar activities require the ability to interact with delicate, fragile samples without damaging them. Additionally, learning-based solutions to these tasks require the ability to safely acquire data to train manipulation policies through, e.g., reinforcement learning. To address these twin needs, we introduce a novel method to print free-form, highly sensorised soft 'physical twins'. We present an automated design workflow to create complex and customisable 3D soft sensing structures on demand from 3D scans or models. Compared to the state of the art, our soft liquid metal sensors faithfully recreate complex natural geometries and display excellent sensing properties suitable for validating performance in delicate manipulation tasks. We demonstrate the application of our physical twins as 'sensing corals': high-fidelity, 3D printed replicas of scanned corals that eliminate the need for live coral experimentation, whilst increasing data quality, offering an ethical and scalable pathway for advancing autonomous coral handling and soft manipulation broadly. Through extensive bench-top manipulation and underwater grasping experiments, we show that our sensing coral is able to detect grasps under 0.5 N, effectively capturing the delicate interactions and light contact forces required for coral handling. Finally, we showcase the value of our physical twins across two demonstrations: (i) automated coral labelling for lab identification and (ii) robotic coral aquaculture. Sensing physical twins such as ours can provide richer grasping feedback than conventional sensors providing experimental validation of prior to deployment in handling fragile and delicate items.", 'abstract_zh': '机器人技术和自动化是增加各种受威胁生态系统中持续保护努力 throughput 的关键使能器。通过目录整理、数字化、饲养和类似活动需要能够安全地与脆弱样本交互而不会损坏它们的能力。此外，这些任务的学习解决方案需要能够安全地获取用于通过增强学习等方法训练操作策略的数据。为了解决这些双重需求，我们提出了一种新型方法来打印自由形变、高度传感器化的软“物理双胞胎”。我们提出了一种自动设计工作流，可以根据3D扫描或模型从头创建复杂的可定制3D软传感器结构。与现有技术相比，我们的软液态金属传感器忠实再现了复杂的自然几何形状，并展示了出色的传感性能，适用于敏感操作任务性能验证。我们展示了我们的“传感珊瑚”物理双胞胎的应用：高保真度的3D打印扫描珊瑚复制品，消除了活珊瑚实验的需要，同时提高数据质量，为自动化珊瑚处理和广泛软操作提供了一种伦理性和扩展性路径。通过广泛的台式操作和水下抓取实验，我们证明了我们的传感珊瑚能够检测低于0.5 N的抓取力，有效地捕捉到处理珊瑚所需的微妙互动和轻微接触力。最后，我们通过两个演示展示了我们物理双胞胎的价值：(i) 自动化珊瑚标记用于实验室标识；(ii) 机器人珊瑚养殖。类似我们的传感物理双胞胎可以提供比传统传感器更丰富的抓取反馈，从而在操作脆弱和精细物品前提供实验验证。', 'title_zh': '可用于精细操作任务的3D可打印软液态金属传感器'}
{'arxiv_id': 'arXiv:2509.17387', 'title': 'High-Precision and High-Efficiency Trajectory Tracking for Excavators Based on Closed-Loop Dynamics', 'authors': 'Ziqing Zou, Cong Wang, Yue Hu, Xiao Liu, Bowen Xu, Rong Xiong, Changjie Fan, Yingfeng Chen, Yue Wang', 'link': 'https://arxiv.org/abs/2509.17387', 'abstract': 'The complex nonlinear dynamics of hydraulic excavators, such as time delays and control coupling, pose significant challenges to achieving high-precision trajectory tracking. Traditional control methods often fall short in such applications due to their inability to effectively handle these nonlinearities, while commonly used learning-based methods require extensive interactions with the environment, leading to inefficiency. To address these issues, we introduce EfficientTrack, a trajectory tracking method that integrates model-based learning to manage nonlinear dynamics and leverages closed-loop dynamics to improve learning efficiency, ultimately minimizing tracking errors. We validate our method through comprehensive experiments both in simulation and on a real-world excavator. Comparative experiments in simulation demonstrate that our method outperforms existing learning-based approaches, achieving the highest tracking precision and smoothness with the fewest interactions. Real-world experiments further show that our method remains effective under load conditions and possesses the ability for continual learning, highlighting its practical applicability. For implementation details and source code, please refer to this https URL.', 'abstract_zh': '基于模型的学习集成和闭环动力学的高效轨迹跟踪方法：一种应对液压挖掘机复杂非线性动态的新策略', 'title_zh': '基于闭环动力学的高精度高效率挖掘机制动轨迹跟踪'}
{'arxiv_id': 'arXiv:2509.17381', 'title': 'Fast Trajectory Planner with a Reinforcement Learning-based Controller for Robotic Manipulators', 'authors': 'Yongliang Wang, Hamidreza Kasaei', 'link': 'https://arxiv.org/abs/2509.17381', 'abstract': "Generating obstacle-free trajectories for robotic manipulators in unstructured and cluttered environments remains a significant challenge. Existing motion planning methods often require additional computational effort to generate the final trajectory by solving kinematic or dynamic equations. This paper highlights the strong potential of model-free reinforcement learning methods over model-based approaches for obstacle-free trajectory planning in joint space. We propose a fast trajectory planning system for manipulators that combines vision-based path planning in task space with reinforcement learning-based obstacle avoidance in joint space. We divide the framework into two key components. The first introduces an innovative vision-based trajectory planner in task space, leveraging the large-scale fast segment anything (FSA) model in conjunction with basis spline (B-spline)-optimized kinodynamic path searching. The second component enhances the proximal policy optimization (PPO) algorithm by integrating action ensembles (AE) and policy feedback (PF), which greatly improve precision and stability in goal-reaching and obstacle avoidance within the joint space. These PPO enhancements increase the algorithm's adaptability across diverse robotic tasks, ensuring consistent execution of commands from the first component by the manipulator, while also enhancing both obstacle avoidance efficiency and reaching accuracy. The experimental results demonstrate the effectiveness of PPO enhancements, as well as simulation-to-simulation (Sim-to-Sim) and simulation-to-reality (Sim-to-Real) transfer, in improving model robustness and planner efficiency in complex scenarios. These enhancements allow the robot to perform obstacle avoidance and real-time trajectory planning in obstructed environments. Project page available at: this https URL", 'abstract_zh': '在未结构化和拥挤环境中生成无碰撞轨迹机器人操作器路径规划仍然是一个重大挑战。现有运动规划方法通常需要通过求解运动学或动力学方程来额外计算生成最终轨迹。本文强调了在关节数学空间中实现无碰撞轨迹规划时，基于模型的强化学习方法相对于基于模型的方法的强大潜力。我们提出了一种结合任务空间基于视觉的路径规划和关节数学空间基于强化学习的避障的快速轨迹规划系统。该框架分为两个关键部分。第一部分引入了一种创新的基于视觉的轨迹规划器，利用大规模快速段一切（FSA）模型与B样条优化的运动力学路径搜索结合。第二部分通过集成动作集合（AE）和策略反馈（PF）来增强亲近策略优化（PPO）算法，这大大提高了在关节数学空间中目标获取和避障的精确性和稳定性。这些PPO增强提高了算法在多种机器人任务中的适应性，确保了操作器的一致执行，并提高了避障效率和到达精度。实验结果证明了PPO增强、仿真到仿真（Sim-to-Sim）和仿真到现实（Sim-to-Real）转移在复杂场景中提高模型鲁棒性和规划效率的有效性。这些增强使机器人能够在受限环境中进行避障和实时路径规划。项目页面可见于：this https URL', 'title_zh': '基于强化学习的控制器的快速轨迹规划器用于机器人 manipulator'}
{'arxiv_id': 'arXiv:2509.17340', 'title': 'AERO-MPPI: Anchor-Guided Ensemble Trajectory Optimization for Agile Mapless Drone Navigation', 'authors': 'Xin Chen, Rui Huang, Longbin Tang, Lin Zhao', 'link': 'https://arxiv.org/abs/2509.17340', 'abstract': 'Agile mapless navigation in cluttered 3D environments poses significant challenges for autonomous drones. Conventional mapping-planning-control pipelines incur high computational cost and propagate estimation errors. We present AERO-MPPI, a fully GPU-accelerated framework that unifies perception and planning through an anchor-guided ensemble of Model Predictive Path Integral (MPPI) optimizers. Specifically, we design a multi-resolution LiDAR point-cloud representation that rapidly extracts spatially distributed "anchors" as look-ahead intermediate endpoints, from which we construct polynomial trajectory guides to explore distinct homotopy path classes. At each planning step, we run multiple MPPI instances in parallel and evaluate them with a two-stage multi-objective cost that balances collision avoidance and goal reaching. Implemented entirely with NVIDIA Warp GPU kernels, AERO-MPPI achieves real-time onboard operation and mitigates the local-minima failures of single-MPPI approaches. Extensive simulations in forests, verticals, and inclines demonstrate sustained reliable flight above 7 m/s, with success rates above 80% and smoother trajectories compared to state-of-the-art baselines. Real-world experiments on a LiDAR-equipped quadrotor with NVIDIA Jetson Orin NX 16G confirm that AERO-MPPI runs in real time onboard and consistently achieves safe, agile, and robust flight in complex cluttered environments. The code will be open-sourced upon acceptance of the paper.', 'abstract_zh': '无地图敏捷导航在复杂3D环境中的实现：AERO-MPPI框架', 'title_zh': 'AERO-MPPI: 基于锚点引导的集成轨迹优化无地图敏捷无人机导航'}
{'arxiv_id': 'arXiv:2509.17308', 'title': 'Pose Estimation of a Cable-Driven Serpentine Manipulator Utilizing Intrinsic Dynamics via Physical Reservoir Computing', 'authors': 'Kazutoshi Tanaka, Tomoya Takahashi, Masashi Hamaya', 'link': 'https://arxiv.org/abs/2509.17308', 'abstract': "Cable-driven serpentine manipulators hold great potential in unstructured environments, offering obstacle avoidance, multi-directional force application, and a lightweight design. By placing all motors and sensors at the base and employing plastic links, we can further reduce the arm's weight. To demonstrate this concept, we developed a 9-degree-of-freedom cable-driven serpentine manipulator with an arm length of 545 mm and a total mass of only 308 g. However, this design introduces flexibility-induced variations, such as cable slack, elongation, and link deformation. These variations result in discrepancies between analytical predictions and actual link positions, making pose estimation more challenging. To address this challenge, we propose a physical reservoir computing based pose estimation method that exploits the manipulator's intrinsic nonlinear dynamics as a high-dimensional reservoir. Experimental results show a mean pose error of 4.3 mm using our method, compared to 4.4 mm with a baseline long short-term memory network and 39.5 mm with an analytical approach. This work provides a new direction for control and perception strategies in lightweight cable-driven serpentine manipulators leveraging their intrinsic dynamics.", 'abstract_zh': '基于物理资源计算的电缆驱动蛇形 manipulator 姿态估计方法研究', 'title_zh': '基于物理蓄水池计算的缆索驱动蛇形 manipulator 姿态估计利用固有动力学'}
{'arxiv_id': 'arXiv:2509.17210', 'title': 'Combining Performance and Passivity in Linear Control of Series Elastic Actuators', 'authors': 'Shaunak A. Mehta, Dylan P. Losey', 'link': 'https://arxiv.org/abs/2509.17210', 'abstract': "When humans physically interact with robots, we need the robots to be both safe and performant. Series elastic actuators (SEAs) fundamentally advance safety by introducing compliant actuation. On the one hand, adding a spring mitigates the impact of accidental collisions between human and robot; but on the other hand, this spring introduces oscillations and fundamentally decreases the robot's ability to perform precise, accurate motions. So how should we trade off between physical safety and performance? In this paper, we enumerate the different linear control and mechanical configurations for series elastic actuators, and explore how each choice affects the rendered compliance, passivity, and tracking performance. While prior works focus on load side control, we find that actuator side control has significant benefits. Indeed, simple PD controllers on the actuator side allow for a much wider range of control gains that maintain safety, and combining these with a damper in the elastic transmission yields high performance. Our simulations and real world experiments suggest that, by designing a system with low physical stiffness and high controller gains, this solution enables accurate performance while also ensuring user safety during collisions.", 'abstract_zh': '人类与机器人物理交互时，需要机器人兼具安全性和高性能。系列弹性执行器（SEAs）通过引入柔顺驱动从根本上提高了安全性。一方面，加入弹簧可以缓解人类与机器人之间的意外碰撞影响；但另一方面，弹簧会引入振荡并从根本上降低机器人精确、准确运动的能力。那么，我们该如何在物理安全与性能之间进行权衡？在本文中，我们列出了系列弹性执行器的不同线性控制和机械配置方式，并探索每种选择如何影响柔顺性、耗散性和跟踪性能。虽然以前的研究主要集中在负载侧控制上，但我们发现执行器侧控制具有显著优势。实际上，在执行器侧使用简单的PD控制器可以实现更广泛的控制增益，同时保持安全性，并结合弹性传动中的阻尼器可以获得高性能。我们的仿真和实际实验表明，通过设计一个物理刚度低且控制器增益高的系统，这种解决方案可以在确保碰撞期间用户安全的同时实现精确的性能。', 'title_zh': '结合线性控制中系列弹性执行器的性能与.passivity'}
{'arxiv_id': 'arXiv:2509.16966', 'title': 'Geometric Interpolation of Rigid Body Motions', 'authors': 'Andreas Mueller', 'link': 'https://arxiv.org/abs/2509.16966', 'abstract': 'The problem of interpolating a rigid body motion is to find a spatial trajectory between a prescribed initial and terminal pose. Two variants of this interpolation problem are addressed. The first is to find a solution that satisfies initial conditions on the k-1 derivatives of the rigid body twist. This is called the kth-order initial value trajectory interpolation problem (k-IV-TIP). The second is to find a solution that satisfies conditions on the rigid body twist and its k-1 derivatives at the initial and terminal pose. This is called the kth-order boundary value trajectory interpolation problem (k-BV-TIP). Solutions to the k-IV-TIP for k=1,...,4, i.e. the initial twist and up to the 4th time derivative are prescribed. Further, a solution to the 1-IV-TBP is presented, i.e. the initial and terminal twist are prescribed. The latter is a novel cubic interpolation between two spatial configurations with given initial and terminal twist. This interpolation is automatically identical to the minimum acceleration curve when the twists are set to zero. The general approach to derive higher-order solutions is presented. Numerical results are shown for two examples.', 'abstract_zh': '刚体运动插值问题是在给定初末姿态条件下寻找空间轨迹的问题。本文讨论了该插值问题的两种变体。第一种是寻找满足初始姿态处刚体 twist 及其 k-1 阶导数的解，称为 k 阶初始值轨迹插值问题（k-IV-TIP）。第二种是寻找满足初末姿态处刚体 twist 及其 k-1 阶导数的解，称为 k 阶边界值轨迹插值问题（k-BV-TIP）。对于 k=1,...,4 的 k-IV-TIP，即初末 twist 及至第四阶时间导数被给定。此外，提出了 1-IV-TBP 的解，即初末 twist 被给定。后者是具有给定初末 twist 的两种空间配置之间的新型三次插值。当 twist 设为零时，这种插值自动等同于最小加速度曲线。提出了推导高阶解的一般方法。给出了两个示例的数值结果。', 'title_zh': '刚体运动的几何插值'}
{'arxiv_id': 'arXiv:2509.16550', 'title': 'TranTac: Leveraging Transient Tactile Signals for Contact-Rich Robotic Manipulation', 'authors': 'Yinghao Wu, Shuhong Hou, Haowen Zheng, Yichen Li, Weiyi Lu, Xun Zhou, Yitian Shao', 'link': 'https://arxiv.org/abs/2509.16550', 'abstract': "Robotic manipulation tasks such as inserting a key into a lock or plugging a USB device into a port can fail when visual perception is insufficient to detect misalignment. In these situations, touch sensing is crucial for the robot to monitor the task's states and make precise, timely adjustments. Current touch sensing solutions are either insensitive to detect subtle changes or demand excessive sensor data. Here, we introduce TranTac, a data-efficient and low-cost tactile sensing and control framework that integrates a single contact-sensitive 6-axis inertial measurement unit within the elastomeric tips of a robotic gripper for completing fine insertion tasks. Our customized sensing system can detect dynamic translational and torsional deformations at the micrometer scale, enabling the tracking of visually imperceptible pose changes of the grasped object. By leveraging transformer-based encoders and diffusion policy, TranTac can imitate human insertion behaviors using transient tactile cues detected at the gripper's tip during insertion processes. These cues enable the robot to dynamically control and correct the 6-DoF pose of the grasped object. When combined with vision, TranTac achieves an average success rate of 79% on object grasping and insertion tasks, outperforming both vision-only policy and the one augmented with end-effector 6D force/torque sensing. Contact localization performance is also validated through tactile-only misaligned insertion tasks, achieving an average success rate of 88%. We assess the generalizability by training TranTac on a single prism-slot pair and testing it on unseen data, including a USB plug and a metal key, and find that the insertion tasks can still be completed with an average success rate of nearly 70%. The proposed framework may inspire new robotic tactile sensing systems for delicate manipulation tasks.", 'abstract_zh': '基于触觉感知和控制的TranTac框架：用于精细插入任务的低功耗和低成本触觉传感与控制框架', 'title_zh': 'TranTac: 利用瞬态触觉信号进行接触丰富型机器人 manipulation'}
{'arxiv_id': 'arXiv:2509.16492', 'title': 'Substrate-Timing-Independence for Meta-State Stability of Distributed Robotic Swarms', 'authors': 'Tinapat Limsila, Mehul Sharma, Paulo Garcia', 'link': 'https://arxiv.org/abs/2509.16492', 'abstract': 'Emergent properties in distributed systems arise due to timing unpredictability; asynchronous state evolution within each sub-system may lead the macro-system to faulty meta-states. Empirical validation of correctness is often prohibitively expensive, as the size of the state-space is too large to be tractable. In robotic swarms this problem is exacerbated, when compared to software systems, by the variability of the implementation substrate across the design, or even the deployment, process. We present an approach for formally reasoning about the correctness of robotic swarm design in a substrate-timing-independent way. By leveraging concurrent process calculi (namely, Communicating Sequential Processes), we introduce a methodology that can automatically identify possible causes of faulty meta-states and correct such designs such that meta-states are consistently stable, even in the presence of timing variability due to substrate changes. We evaluate this approach on a robotic swarm with a clearly identified fault, realized in both simulation and reality. Results support the research hypothesis, showing that the swarm reaches an illegal meta-state before the correction is applied, but behaves consistently correctly after the correction. Our techniques are transferable across different design methodologies, contributing to the toolbox of formal methods for roboticists.', 'abstract_zh': '分布式系统中涌现的性质源于时间不可预测性；子系统中的异步状态演化可能导致宏观系统进入错误的元状态。由于状态空间的大小难以处理，正确性的经验验证往往是代价高昂的。在机器人集群中，与软件系统相比，这种问题在设计或部署过程中因实现载体的变异性而加剧。我们提出了一种在不依赖底层架构时间特性的情况下形式化推理机器人集群设计正确性的方法。通过利用并发过程计算（如通信顺序过程），我们介绍了一种方法，可以自动识别可能导致错误元状态的原因，并修正这些设计，使得即使在底层架构变化导致时间变异的情况下，元状态也能保持一致的稳定。我们通过一个具有明确故障的机器人集群的仿真和实际应用评估了这种方法。结果支持研究假设，表明在应用修正之前集群进入了一个非法的元状态，但在应用修正后表现出一致的正确行为。我们的技术在不同设计方法之间具有可转移性，为机器人科学家提供了形式化方法工具箱的贡献。', 'title_zh': '元状态稳定性中分布式机器人群的衬底时间无关性'}
{'arxiv_id': 'arXiv:2509.16482', 'title': 'Robot Conga: A Leader-Follower Walking Approach to Sequential Path Following in Multi-Agent Systems', 'authors': 'Pranav Tiwari, Soumyodipta Nath', 'link': 'https://arxiv.org/abs/2509.16482', 'abstract': "Coordinated path following in multi-agent systems is a key challenge in robotics, with applications in automated logistics, surveillance, and collaborative exploration. Traditional formation control techniques often rely on time-parameterized trajectories and path integrals, which can result in synchronization issues and rigid behavior. In this work, we address the problem of sequential path following, where agents maintain fixed spatial separation along a common trajectory, guided by a leader under centralized control. We introduce Robot Conga, a leader-follower control strategy that updates each agent's desired state based on the leader's spatial displacement rather than time, assuming access to a global position reference, an assumption valid in indoor environments equipped with motion capture, vision-based tracking, or UWB localization systems. The algorithm was validated in simulation using both TurtleBot3 and quadruped (Laikago) robots. Results demonstrate accurate trajectory tracking, stable inter-agent spacing, and fast convergence, with all agents aligning within 250 time steps (approx. 0.25 seconds) in the quadruped case, and almost instantaneously in the TurtleBot3 implementation.", 'abstract_zh': '多agent系统中的协调路径跟随是机器人技术中的一个关键挑战，应用于自动化物流、监视和协作探索领域。传统的 formations 控制技术通常依赖于时间参数化的轨迹和路径积分，这可能导致同步问题和僵硬的行为。在本文中，我们解决了顺序路径跟随的问题，其中代理在集中控制下由领导者引导，沿共同轨迹保持固定的 Spatial 分离。我们引入了 Robot Conga，这是一种领导者跟随控制策略，基于领导者的位置位移而非时间来更新每个代理的目标状态，假设可以访问全局位置参考，这一假设在配备有运动捕捉、基于视觉的跟踪或UWB定位系统的室内环境中是有效的。该算法在使用TurtleBot3和四足机器人（Laikago）的仿真中得到了验证。结果表明，轨迹跟踪准确，代理间间距稳定，且快速收敛，在四足机器人的情况下，所有代理在约250个时间步（约0.25秒）内对齐，在TurtleBot3实现中几乎是即时的。', 'title_zh': 'Robot Conga：多Agent系统中序列路径跟随的领导者-跟随者行走方法'}
{'arxiv_id': 'arXiv:2509.16353', 'title': 'Tactile-Based Human Intent Recognition for Robot Assistive Navigation', 'authors': 'Shaoting Peng, Dakarai Crowder, Wenzhen Yuan, Katherine Driggs-Campbell', 'link': 'https://arxiv.org/abs/2509.16353', 'abstract': "Robot assistive navigation (RAN) is critical for enhancing the mobility and independence of the growing population of mobility-impaired individuals. However, existing systems often rely on interfaces that fail to replicate the intuitive and efficient physical communication observed between a person and a human caregiver, limiting their effectiveness. In this paper, we introduce Tac-Nav, a RAN system that leverages a cylindrical tactile skin mounted on a Stretch 3 mobile manipulator to provide a more natural and efficient interface for human navigational intent recognition. To robustly classify the tactile data, we developed the Cylindrical Kernel Support Vector Machine (CK-SVM), an algorithm that explicitly models the sensor's cylindrical geometry and is consequently robust to the natural rotational shifts present in a user's grasp. Comprehensive experiments were conducted to demonstrate the effectiveness of our classification algorithm and the overall system. Results show that CK-SVM achieved superior classification accuracy on both simulated (97.1%) and real-world (90.8%) datasets compared to four baseline models. Furthermore, a pilot study confirmed that users more preferred the Tac-Nav tactile interface over conventional joystick and voice-based controls.", 'abstract_zh': '机器人辅助导航（RAN）对于提高行动障碍人口的移动能力和独立性至关重要。然而，现有系统往往依赖于无法复制人类与人类护理人员之间直观和高效的物理通信的接口，限制了其有效性。在本文中，我们提出了Tac-Nav，这是一种利用安装在Stretch 3移动 manipulator上的圆柱形触觉皮肤的RAN系统，以提供一种更自然和高效的接口，用于识别人类导航意图。为了 robust 地分类触觉数据，我们开发了圆柱核支持向量机（CK-SVM）算法，该算法明确模型了传感器的圆柱几何结构，并因此能够抵抗用户抓取过程中自然存在的旋转偏移。全面的实验展示了我们的分类算法和整体系统的有效性。结果显示，CK-SVM在仿真数据集（97.1%）和真实世界数据集（90.8%）上的分类准确性均优于四个基准模型。此外，初步研究表明，用户更偏好Tac-Nav的触觉界面，而不是传统的摇杆和语音控制。', 'title_zh': '基于触觉的人类意图识别在机器人辅助导航中的应用'}
{'arxiv_id': 'arXiv:2509.16261', 'title': 'RaFD: Flow-Guided Radar Detection for Robust Autonomous Driving', 'authors': 'Shuocheng Yang, Zikun Xu, Jiahao Wang, Shahid Nawaz, Jianqiang Wang, Shaobing Xu', 'link': 'https://arxiv.org/abs/2509.16261', 'abstract': 'Radar has shown strong potential for robust perception in autonomous driving; however, raw radar images are frequently degraded by noise and "ghost" artifacts, making object detection based solely on semantic features highly challenging. To address this limitation, we introduce RaFD, a radar-based object detection framework that estimates inter-frame bird\'s-eye-view (BEV) flow and leverages the resulting geometric cues to enhance detection accuracy. Specifically, we design a supervised flow estimation auxiliary task that is jointly trained with the detection network. The estimated flow is further utilized to guide feature propagation from the previous frame to the current one. Our flow-guided, radar-only detector achieves achieves state-of-the-art performance on the RADIATE dataset, underscoring the importance of incorporating geometric information to effectively interpret radar signals, which are inherently ambiguous in semantics.', 'abstract_zh': '雷达在自动驾驶中显示出了强大的稳健感知潜力；然而，原始雷达图像经常受到噪声和“鬼影”伪影的干扰，使得基于语义特征的目标检测极具挑战性。为了解决这一局限，我们引入了基于雷达的目标检测框架RaFD，该框架估计帧间鸟瞰视角（BEV）流，并利用由此产生的几何线索来提升检测准确性。具体而言，我们设计了一个监督下的流估计辅助任务，该任务与检测网络联合训练。估计的流进一步用于引导从上一帧到当前帧的特征传播。我们的由流引导的纯雷达检测器在RADIATE数据集上达到了领先性能，强调了在本质上难以通过语义解释的雷达信号中整合几何信息的重要性。', 'title_zh': '基于流引导的雷达检测方法在鲁棒自动驾驶中的应用'}
{'arxiv_id': 'arXiv:2509.16365', 'title': 'Servos for Local Map Exploration Onboard Nonholonomic Vehicles for Extremum Seeking', 'authors': 'Dylan James-Kavanaugh, Patrick McNamee, Qixu Wang, Zahra Nili Ahmadabadi', 'link': 'https://arxiv.org/abs/2509.16365', 'abstract': 'Extremum seeking control (ESC) often employs perturbation-based estimates of derivatives for some sensor field or cost function. These estimates are generally obtained by simply multiplying the output of a single-unit sensor by some time-varying function. Previous work has focused on sinusoidal perturbations to generate derivative estimates with results for arbitrary order derivatives of scalar maps or higher up to third-order derivatives of multivariable maps. This work extends the perturbations from sinusoidal to bounded periodic or almost periodic functions and considers multivariable maps. A necessary and sufficient condition is given for determining if time-varying functions exist for estimating arbitrary order derivatives of multivariable maps for any given bounded periodic or almost periodic dither signal. These results are then used in a source seeking controller for a nonholonomic vehicle with a sensor actuated by servo. The conducted simulation and real-world experiments demonstrate that by distributing the local map exploration to a servo, the nonholonomic vehicle was able to achieve a faster convergence to the source.', 'abstract_zh': '基于边界搜索控制的有界周期或几乎周期信号驱动的多变量映射高阶导数估计算法及其应用', 'title_zh': 'onboard 非完整车辆用于极小搜索的局部地图探索伺服'}
{'arxiv_id': 'arXiv:2509.16267', 'title': 'Underground Multi-robot Systems at Work: a revolution in mining', 'authors': 'Victor V. Puche, Kashish Verma, Matteo Fumagalli', 'link': 'https://arxiv.org/abs/2509.16267', 'abstract': 'The growing global demand for critical raw materials (CRMs) has highlighted the need to access difficult and hazardous environments such as abandoned underground mines. These sites pose significant challenges for conventional machinery and human operators due to confined spaces, structural instability, and lack of infrastructure. To address this, we propose a modular multi-robot system designed for autonomous operation in such environments, enabling sequential mineral extraction tasks. Unlike existing work that focuses primarily on mapping and inspection through global behavior or central control, our approach incorporates physical interaction capabilities using specialized robots coordinated through local high-level behavior control. Our proposed system utilizes Hierarchical Finite State Machine (HFSM) behaviors to structure complex task execution across heterogeneous robotic platforms. Each robot has its own HFSM behavior to perform sequential autonomy while maintaining overall system coordination, achieved by triggering behavior execution through inter-robot communication. This architecture effectively integrates software and hardware components to support collaborative, task-driven multi-robot operation in confined underground environments.', 'abstract_zh': '全球对关键原材料的不断增长需求凸显了进入废弃地下矿井等困难和危险环境的必要性。这些站点由于空间受限、结构不稳定和缺乏基础设施，对传统的机械设备和操作员构成了重大挑战。为应对这一挑战，我们提出了一种模块化的多机器人系统，该系统旨在自主操作于此类环境中，实现矿物提取任务的顺序执行。与现有工作主要集中在通过全局行为或中心控制进行测绘和检查不同，我们的方法结合了使用专门机器人并通过局部高层次行为控制进行物理交互的能力。我们提出的系统利用层次有限状态机（HFSM）行为来结构化异构机器人平台上的复杂任务执行。每个机器人都有自己独立的HFSM行为，以实现顺序自主操作，同时通过机器人间通信触发行为执行，以维持整体系统协调。这种架构有效地整合了软件和硬件组件，支持受限地下环境中合作的任务驱动型多机器人操作。', 'title_zh': '地下多机器人系统在矿业中的应用：采矿业的革命'}
