{'arxiv_id': 'arXiv:2511.15704', 'title': 'In-N-On: Scaling Egocentric Manipulation with in-the-wild and on-task Data', 'authors': 'Xiongyi Cai, Ri-Zhao Qiu, Geng Chen, Lai Wei, Isabella Liu, Tianshu Huang, Xuxin Cheng, Xiaolong Wang', 'link': 'https://arxiv.org/abs/2511.15704', 'abstract': 'Egocentric videos are a valuable and scalable data source to learn manipulation policies. However, due to significant data heterogeneity, most existing approaches utilize human data for simple pre-training, which does not unlock its full potential. This paper first provides a scalable recipe for collecting and using egocentric data by categorizing human data into two categories: in-the-wild and on-task alongside with systematic analysis on how to use the data. We first curate a dataset, PHSD, which contains over 1,000 hours of diverse in-the-wild egocentric data and over 20 hours of on-task data directly aligned to the target manipulation tasks. This enables learning a large egocentric language-conditioned flow matching policy, Human0. With domain adaptation techniques, Human0 minimizes the gap between humans and humanoids. Empirically, we show Human0 achieves several novel properties from scaling human data, including language following of instructions from only human data, few-shot learning, and improved robustness using on-task data. Project website: this https URL', 'abstract_zh': '自躯干视角视频是学习操作策略的一个有价值且可扩展的数据来源。然而，由于数据显著异质性，大多数现有方法利用人类数据进行简单的预训练，未能充分利用其潜力。本文首先提供了一种可扩展的方法来收集和使用自躯干视角数据，并将人类数据分类为两类：野外数据和任务中数据，并进行了系统分析以利用这些数据。我们首先整理了一个名为PHSD的数据库，包含超过1000小时的多样性野外自躯干视角数据和超过20小时直接与目标操作任务对齐的任务中数据。这使得能够学习一个大型自躯干视角语言条件流匹配策略Human0。通过领域适应技术，Human0最小化了人类与类人者之间的差距。实验结果显示，Human0从扩展人类数据中获得了几种新颖特性，包括仅从人类数据遵循指令的能力、少样本学习以及使用任务中数据增强的鲁棒性。项目网站：这个https URL。', 'title_zh': 'In-N-On: 使用野外和任务中数据扩展自中心操作化'}
{'arxiv_id': 'arXiv:2511.15677', 'title': 'Real-time Point Cloud Data Transmission via L4S for 5G-Edge-Assisted Robotics', 'authors': 'Gerasimos Damigos, Achilleas Santi Seisa, Nikolaos Stathoulopoulos, Sara Sandberg, George Nikolakopoulos', 'link': 'https://arxiv.org/abs/2511.15677', 'abstract': "This article presents a novel framework for real-time Light Detection and Ranging (LiDAR) data transmission that leverages rate-adaptive technologies and point cloud encoding methods to ensure low-latency, and low-loss data streaming. The proposed framework is intended for, but not limited to, robotic applications that require real-time data transmission over the internet for offloaded processing. Specifically, the Low Latency, Low Loss, Scalable Throughput L4S-enabled SCReAM v2 transmission framework is extended to incorporate the Draco geometry compression algorithm, enabling dynamic compression of high-bitrate 3D LiDAR data according to the sensed channel capacity and network load. The low-latency 3D LiDAR streaming system is designed to maintain minimal end-to-end delay while constraining encoding errors to meet the accuracy requirements of robotic applications. We demonstrate the effectiveness of the proposed method through real-world experiments conducted over a public 5G network across multi-kilometer urban environments. The low-latency and low-loss requirements are preserved, while real-time offloading and evaluation of 3D SLAM algorithms are used to validate the framework's performance in practical use cases.", 'abstract_zh': '本文提出了一种利用率自适应技术和点云编码方法来确保低延迟和低丢包的实时激光雷达(LiDAR)数据传输新型框架，该框架旨在，但不仅限于需要通过互联网进行卸载处理的实时数据传输的机器人应用。具体而言，L4S启用的SCReAM v2传输框架被扩展以集成Draco几何压缩算法，根据感知到的信道容量和网络负载动态压缩高比特率的三维LiDAR数据。低延迟的三维LiDAR流传输系统旨在维持端到端延迟最小化的同时，约束编码误差以满足机器人应用的精度要求。通过在公共5G网络上进行的多公里城市环境中真实世界实验，展示了所提出方法的有效性，同时保留了低延迟和低丢包的要求，并通过实时卸载和评估三维SLAM算法来验证框架在实际应用场景中的性能。', 'title_zh': '基于L4S的5G-边缘辅助 robotics实时点云数据传输'}
{'arxiv_id': 'arXiv:2511.15614', 'title': 'Optimus-Q: Utilizing Federated Learning in Adaptive Robots for Intelligent Nuclear Power Plant Operations through Quantum Cryptography', 'authors': 'Sai Puppala, Ismail Hossain, Jahangir Alam, Sajedul Talukder', 'link': 'https://arxiv.org/abs/2511.15614', 'abstract': 'The integration of advanced robotics in nuclear power plants (NPPs) presents a transformative opportunity to enhance safety, efficiency, and environmental monitoring in high-stakes environments. Our paper introduces the Optimus-Q robot, a sophisticated system designed to autonomously monitor air quality and detect contamination while leveraging adaptive learning techniques and secure quantum communication. Equipped with advanced infrared sensors, the Optimus-Q robot continuously streams real-time environmental data to predict hazardous gas emissions, including carbon dioxide (CO$_2$), carbon monoxide (CO), and methane (CH$_4$). Utilizing a federated learning approach, the robot collaborates with other systems across various NPPs to improve its predictive capabilities without compromising data privacy. Additionally, the implementation of Quantum Key Distribution (QKD) ensures secure data transmission, safeguarding sensitive operational information. Our methodology combines systematic navigation patterns with machine learning algorithms to facilitate efficient coverage of designated areas, thereby optimizing contamination monitoring processes. Through simulations and real-world experiments, we demonstrate the effectiveness of the Optimus-Q robot in enhancing operational safety and responsiveness in nuclear facilities. This research underscores the potential of integrating robotics, machine learning, and quantum technologies to revolutionize monitoring systems in hazardous environments.', 'abstract_zh': '高级机器人在核电力植物中的集成为在高风险环境中增强安全、效率和环境监测提供了变革性机会。本文介绍了Optimus-Q机器人，这是一种先进的系统，能够自主监测空气质量并检测污染，同时利用自适应学习技术和安全的量子通信。装备有先进的红外传感器，Optimus-Q机器人不断传输实时环境数据，以预测有害气体排放，包括二氧化碳（CO₂）、一氧化碳（CO）和甲烷（CH₄）。通过联邦学习方法，该机器人与其他多个核电厂的系统协作以提高预测能力，而不牺牲数据隐私。此外，量子密钥分发（QKD）的应用确保了数据的安全传输，保护了敏感的操作信息。我们的方法结合了系统导航模式和机器学习算法，以优化指定区域的覆盖效率，从而优化污染监测过程。通过模拟和实际实验，我们证明Optimus-Q机器人在提高核设施的操作安全性和响应性方面是有效的。本研究强调了将机器人技术、机器学习和量子技术集成到危险环境中的监测系统中的潜在可能。', 'title_zh': 'Optimus-Q：通过量子加密在适应性机器人中利用联邦学习以实现智能核电站运营'}
{'arxiv_id': 'arXiv:2511.15605', 'title': 'SRPO: Self-Referential Policy Optimization for Vision-Language-Action Models', 'authors': 'Senyu Fei, Siyin Wang, Li Ji, Ao Li, Shiduo Zhang, Liming Liu, Jinlong Hou, Jingjing Gong, Xianzhong Zhao, Xipeng Qiu', 'link': 'https://arxiv.org/abs/2511.15605', 'abstract': "Vision-Language-Action (VLA) models excel in robotic manipulation but are constrained by their heavy reliance on expert demonstrations, leading to demonstration bias and limiting performance. Reinforcement learning (RL) is a vital post-training strategy to overcome these limits, yet current VLA-RL methods, including group-based optimization approaches, are crippled by severe reward sparsity. Relying on binary success indicators wastes valuable information in failed trajectories, resulting in low training efficiency. To solve this, we propose Self-Referential Policy Optimization (SRPO), a novel VLA-RL framework. SRPO eliminates the need for external demonstrations or manual reward engineering by leveraging the model's own successful trajectories, generated within the current training batch, as a self-reference. This allows us to assign a progress-wise reward to failed attempts. A core innovation is the use of latent world representations to measure behavioral progress robustly. Instead of relying on raw pixels or requiring domain-specific fine-tuning, we utilize the compressed, transferable encodings from a world model's latent space. These representations naturally capture progress patterns across environments, enabling accurate, generalized trajectory comparison. Empirical evaluations on the LIBERO benchmark demonstrate SRPO's efficiency and effectiveness. Starting from a supervised baseline with 48.9% success, SRPO achieves a new state-of-the-art success rate of 99.2% in just 200 RL steps, representing a 103% relative improvement without any extra supervision. Furthermore, SRPO shows substantial robustness, achieving a 167% performance improvement on the LIBERO-Plus benchmark.", 'abstract_zh': '基于视觉-语言-动作的强化学习：Self-Referential Policy Optimization框架在减轻专家演示依赖中的应用', 'title_zh': 'SRPO：自参照策略优化在视觉-语言-行动模型中的应用'}
{'arxiv_id': 'arXiv:2511.15550', 'title': 'UltraDP: Generalizable Carotid Ultrasound Scanning with Force-Aware Diffusion Policy', 'authors': 'Ruoqu Chen, Xiangjie Yan, Kangchen Lv, Gao Huang, Zheng Li, Xiang Li', 'link': 'https://arxiv.org/abs/2511.15550', 'abstract': "Ultrasound scanning is a critical imaging technique for real-time, non-invasive diagnostics. However, variations in patient anatomy and complex human-in-the-loop interactions pose significant challenges for autonomous robotic scanning. Existing ultrasound scanning robots are commonly limited to relatively low generalization and inefficient data utilization. To overcome these limitations, we present UltraDP, a Diffusion-Policy-based method that receives multi-sensory inputs (ultrasound images, wrist camera images, contact wrench, and probe pose) and generates actions that are fit for multi-modal action distributions in autonomous ultrasound scanning of carotid artery. We propose a specialized guidance module to enable the policy to output actions that center the artery in ultrasound images. To ensure stable contact and safe interaction between the robot and the human subject, a hybrid force-impedance controller is utilized to drive the robot to track such trajectories. Also, we have built a large-scale training dataset for carotid scanning comprising 210 scans with 460k sample pairs from 21 volunteers of both genders. By exploring our guidance module and DP's strong generalization ability, UltraDP achieves a 95% success rate in transverse scanning on previously unseen subjects, demonstrating its effectiveness.", 'abstract_zh': '基于扩散策略的超声波扫描方法UltraDP：多模态行动分布下的颈动脉自动扫描', 'title_zh': 'UltraDP：带有力感知扩散策略的通用颈动脉超声扫描方法'}
{'arxiv_id': 'arXiv:2511.15532', 'title': 'NMPC-based Motion Planning with Adaptive Weighting for Dynamic Object Interception', 'authors': 'Chen Cai, Saksham Kohli, Steven Liu', 'link': 'https://arxiv.org/abs/2511.15532', 'abstract': 'Catching fast-moving objects serves as a benchmark for robotic agility, posing significant coordination challenges for cooperative manipulator systems holding a catcher, particularly due to inherent closed-chain constraints. This paper presents a nonlinear model predictive control (MPC)-based motion planner that bridges high-level interception planning with real-time joint space control, enabling dynamic object interception for systems comprising two cooperating arms. We introduce an Adaptive- Terminal (AT) MPC formulation featuring cost shaping, which contrasts with a simpler Primitive-Terminal (PT) approach relying heavily on terminal penalties for rapid convergence. The proposed AT formulation is shown to effectively mitigate issues related to actuator power limit violations frequently encountered with the PT strategy, yielding trajectories and significantly reduced control effort. Experimental results on a robotic platform with two cooperative arms, demonstrating excellent real time performance, with an average planner cycle computation time of approximately 19 ms-less than half the 40 ms system sampling time. These results indicate that the AT formulation achieves significantly improved motion quality and robustness with minimal computational overhead compared to the PT baseline, making it well-suited for dynamic, cooperative interception tasks.', 'abstract_zh': '基于非线性模型预测控制的自适应终端运动规划算法：双臂合作系统高速目标捕捉中的动态对象拦截', 'title_zh': '基于NMPC的自适应加权动态目标拦截运动规划'}
{'arxiv_id': 'arXiv:2511.15529', 'title': 'Decentralized Gaussian Process Classification and an Application in Subsea Robotics', 'authors': 'Yifei Gao, Hans J. He, Daniel J. Stilwell, James McMahon', 'link': 'https://arxiv.org/abs/2511.15529', 'abstract': 'Teams of cooperating autonomous underwater vehicles (AUVs) rely on acoustic communication for coordination, yet this communication medium is constrained by limited range, multi-path effects, and low bandwidth. One way to address the uncertainty associated with acoustic communication is to learn the communication environment in real-time. We address the challenge of a team of robots building a map of the probability of communication success from one location to another in real-time. This is a decentralized classification problem -- communication events are either successful or unsuccessful -- where AUVs share a subset of their communication measurements to build the map. The main contribution of this work is a rigorously derived data sharing policy that selects measurements to be shared among AUVs. We experimentally validate our proposed sharing policy using real acoustic communication data collected from teams of Virginia Tech 690 AUVs, demonstrating its effectiveness in underwater environments.', 'abstract_zh': '自主水下车辆（AUVs）团队依靠声学通信进行协调，但该通信介质受到通信范围有限、多路径效应和低带宽的限制。为了应对声学通信相关的不确定性，可以实时学习通信环境。我们解决了机器人团队实时构建从一个位置到另一个位置通信成功率概率图的挑战。这是一个分散式分类问题——通信事件要么成功要么失败——其中AUVs共享一部分通信测量值以构建该图。本工作的主要贡献是一种严格 deriv 的数据共享策略，该策略选择了要在AUVs之间共享的测量值。我们使用来自弗吉尼亚技术学院690 AUV团队的实际声学通信数据验证了我们提出的数据共享策略，在水下环境中展示了其有效性。', 'title_zh': '去中心化高斯过程分类及在海底机器人中的应用'}
{'arxiv_id': 'arXiv:2511.15520', 'title': 'Theoretical Closed-loop Stability Bounds for Dynamical System Coupled with Diffusion Policies', 'authors': 'Gabriel Lauzier, Alexandre Girard, François Ferland', 'link': 'https://arxiv.org/abs/2511.15520', 'abstract': 'Diffusion Policy has shown great performance in robotic manipulation tasks under stochastic perturbations, due to its ability to model multimodal action distributions. Nonetheless, its reliance on a computationally expensive reverse-time diffusion (denoising) process, for action inference, makes it challenging to use for real-time applications where quick decision-making is mandatory. This work studies the possibility of conducting the denoising process only partially before executing an action, allowing the plant to evolve according to its dynamics in parallel to the reverse-time diffusion dynamics ongoing on the computer. In a classical diffusion policy setting, the plant dynamics are usually slow and the two dynamical processes are uncoupled. Here, we investigate theoretical bounds on the stability of closed-loop systems using diffusion policies when the plant dynamics and the denoising dynamics are coupled. The contribution of this work gives a framework for faster imitation learning and a metric that yields if a controller will be stable based on the variance of the demonstrations.', 'abstract_zh': '基于扩散政策在随机扰动下执行任务中表现出的强大性能及其对多模态动作分布建模的能力，虽然其依赖于计算昂贵的逆向时间去噪过程进行动作推断，这使得它在需要快速决策的实时应用中难以使用。本文研究了在执行动作之前仅部分进行去噪过程的可能性，允许植物根据其动力学在计算机上的逆向时间去噪动力学进行的同时演化。在经典的扩散政策设置中，植物动力学通常较慢且两个动力学过程是解耦的。本文探讨了当植物动力学和去噪动力学耦合时使用扩散政策的闭环系统的稳定性理论界限。本文的贡献提供了一个更快速的模仿学习框架，并提供了一个指标来判断控制器的稳定性基于演示的方差。', 'title_zh': '带有扩散策略耦合的动力系统闭环稳定性理论边界'}
{'arxiv_id': 'arXiv:2511.15513', 'title': 'Discovering Optimal Natural Gaits of Dissipative Systems via Virtual Energy Injection', 'authors': 'Korbinian Griesbauer, Davide Calzolari, Maximilian Raff, C. David Remy, Alin Albu-Schäffer', 'link': 'https://arxiv.org/abs/2511.15513', 'abstract': "Legged robots offer several advantages when navigating unstructured environments, but they often fall short of the efficiency achieved by wheeled robots. One promising strategy to improve their energy economy is to leverage their natural (unactuated) dynamics using elastic elements. This work explores that concept by designing energy-optimal control inputs through a unified, multi-stage framework. It starts with a novel energy injection technique to identify passive motion patterns by harnessing the system's natural dynamics. This enables the discovery of passive solutions even in systems with energy dissipation caused by factors such as friction or plastic collisions. Building on these passive solutions, we then employ a continuation approach to derive energy-optimal control inputs for the fully actuated, dissipative robotic system. The method is tested on simulated models to demonstrate its applicability in both single- and multi-legged robotic systems. This analysis provides valuable insights into the design and operation of elastic legged robots, offering pathways to improve their efficiency and adaptability by exploiting the natural system dynamics.", 'abstract_zh': '基于弹性元件利用自然动力学提高腿式机器人能量经济性的多阶段统一控制方法', 'title_zh': '通过虚拟能量注入发现耗散系统的最优自然步态'}
{'arxiv_id': 'arXiv:2511.15414', 'title': 'RRT*former: Environment-Aware Sampling-Based Motion Planning using Transformer', 'authors': 'Mingyang Feng, Shaoyuan Li, Xiang Yin', 'link': 'https://arxiv.org/abs/2511.15414', 'abstract': 'We investigate the sampling-based optimal path planning problem for robotics in complex and dynamic environments. Most existing sampling-based algorithms neglect environmental information or the information from previous samples. Yet, these pieces of information are highly informative, as leveraging them can provide better heuristics when sampling the next state. In this paper, we propose a novel sampling-based planning algorithm, called \\emph{RRT*former}, which integrates the standard RRT* algorithm with a Transformer network in a novel way. Specifically, the Transformer is used to extract features from the environment and leverage information from previous samples to better guide the sampling process. Our extensive experiments demonstrate that, compared to existing sampling-based approaches such as RRT*, Neural RRT*, and their variants, our algorithm achieves considerable improvements in both the optimality of the path and sampling efficiency. The code for our implementation is available on this https URL.', 'abstract_zh': '基于抽样最优路径规划问题在复杂动态环境中的研究：RRT*former算法的设计与实现', 'title_zh': 'RRT*former: 基于变压器的环境感知采样运动规划'}
{'arxiv_id': 'arXiv:2511.15358', 'title': 'Platform-Agnostic Reinforcement Learning Framework for Safe Exploration of Cluttered Environments with Graph Attention', 'authors': 'Gabriele Calzolari, Vidya Sumathy, Christoforos Kanellakis, George Nikolakopoulos', 'link': 'https://arxiv.org/abs/2511.15358', 'abstract': "Autonomous exploration of obstacle-rich spaces requires strategies that ensure efficiency while guaranteeing safety against collisions with obstacles. This paper investigates a novel platform-agnostic reinforcement learning framework that integrates a graph neural network-based policy for next-waypoint selection, with a safety filter ensuring safe mobility. Specifically, the neural network is trained using reinforcement learning through the Proximal Policy Optimization (PPO) algorithm to maximize exploration efficiency while minimizing safety filter interventions. Henceforth, when the policy proposes an infeasible action, the safety filter overrides it with the closest feasible alternative, ensuring consistent system behavior. In addition, this paper introduces a reward function shaped by a potential field that accounts for both the agent's proximity to unexplored regions and the expected information gain from reaching them. The proposed framework combines the adaptability of reinforcement learning-based exploration policies with the reliability provided by explicit safety mechanisms. This feature plays a key role in enabling the deployment of learning-based policies on robotic platforms operating in real-world environments. Extensive evaluations in both simulations and experiments performed in a lab environment demonstrate that the approach achieves efficient and safe exploration in cluttered spaces.", 'abstract_zh': '自主探索障碍丰富的空间需要确保效率的同时保证与障碍物碰撞的安全策略。本文研究了一种平台无关的强化学习框架，该框架结合了基于图神经网络的下一航点选择策略，并通过安全性过滤器确保移动安全。具体而言，神经网络利用 proximal 策略优化（PPO）算法通过强化学习进行训练，以最大化探索效率并最小化安全性过滤器的干预。当策略提出不可行的动作时，安全性过滤器将使用最近的可行替代方案进行覆盖，以保证系统的持续行为一致性。此外，本文引入了一个基于势场的奖励函数，该函数同时考虑了代理接近未探索区域的接近程度及其到达这些区域预期的信息增益。所提出的框架结合了基于强化学习的探索策略的适应性与通过显式安全机制提供的可靠性，这一特征在实现实现环境中的机器人平台部署学习策略时发挥了关键作用。广泛的仿真和实验室环境中的实验评估表明，该方法能够在复杂环境中实现高效且安全的探索。', 'title_zh': '平台无关的图注意力强化学习框架：用于杂乱环境安全探索'}
{'arxiv_id': 'arXiv:2511.15333', 'title': 'C2F-Space: Coarse-to-Fine Space Grounding for Spatial Instructions using Vision-Language Models', 'authors': 'Nayoung Oh, Dohyun Kim, Junhyeong Bang, Rohan Paul, Daehyung Park', 'link': 'https://arxiv.org/abs/2511.15333', 'abstract': "Space grounding refers to localizing a set of spatial references described in natural language instructions. Traditional methods often fail to account for complex reasoning -- such as distance, geometry, and inter-object relationships -- while vision-language models (VLMs), despite strong reasoning abilities, struggle to produce a fine-grained region of outputs. To overcome these limitations, we propose C2F-Space, a novel coarse-to-fine space-grounding framework that (i) estimates an approximated yet spatially consistent region using a VLM, then (ii) refines the region to align with the local environment through superpixelization. For the coarse estimation, we design a grid-based visual-grounding prompt with a propose-validate strategy, maximizing VLM's spatial understanding and yielding physically and semantically valid canonical region (i.e., ellipses). For the refinement, we locally adapt the region to surrounding environment without over-relaxed to free space. We construct a new space-grounding benchmark and compare C2F-Space with five state-of-the-art baselines using success rate and intersection-over-union. Our C2F-Space significantly outperforms all baselines. Our ablation study confirms the effectiveness of each module in the two-step process and their synergistic effect of the combined framework. We finally demonstrate the applicability of C2F-Space to simulated robotic pick-and-place tasks.", 'abstract_zh': '空间定位指的是将自然语言指令中描述的一组空间参考进行 localization。传统方法往往无法处理复杂的推理——如距离、几何关系和物体间的关系——尽管视觉语言模型(Vision-Language Models, VLMs)具有强大的推理能力，但在产生细粒度输出区域方面仍然存在问题。为克服这些限制，我们提出了一种新颖的从粗到细的空间定位框架 C2F-Space，该框架包括：(i) 使用 VLM 估计一个近似的但具空间一致性区域；(ii) 通过超像素化将该区域细化以与局部环境对齐。为了粗略估计，我们设计了一个基于网格的视觉定位提示，并采用提出-验证策略，最大化 VLM 的空间理解能力，从而产生物理和语义有效的标准区域（例如椭圆）。在细化过程中，我们局部适应该区域以适应周围环境，而不会过度放宽以适应自由空间。我们构建了一个新的空间定位基准，并使用成功率和交并比与五种最先进的基准进行比较。我们的 C2F-Space 在所有基准中表现显著优异。我们的消融实验证实了两步过程中的每个模块的有效性及其组合框架的协同效果。最后，我们展示了 C2F-Space 在模拟机器人拾放任务中的适用性。', 'title_zh': 'C2F-Space: 从粗到细的空间语义 grounding 用于基于视觉-语言模型的空间指令理解'}
{'arxiv_id': 'arXiv:2511.15294', 'title': 'MSA - Technique for Stiffness Modeling of Manipulators with Complex and Hybrid Structures', 'authors': 'Alexandr Klimchik, Anatol Pashkevich, Damien Chablat', 'link': 'https://arxiv.org/abs/2511.15294', 'abstract': 'The paper presents a systematic approach for stiffness modeling of manipulators with complex and hybrid structures using matrix structural analysis. In contrast to previous results, it is suitable for mixed architectures containing closed-loops, flexible links, rigid connections, passive and elastic joints with external loadings and preloadings. The proposed approach produces the Cartesian stiffness matrices in a semi-analytical manner. It presents the manipulator stiffness model as a set of conventional equations describing the link elasticities that are supplemented by a set of constraints describing connections between links. Its allows user straightforward aggregation of stiffness model equations avoiding traditional column/row merging procedures in the extended stiffness matrix. Advantages of this approach are illustrated by stiffness analysis of NaVaRo manipulator.', 'abstract_zh': '基于矩阵结构分析的复杂混合构型 manipulator 刚度建模系统方法', 'title_zh': '基于MSA的复杂混合结构 manipulator 刚度建模技术'}
{'arxiv_id': 'arXiv:2511.15290', 'title': 'Optimizing Robot Positioning Against Placement Inaccuracies: A Study on the Fanuc CRX10iA/L', 'authors': 'Nicolas Gautier, Yves Guillermit, Mathieu Porez, David Lemoine, Damien Chablat', 'link': 'https://arxiv.org/abs/2511.15290', 'abstract': 'This study presents a methodology for determining the optimal base placement of a Fanuc CRX10iA/L collaborative robot for a desired trajectory corresponding to an industrial task. The proposed method uses a particle swarm optimization algorithm that explores the search space to find positions for performing the trajectory. An $\\alpha$-shape algorithm is then used to draw the borders of the feasibility areas, and the largest circle inscribed is calculated from the Voronoi diagrams. The aim of this approach is to provide a robustness criterion in the context of robot placement inaccuracies that may be encountered, for example, if the robot is placed on a mobile base when the system is deployed by an operator. The approach developed uses an inverse kinematics model to evaluate all initial configurations, then moves the robot end-effector along the reference trajectory using the Jacobian matrix and assigns a score to the attempt. For the Fanuc CRX10iA/L robot, there can be up to 16 solutions to the inverse kinematics model. The calculation of these solutions is not trivial and requires a specific study that planning tools such as MoveIt cannot fully take into account. Additionally, the optimization process must consider constraints such as joint limits, singularities, and workspace limitations to ensure feasible and efficient trajectory execution.', 'abstract_zh': '这种研究提出了一种方法，用于确定fanuc CRX10iA/L协作机器人在预定工业任务相应轨迹的理想基座位置。该提出的办法使用了粒子群优化算法来探索搜索空间，以寻找执行轨迹的位置。随后使用$\\alpha$-形状算法绘制可行性区域的边界，并通过Voronoi图计算内接圆的大小。这种方法旨在提供一种在可能存在机器人位置误差的情况下（例如，当系统由操作员部署时，机器人放置在移动基座上）的鲁棒性标准。所开发的方法使用了逆运动学模型来评估所有初始配置，然后使用雅可比矩阵移动机器人的末端执行器沿参考轨迹，并对其尝试进行评分。对于Fanuc CRX10iA/L机器人，逆运动学模型最多可以有16种解。这些解的计算并非易事，需要进行特定研究，而像MoveIt这样的规划工具不能完全考虑到这一点。此外，优化过程必须考虑关节限制、奇异性及工作空间限制，以确保轨迹执行的可行性与高效性。', 'title_zh': '优化机器人定位精度以克服放置误差：Fanuc CRX10iA/L的研究'}
{'arxiv_id': 'arXiv:2511.15284', 'title': 'Path Planning through Multi-Agent Reinforcement Learning in Dynamic Environments', 'authors': 'Jonas De Maeyer, Hossein Yarahmadi, Moharram Challenger', 'link': 'https://arxiv.org/abs/2511.15284', 'abstract': 'Path planning in dynamic environments is a fundamental challenge in intelligent transportation and robotics, where obstacles and conditions change over time, introducing uncertainty and requiring continuous adaptation. While existing approaches often assume complete environmental unpredictability or rely on global planners, these assumptions limit scalability and practical deployment in real-world settings. In this paper, we propose a scalable, region-aware reinforcement learning (RL) framework for path planning in dynamic environments. Our method builds on the observation that environmental changes, although dynamic, are often localized within bounded regions. To exploit this, we introduce a hierarchical decomposition of the environment and deploy distributed RL agents that adapt to changes locally. We further propose a retraining mechanism based on sub-environment success rates to determine when policy updates are necessary. Two training paradigms are explored: single-agent Q-learning and multi-agent federated Q-learning, where local Q-tables are aggregated periodically to accelerate the learning process. Unlike prior work, we evaluate our methods in more realistic settings, where multiple simultaneous obstacle changes and increasing difficulty levels are present. Results show that the federated variants consistently outperform their single-agent counterparts and closely approach the performance of A* Oracle while maintaining shorter adaptation times and robust scalability. Although initial training remains time-consuming in large environments, our decentralized framework eliminates the need for a global planner and lays the groundwork for future improvements using deep RL and flexible environment decomposition.', 'abstract_zh': '动态环境中基于区域aware强化学习的路径规划方法', 'title_zh': '动态环境中的多智能体强化学习路径规划'}
{'arxiv_id': 'arXiv:2511.15279', 'title': 'Look, Zoom, Understand: The Robotic Eyeball for Embodied Perception', 'authors': 'Jiashu Yang, Yifan Han, Yucheng Xie, Ning Guo, Wenzhao Lian', 'link': 'https://arxiv.org/abs/2511.15279', 'abstract': 'In embodied AI perception systems, visual perception should be active: the goal is not to passively process static images, but to actively acquire more informative data within pixel and spatial budget constraints. Existing vision models and fixed RGB-D camera systems fundamentally fail to reconcile wide-area coverage with fine-grained detail acquisition, severely limiting their efficacy in open-world robotic applications. To address this issue, we propose EyeVLA, a robotic eyeball for active visual perception that can take proactive actions based on instructions, enabling clear observation of fine-grained target objects and detailed information across a wide spatial extent. EyeVLA discretizes action behaviors into action tokens and integrates them with vision-language models (VLMs) that possess strong open-world understanding capabilities, enabling joint modeling of vision, language, and actions within a single autoregressive sequence. By using the 2D bounding box coordinates to guide the reasoning chain and applying reinforcement learning to refine the viewpoint selection policy, we transfer the open-world scene understanding capability of the VLM to a vision language action (VLA) policy using only minimal real-world data. Experiments show that our system efficiently performs instructed scenes in real-world environments and actively acquires more accurate visual information through instruction-driven actions of rotation and zoom, thereby achieving strong environmental perception capabilities. EyeVLA introduces a novel robotic vision system that leverages detailed and spatially rich, large-scale embodied data, and actively acquires highly informative visual observations for downstream embodied tasks.', 'abstract_zh': '具有躯体化的AI感知系统中的视觉感知应该是主动的：目标是在像素和空间预算的约束下主动获取更具信息量的数据，而非被动处理静态图像。现有的视觉模型和固定的RGB-D相机系统无法兼顾广泛的场景覆盖与精细的细节获取，严重限制了其在开放环境下机器人应用中的效果。为解决这一问题，我们提出EyeVLA，一种能够基于指令采取主动行为的机器人眼球，用于实现对精细目标物体的清晰观察和广泛空间范围内的详细信息获取。EyeVLA将行动行为离散化为行动令牌，并将其与具备强大的开放世界理解能力的视觉语言模型（VLMs）集成，能够在单个自回归序列中联合建模视觉、语言和行动。通过使用2D边界框坐标引导推理链，并应用强化学习来优化视角选择策略，我们仅使用少量的现实世界数据，将VLM的开放世界场景理解能力转移到视觉语言行动（VLA）策略中。实验表明，我们的系统能够高效地在真实环境中执行指令场景，并通过指令驱动的旋转和缩放动作主动获取更准确的视觉信息，从而实现强大的环境感知能力。EyeVLA引入了一种新型的机器人视觉系统，利用详尽且空间丰富的大规模实体数据，并主动获取高度信息丰富的视觉观察，以支持下游的实体任务。', 'title_zh': '看、聚焦、理解：类人眼球for体态感知'}
{'arxiv_id': 'arXiv:2511.15274', 'title': 'Behavior Trees vs Executable Ontologies: a Comparative Analysis of Robot Control Paradigms', 'authors': 'Alexander Boldachev', 'link': 'https://arxiv.org/abs/2511.15274', 'abstract': 'This paper compares two distinct approaches to modeling robotic behavior: imperative Behavior Trees (BTs) and declarative Executable Ontologies (EO), implemented through the boldsea framework. BTs structure behavior hierarchically using control-flow, whereas EO represents the domain as a temporal, event-based semantic graph driven by dataflow rules. We demonstrate that EO achieves comparable reactivity and modularity to BTs through a fundamentally different architecture: replacing polling-based tick execution with event-driven state propagation. We propose that EO offers an alternative framework, moving from procedural programming to semantic domain modeling, to address the semantic-process gap in traditional robotic control. EO supports runtime model modification, full temporal traceability, and a unified representation of data, logic, and interface - features that are difficult or sometimes impossible to achieve with BTs, although BTs excel in established, predictable scenarios. The comparison is grounded in a practical mobile manipulation task. This comparison highlights the respective operational strengths of each approach in dynamic, evolving robotic systems.', 'abstract_zh': '本文比较了两种不同的机器人行为建模方法：命令式行为树(BT)和声明式可执行本体(EO)，并借助boldsea框架实现。行为树通过控制流以层次结构形式组织行为，而可执行本体则通过数据流规则以基于事件的时间语义图形式表示领域。我们通过从根本上不同的架构证明，可执行本体在实现与行为树相当的反应性和模块化方面是可行的：使用事件驱动的状态传播替代基于轮询的.tick.执行。我们提出，可执行本体提供了另一种框架，从过程化编程转向基于语义领域的建模，以解决传统机器人控制中的语义-过程差距。可执行本体支持运行时模型修改、完整的时态可追溯性和数据、逻辑和界面的一致表示——这些特性在行为树中难以实现或有时是不可能实现的，尽管行为树在已建立的可预测场景中表现出色。这种比较在实际的移动 manipulation 任务中得到了体现。该比较突显了每种方法在动态、演变型机器人系统中的操作优势。', 'title_zh': '行为树与可执行本体：机器人控制范式的比较分析'}
{'arxiv_id': 'arXiv:2511.15239', 'title': 'Symmetry-Breaking in Multi-Agent Navigation: Winding Number-Aware MPC with a Learned Topological Strategy', 'authors': 'Tomoki Nakao, Kazumi Kasaura, Tadashi Kozuno', 'link': 'https://arxiv.org/abs/2511.15239', 'abstract': 'We address the fundamental challenge of resolving symmetry-induced deadlocks in distributed multi-agent navigation by proposing a new hierarchical navigation method. When multiple agents interact, it is inherently difficult for them to autonomously break the symmetry of deciding how to pass each other. To tackle this problem, we introduce an approach that quantifies cooperative symmetry-breaking strategies using a topological invariant called the winding number, and learns the strategies themselves through reinforcement learning. Our method features a hierarchical policy consisting of a learning-based Planner, which plans topological cooperative strategies, and a model-based Controller, which executes them. Through reinforcement learning, the Planner learns to produce two types of parameters for the Controller: one is the topological cooperative strategy represented by winding numbers, and the other is a set of dynamic weights that determine which agent interaction to prioritize in dense scenarios where multiple agents cross simultaneously. The Controller then generates collision-free and efficient motions based on the strategy and weights provided by the Planner. This hierarchical structure combines the flexible decision-making ability of learning-based methods with the reliability of model-based approaches. Simulation and real-world robot experiments demonstrate that our method outperforms existing baselines, particularly in dense environments, by efficiently avoiding collisions and deadlocks while achieving superior navigation performance. The code for the experiments is available at this https URL.', 'abstract_zh': '我们提出一种新的分层导航方法，以解决分布式多智能体导航中由对称性引起的死锁基本挑战。通过引入一种使用拓扑不变量缠绕数来量化合作对称性打破策略的方法，并通过强化学习学习这些策略本身来应对这一问题。该方法包含一个分层策略，由基于学习的规划器和基于模型的控制器组成。规划器通过强化学习学习生成两种类型的参数来控制器：一种是用缠绕数表示的拓扑合作策略，另一种是一组动态权重，用于确定在多个智能体同时交叉的密集场景中优先处理哪种交互。控制器然后根据规划器提供的策略和权重生成无碰撞且高效的运动。该分层结构将基于学习的方法的灵活决策能力与基于模型的方法的可靠性相结合。仿真和真实世界机器人实验表明，与现有基线方法相比，我们的方法在密集环境中表现出色，能够高效地避免碰撞和死锁，同时实现更好的导航性能。实验代码可在以下链接获得：this https URL。', 'title_zh': '多智能体导航中的对称性破缺：基于学习拓扑策略的顾及布旋数的模型预测控制'}
{'arxiv_id': 'arXiv:2511.15227', 'title': 'Modelling and Model-Checking a ROS2 Multi-Robot System using Timed Rebeca', 'authors': 'Hiep Hong Trinh, Marjan Sirjani, Federico Ciccozzi, Abu Naser Masud, Mikael Sjödin', 'link': 'https://arxiv.org/abs/2511.15227', 'abstract': "Model-based development enables quicker prototyping, earlier experimentation and validation of design intents. For a multi-agent system with complex asynchronous interactions and concurrency, formal verification, model-checking in particular, offers an automated mechanism for verifying desired properties. Timed Rebeca is an actor-based modelling language supporting reactive, concurrent and time semantics, accompanied with a model-checking compiler. These capabilities allow using Timed Rebeca to correctly model ROS2 node topographies, recurring physical signals, motion primitives and other timed and time-convertible behaviors. The biggest challenges in modelling and verifying a multi-robot system lie in abstracting complex information, bridging the gap between a discrete model and a continuous system and compacting the state space, while maintaining the model's accuracy. We develop different discretization strategies for different kinds of information, identifying the 'enough' thresholds of abstraction, and applying efficient optimization techniques to boost computations. With this work we demonstrate how to use models to design and verify a multi-robot system, how to discretely model a continuous system to do model-checking efficiently, and the round-trip engineering flow between the model and the implementation. The released Rebeca and ROS2 codes can serve as a foundation for modelling multiple autonomous robots systems.", 'abstract_zh': '基于模型的开发能够加速原型制作、提前验证设计意图。对于具有复杂异步交互和并发性的多代理系统，形式验证，尤其是模型检测，提供了一种自动验证所需属性的机制。Timed Rebeca是一种基于演员的建模语言，支持反应性、并发性和时间语义，并配有一个模型检测编译器。这些能力使用户能够使用Timed Rebeca正确地建模ROS2节点拓扑、重复的物理信号、运动基本动作以及其他定时和可转换定时的行为。多机器人系统建模与验证的最大挑战在于抽象复杂信息、缩小离散模型与连续系统之间的差距、压缩状态空间同时保持模型的准确性。我们为不同类型的信息开发了不同的离散化策略，确定了抽象的“足够”阈值，并应用高效的优化技术来加速计算。通过本项工作，我们展示了如何使用模型设计和验证多机器人系统、如何离散建模连续系统以高效进行模型检测以及模型与实现之间的往返工程流程。发布的Rebeca和ROS2代码可以作为建模多个自主机器人系统的基础。', 'title_zh': '基于Timed Rebeca对ROS2多机器人系统的建模与模型检查'}
{'arxiv_id': 'arXiv:2511.15225', 'title': 'A Class of Dual-Frame Passively-Tilting Fully-Actuated Hexacopter', 'authors': 'Jiajun Liu, Yimin Zhu, Xiaorui Liu, Mingye Cao, Mingchao Li, Lixian Zhang', 'link': 'https://arxiv.org/abs/2511.15225', 'abstract': 'This paper proposed a novel fully-actuated hexacopter. It features a dual-frame passive tilting structure and achieves independent control of translational motion and attitude with minimal actuators. Compared to previous fully-actuated UAVs, it liminates internal force cancellation, resulting in higher flight efficiency and endurance under equivalent payload conditions. Based on the dynamic model of fully-actuated hexacopter, a full-actuation controller is designed to achieve efficient and stable control. Finally, simulation is conducted, validating the superior fully-actuated motion capability of fully-actuated hexacopter and the effectiveness of the proposed control strategy.', 'abstract_zh': '本文提出了一种新型全驱动六旋翼无人机。它配备双框架被动倾斜结构，通过最少的驱动器实现了独立的平移运动和姿态控制。相比之前的全驱动无人机，它消除了内部力的抵消，使得在相同载荷条件下具有更高的飞行效率和续航能力。基于全驱动六旋翼无人机的动力学模型，设计了一种全驱动控制器以实现高效稳定的控制。最后，通过仿真验证了全驱动六旋翼无人机的优越全驱动运动能力和所提出控制策略的有效性。', 'title_zh': '一类双框架被动倾斜全驱动六旋翼无人机'}
{'arxiv_id': 'arXiv:2511.15200', 'title': 'VIRAL: Visual Sim-to-Real at Scale for Humanoid Loco-Manipulation', 'authors': 'Tairan He, Zi Wang, Haoru Xue, Qingwei Ben, Zhengyi Luo, Wenli Xiao, Ye Yuan, Xingye Da, Fernando Castañeda, Shankar Sastry, Changliu Liu, Guanya Shi, Linxi Fan, Yuke Zhu', 'link': 'https://arxiv.org/abs/2511.15200', 'abstract': 'A key barrier to the real-world deployment of humanoid robots is the lack of autonomous loco-manipulation skills. We introduce VIRAL, a visual sim-to-real framework that learns humanoid loco-manipulation entirely in simulation and deploys it zero-shot to real hardware. VIRAL follows a teacher-student design: a privileged RL teacher, operating on full state, learns long-horizon loco-manipulation using a delta action space and reference state initialization. A vision-based student policy is then distilled from the teacher via large-scale simulation with tiled rendering, trained with a mixture of online DAgger and behavior cloning. We find that compute scale is critical: scaling simulation to tens of GPUs (up to 64) makes both teacher and student training reliable, while low-compute regimes often fail. To bridge the sim-to-real gap, VIRAL combines large-scale visual domain randomization over lighting, materials, camera parameters, image quality, and sensor delays--with real-to-sim alignment of the dexterous hands and cameras. Deployed on a Unitree G1 humanoid, the resulting RGB-based policy performs continuous loco-manipulation for up to 54 cycles, generalizing to diverse spatial and appearance variations without any real-world fine-tuning, and approaching expert-level teleoperation performance. Extensive ablations dissect the key design choices required to make RGB-based humanoid loco-manipulation work in practice.', 'abstract_zh': '视觉导向的模拟到现实框架VIRAL：学习类人机器人的自主 locomotion+manipulation技能并零样本部署到真实硬件', 'title_zh': 'VIRAL: 视觉模拟到现实的大规模人体仿躯干操作'}
{'arxiv_id': 'arXiv:2511.15194', 'title': 'Eq.Bot: Enhance Robotic Manipulation Learning via Group Equivariant Canonicalization', 'authors': 'Jian Deng, Yuandong Wang, Yangfu Zhu, Tao Feng, Tianyu Wo, Zhenzhou Shao', 'link': 'https://arxiv.org/abs/2511.15194', 'abstract': 'Robotic manipulation systems are increasingly deployed across diverse domains. Yet existing multi-modal learning frameworks lack inherent guarantees of geometric consistency, struggling to handle spatial transformations such as rotations and translations. While recent works attempt to introduce equivariance through bespoke architectural modifications, these methods suffer from high implementation complexity, computational cost, and poor portability. Inspired by human cognitive processes in spatial reasoning, we propose this http URL, a universal canonicalization framework grounded in SE(2) group equivariant theory for robotic manipulation learning. Our framework transforms observations into a canonical space, applies an existing policy, and maps the resulting actions back to the original space. As a model-agnostic solution, this http URL aims to endow models with spatial equivariance without requiring architectural modifications. Extensive experiments demonstrate the superiority of this http URL under both CNN-based (e.g., CLIPort) and Transformer-based (e.g., OpenVLA-OFT) architectures over existing methods on various robotic manipulation tasks, where the most significant improvement can reach 50.0%.', 'abstract_zh': '基于SE(2)群equivariant理论的通用canonical化框架：为机器人操作学习提供空间equivariance', 'title_zh': 'Eq.Bot: 通过群体等变标准化增强机器人操作学习'}
{'arxiv_id': 'arXiv:2511.15105', 'title': 'Painted Heart Beats', 'authors': 'Angshu Adhya, Cindy Yang, Emily Wu, Rishad Hasan, Abhishek Narula, Patrícia Alves-Oliveira', 'link': 'https://arxiv.org/abs/2511.15105', 'abstract': "In this work we present AURA, a framework for synergistic human-artist painting. We developed a robot arm that collaboratively paints with a human artist. The robot has an awareness of the artist's heartbeat through the EmotiBit sensor, which provides the arousal levels of the painter. Given the heartbeat detected, the robot decides to increase proximity to the artist's workspace or retract. If a higher heartbeat is detected, which is associated with increased arousal in human artists, the robot will move away from that area of the canvas. If the artist's heart rate is detected as neutral, indicating the human artist's baseline state, the robot will continue its painting actions across the entire canvas. We also demonstrate and propose alternative robot-artist interactions using natural language and physical touch. This work combines the biometrics of a human artist to inform fluent artistic interactions.", 'abstract_zh': '本工作中我们提出了AURA，一种协同人类艺术家绘画的框架。我们开发了一种机器人手臂，能够与人类艺术家协作绘画。该机器人通过EmotiBit传感器感知艺术家的心跳，从而提供作画者的唤醒水平。根据检测到的心跳，机器人决定增加与艺术家工作区的距离或退缩。如果检测到较高的心跳，这与人类艺术家的较高唤醒水平相关联，机器人将远离画布的该区域。如果检测到艺术家的心率为中性，表明人类艺术家的基础状态，机器人将在整个画布上继续其绘画动作。我们还展示了并提出了使用自然语言和物理接触的机器人-艺术家交互方式。本工作结合了人类艺术家的生理数据，以促进流畅的艺术互动。', 'title_zh': '彩绘之心跳'}
{'arxiv_id': 'arXiv:2511.15023', 'title': 'Lie Group Control Architectures for UAVs: a Comparison of SE2(3)-Based Approaches in Simulation and Hardware', 'authors': 'Dimitria Silveria, Kleber Cabral, Peter Jardine, Sidney Givigi', 'link': 'https://arxiv.org/abs/2511.15023', 'abstract': 'This paper presents the integration and experimental validation of advanced control strategies for quadcopters based on Lie groups. We build upon recent theoretical developments on SE2(3)-based controllers and introduce a novel SE2(3) model predictive controller (MPC) that combines the predictive capabilities and constraint-handling of optimal control with the geometric properties of Lie group formulations. We evaluated this MPC against a state-of-the-art SE2(3)-based LQR approach and obtained comparable performance in simulation. Both controllers where also deployed on the Quanser QDrone platform and compared to each other and an industry standard control architecture. Results show that the SE_2(3) MPC achieves superior trajectory tracking performance and robustness across a range of scenarios. This work demonstrates the practical effectiveness of Lie group-based controllers and offers comparative insights into their impact on system behaviour and real-time performance', 'abstract_zh': '基于李群的先进控制策略集成与实验验证：SE2(3)模型预测控制的研究', 'title_zh': '基于SE2(3)的方法在 simulink 和硬件平台上的无人机运动控制架构比较'}
{'arxiv_id': 'arXiv:2511.14994', 'title': 'Communication-Aware Asynchronous Distributed Trajectory Optimization for UAV Swarm', 'authors': 'Yue Yu, Xiaobo Zheng, Shaoming He', 'link': 'https://arxiv.org/abs/2511.14994', 'abstract': 'Distributed optimization offers a promising paradigm for trajectory planning in Unmanned Aerial Vehicle (UAV) swarms, yet its deployment in communication-constrained environments remains challenging due to unreliable links and limited data exchange. This paper addresses this issue via a two-tier architecture explicitly designed for operation under communication constraints. We develop a Communication-Aware Asynchronous Distributed Trajectory Optimization (CA-ADTO) framework that integrates Parameterized Differential Dynamic Programming (PDDP) for local trajectory optimization of individual UAVs with an asynchronous Alternating Direction Method of Multipliers (async-ADMM) for swarm-level coordination. The proposed architecture enables fully distributed optimization while substantially reducing communication overhead, making it suitable for real-world scenarios in which reliable connectivity cannot be guaranteed. The method is particularly effective in handling nonlinear dynamics and spatio-temporal coupling under communication constraints.', 'abstract_zh': '通信受限环境下基于通信感知异步分布式轨迹优化的无人机群轨迹规划', 'title_zh': '通信感知异步分布式无人机群轨迹优化'}
{'arxiv_id': 'arXiv:2511.14988', 'title': 'An Alignment-Based Approach to Learning Motions from Demonstrations', 'authors': 'Alex Cuellar, Christopher K Fourie, Julie A Shah', 'link': 'https://arxiv.org/abs/2511.14988', 'abstract': 'Learning from Demonstration (LfD) has shown to provide robots with fundamental motion skills for a variety of domains. Various branches of LfD research (e.g., learned dynamical systems and movement primitives) can generally be classified into \'\'time-dependent\'\' or \'\'time-independent\'\' systems. Each provides fundamental benefits and drawbacks -- time-independent methods cannot learn overlapping trajectories, while time-dependence can result in undesirable behavior under perturbation. This paper introduces Cluster Alignment for Learned Motions (CALM), an LfD framework dependent upon an alignment with a representative \'\'mean" trajectory of demonstrated motions rather than pure time- or state-dependence. We discuss the convergence properties of CALM, introduce an alignment technique able to handle the shifts in alignment possible under perturbation, and utilize demonstration clustering to generate multi-modal behavior. We show how CALM mitigates the drawbacks of time-dependent and time-independent techniques on 2D datasets and implement our system on a 7-DoF robot learning tasks in three domains.', 'abstract_zh': '基于示教的Learning from Demonstration (LfD) 已经展示了为各种领域提供机器人基本运动技能的能力。LfD 研究的不同分支（例如，学习动力学系统和运动原型）通常可以被分类为“时间依赖型”或“时间独立型”系统。每种方法都有其基本的优势和劣势——时间独立方法无法学习重叠轨迹，而时间依赖性则可能在扰动下导致不良行为。本文引入了Cluster Alignment for Learned Motions (CALM)，这是一种基于与所演示运动的代表“均值”轨迹对齐的LfD框架，而不是纯粹的时间依赖或状态依赖。我们讨论了CALM的收敛特性，介绍了一种能够处理扰动下对齐变化的对齐技术，并利用演示聚类生成多模态行为。我们展示了CALM如何在二维数据集上缓解时间依赖和时间独立技术的缺陷，并在三个不同领域上的7自由度机器人任务中实现了我们的系统。', 'title_zh': '基于对齐的学习从示范中获取运动的方法'}
{'arxiv_id': 'arXiv:2511.14977', 'title': 'SVBRD-LLM: Self-Verifying Behavioral Rule Discovery for Autonomous Vehicle Identification', 'authors': 'Xiangyu Li, Zhaomiao Guo', 'link': 'https://arxiv.org/abs/2511.14977', 'abstract': 'As more autonomous vehicles operate on public roads, understanding real-world behavior of autonomous vehicles is critical to analyzing traffic safety, making policies, and public acceptance. This paper proposes SVBRD-LLM, a framework that automatically discovers, verifies, and applies interpretable behavioral rules from real traffic videos through zero-shot prompt engineering. The framework extracts vehicle trajectories using YOLOv8 and ByteTrack, computes kinematic features, and employs GPT-5 zero-shot prompting to compare autonomous and human-driven vehicles, generating 35 structured behavioral rule hypotheses. These rules are tested on a validation set, iteratively refined based on failure cases to filter spurious correlations, and compiled into a high-confidence rule library. The framework is evaluated on an independent test set for speed change prediction, lane change prediction, and autonomous vehicle identification tasks. Experiments on over 1500 hours of real traffic videos show that the framework achieves 90.0% accuracy and 93.3% F1-score in autonomous vehicle identification. The discovered rules clearly reveal distinctive characteristics of autonomous vehicles in speed control smoothness, lane change conservativeness, and acceleration stability, with each rule accompanied by semantic description, applicable context, and validation confidence.', 'abstract_zh': '随着更多自动驾驶车辆在公共道路上运行，了解自动驾驶车辆的实际行为对于分析交通安全性、制定政策以及公众接受度至关重要。本文提出了一种SVBRD-LLM框架，该框架通过零样本提示工程自动发现、验证并应用于来自真实交通视频的行为规则。该框架使用YOLOv8和ByteTrack提取车辆轨迹，计算运动特征，并使用GPT-5零样本提示比较自动驾驶车辆和人工驾驶车辆，生成35个结构化行为规则假设。这些规则在验证集上进行测试，基于失败案例迭代精炼以过滤掉虚假相关性，并编译成高置信度规则库。该框架在独立测试集上针对车道变更预测、速度变更预测以及自动驾驶车辆识别任务进行了评估。在超过1500小时的真实交通视频实验中，框架在自动驾驶车辆识别任务上的准确率为90.0%，F1分为93.3%。发现的规则明显揭示了自动驾驶车辆在速度控制平滑性、车道变更保守性以及加速度稳定性方面的独特特征，每个规则都附有语义描述、适用场景和验证置信度。', 'title_zh': 'SVBRD-LLM: 自验证行为规则发现的自主车辆识别'}
{'arxiv_id': 'arXiv:2511.14919', 'title': 'A visual study of ICP variants for Lidar Odometry', 'authors': 'Sebastian Dingler, Hannes Burrichter', 'link': 'https://arxiv.org/abs/2511.14919', 'abstract': 'Odometry with lidar sensors is a state-of-the-art method to estimate the ego pose of a moving vehicle. Many implementations of lidar odometry use variants of the Iterative Closest Point (ICP) algorithm. Real-world effects such as dynamic objects, non-overlapping areas, and sensor noise diminish the accuracy of ICP. We build on a recently proposed method that makes these effects visible by visualizing the multidimensional objective function of ICP in two dimensions. We use this method to study different ICP variants in the context of lidar odometry. In addition, we propose a novel method to filter out dynamic objects and to address the ego blind spot problem.', 'abstract_zh': '基于激光雷达传感器的里程计是一种先进的方法，用于估算移动车辆的自车姿态。许多激光雷达里程计的实现使用ICP算法的变体。现实世界中的动态物体、非重叠区域和传感器噪声降低了ICP的准确性。我们在此基础上提出了一种方法，通过将ICP的多维目标函数可视化为二维图来使这些效应变得可见。我们使用该方法研究了不同ICP变体在激光雷达里程计中的应用。此外，我们提出了一种新的方法来筛选动态物体并解决自车盲区问题。', 'title_zh': 'ICP变体的视觉研究在激光雷达里程计中的应用'}
{'arxiv_id': 'arXiv:2511.14910', 'title': 'Z-Merge: Multi-Agent Reinforcement Learning for On-Ramp Merging with Zone-Specific V2X Traffic Information', 'authors': 'Yassine Ibork, Myounggyu Won, Lokesh Das', 'link': 'https://arxiv.org/abs/2511.14910', 'abstract': 'Ramp merging is a critical and challenging task for autonomous vehicles (AVs), particularly in mixed traffic environments with human-driven vehicles (HVs). Existing approaches typically rely on either lane-changing or inter-vehicle gap creation strategies based solely on local or neighboring information, often leading to suboptimal performance in terms of safety and traffic efficiency. In this paper, we present a V2X (vehicle-to-everything communication)-assisted Multiagent Reinforcement Learning (MARL) framework for on-ramp merging that effectively coordinates the complex interplay between lane-changing and inter-vehicle gap adaptation strategies by utilizing zone-specific global information available from a roadside unit (RSU). The merging control problem is formulated as a Multiagent Partially Observable Markov Decision Process (MA-POMDP), where agents leverage both local and global observations through V2X communication. To support both discrete and continuous control decisions, we design a hybrid action space and adopt a parameterized deep Q-learning approach. Extensive simulations, integrating the SUMO traffic simulator and the MOSAIC V2X simulator, demonstrate that our framework significantly improves merging success rate, traffic efficiency, and road safety across diverse traffic scenarios.', 'abstract_zh': '基于V2X辅助的多代理强化学习匝道并线框架', 'title_zh': 'Z-合并：基于区域特定V2X交通信息的多agent强化学习匝道汇入控制'}
{'arxiv_id': 'arXiv:2511.15669', 'title': 'DeepThinkVLA: Enhancing Reasoning Capability of Vision-Language-Action Models', 'authors': 'Cheng Yin, Yankai Lin, Wang Xu, Sikyuen Tam, Xiangrui Zeng, Zhiyuan Liu, Zhouping Yin', 'link': 'https://arxiv.org/abs/2511.15669', 'abstract': 'Enabling Vision-Language-Action (VLA) models to "think before acting" via Chain-of-Thought (CoT) is a promising path to overcoming the data-hungry nature of end-to-end robot policies. However, progress is stalled by a fundamental conflict: existing models use a single autoregressive decoder for both sequential CoT reasoning and high-dimensional, parallelizable robot actions. This architectural mismatch degrades motor control and fails to forge a strong causal link between thought and action. We introduce DeepThinkVLA, which resolves this conflict through a tightly integrated architecture and training strategy. Architecturally, our hybrid-attention decoder generates sequential CoT with causal attention and then switches to bidirectional attention for fast, parallel decoding of action vectors. This design is complemented by a two-stage training pipeline: we first use Supervised Fine-Tuning (SFT) to teach the model foundational reasoning, then apply Reinforcement Learning (RL) with task-success rewards to causally align the full reasoning-action sequence with desired outcomes. This synergy leads to state-of-the-art performance, achieving a 97.0% success rate on the LIBERO benchmark. Our ablations confirm the design\'s effectiveness: the hybrid architecture alone outperforms standard decoders by 15.5%, and the final RL stage provides a crucial 2% boost to secure top performance.', 'abstract_zh': '通过链式思考（Chain-of-Thought）使视觉-语言-动作（VLA）模型在“思而后行”：一种克服端到端机器人策略的数据饥渴性质的有前途路径及DeepThinkVLA的解决策略', 'title_zh': 'DeepThinkVLA: 提升视觉-语言-行动模型的推理能力'}
{'arxiv_id': 'arXiv:2511.15645', 'title': 'MambaIO: Global-Coordinate Inertial Odometry for Pedestrians via Multi-Scale Frequency-Decoupled Modeling', 'authors': 'Shanshan Zhang', 'link': 'https://arxiv.org/abs/2511.15645', 'abstract': 'Inertial Odometry (IO) enables real-time localization using only acceleration and angular velocity measurements from an Inertial Measurement Unit (IMU), making it a promising solution for localization in consumer-grade applications. Traditionally, IMU measurements in IO have been processed under two coordinate system paradigms: the body coordinate frame and the global coordinate frame, with the latter being widely adopted. However, recent studies in drone scenarios have demonstrated that the body frame can significantly improve localization accuracy, prompting a re-evaluation of the suitability of the global frame for pedestrian IO. To address this issue, this paper systematically evaluates the effectiveness of the global coordinate frame in pedestrian IO through theoretical analysis, qualitative inspection, and quantitative experiments. Building upon these findings, we further propose MambaIO, which decomposes IMU measurements into high-frequency and low-frequency components using a Laplacian pyramid. The low-frequency component is processed by a Mamba architecture to extract implicit contextual motion cues, while the high-frequency component is handled by a convolutional structure to capture fine-grained local motion details. Experiments on multiple public datasets show that MambaIO substantially reduces localization error and achieves state-of-the-art (SOTA) performance. To the best of our knowledge, this is the first application of the Mamba architecture to the inertial odometry task.', 'abstract_zh': '基于惯量的里程计 (Inertial Odometry, IO) 能够仅通过惯性测量单元 (IMU) 获取的加速度和角速度测量值实现实时定位，使其成为消费级应用中定位的有前途的解决方案。传统上，IO 中的 IMU 测量值在两种坐标系框架下处理：体坐标框架和全局坐标框架，后者被广泛采用。然而，最近在无人机场景中的研究表明，体坐标框架可以显著提高定位精度，促使重新评估全局框架在行人IO中的适用性。为解决这一问题，本文系统地通过理论分析、定性检验和定量实验评估了全局坐标框架在行人IO中的有效性。在此基础上，我们进一步提出 MambaIO，该方法通过拉普拉斯金字塔将 IMU 测量值分解为高频和低频分量。低频分量由 Mamba 架构处理以提取隐含的上下文运动线索，而高频分量则由卷积结构处理以捕获精细的局部运动细节。在多个公开数据集上的实验表明，MambaIO 显著降低了定位误差并达到了最先进的 (SOTA) 性能。据我们所知，这是首次将 Mamba 架构应用于惯量里程计任务。', 'title_zh': 'MambaIO：行人多尺度频域解耦惯性里程计全局坐标惯性里程计'}
{'arxiv_id': 'arXiv:2511.15522', 'title': 'PCARNN-DCBF: Minimal-Intervention Geofence Enforcement for Ground Vehicles', 'authors': 'Yinan Yu, Samuel Scheidegger', 'link': 'https://arxiv.org/abs/2511.15522', 'abstract': 'Runtime geofencing for ground vehicles is rapidly emerging as a critical technology for enforcing Operational Design Domains (ODDs). However, existing solutions struggle to reconcile high-fidelity learning with the structural requirements of verifiable control. We address this by introducing PCARNN-DCBF, a novel pipeline integrating a Physics-encoded Control-Affine Residual Neural Network with a preview-based Discrete Control Barrier Function. Unlike generic learned models, PCARNN explicitly preserves the control-affine structure of vehicle dynamics, ensuring the linearity required for reliable optimization. This enables the DCBF to enforce polygonal keep-in constraints via a real-time Quadratic Program (QP) that handles high relative degree and mitigates actuator saturation. Experiments in CARLA across electric and combustion platforms demonstrate that this structure-preserving approach significantly outperforms analytical and unstructured neural baselines.', 'abstract_zh': '基于物理编码的控制 affine 神经网络与前瞻离散控制障碍函数集成的运行时地理围栏技术：面向地面车辆的操作设计域约束实现', 'title_zh': 'PCARNN-DCBF: 基于最小干预的地面上车辆地理围栏执行方法'}
{'arxiv_id': 'arXiv:2511.15343', 'title': 'Fast Post-Hoc Confidence Fusion for 3-Class Open-Set Aerial Object Detection', 'authors': 'Spyridon Loukovitis, Vasileios Karampinis, Athanasios Voulodimos', 'link': 'https://arxiv.org/abs/2511.15343', 'abstract': "Developing reliable UAV navigation systems requires robust air-to-air object detectors capable of distinguishing between objects seen during training and previously unseen objects. While many methods address closed-set detection and achieve high-confidence recognition of in-domain (ID) targets, they generally do not tackle open-set detection, which requires simultaneous handling of both ID and out-of-distribution (OOD) objects. Existing open-set approaches typically rely on a single uncertainty score with thresholding, limiting flexibility and often conflating OOD objects with background clutter. In contrast, we propose a lightweight, model-agnostic post-processing framework that explicitly separates background from unknown objects while preserving the base detector's performance. Our approach extends open-set detection beyond binary ID/OOD classification to real-time three-way classification among ID targets, OOD objects, and background. To this end, we employ a fusion scheme that aggregates multiple confidence estimates and per-detection features using a compact multilayer perceptron (MLP). Incorporating different logit variants into the MLP consistently enhances performance across both binary and three-class classification without compromising throughput. Extensive ablation and comparative experiments confirm that our method surpasses threshold-based baselines in two-class classification by an average of 2.7% AUROC, while retaining or improving open-set mAP. Furthermore, our study uniquely enables robust three-class classification, a critical capability for safe UAV navigation, where OOD objects must be actively avoided and background regions safely ignored. Comparative analysis highlights that our method surpasses competitive techniques in AUROC across datasets, while improving closed-set mAP by up to 9 points, an 18% relative gain.", 'abstract_zh': '开发可靠的无人机导航系统需要稳健的空中目标检测器，能够区分训练中见到的对象和前所未见的对象。现有方法通常专注于闭集检测，实现了对域内目标的高置信度识别，但通常不处理开放集检测，后者需要同时处理已知对象和不属分布对象。现有的开放集方法通常依赖单一的不确定性评分和阈值划分，限制了灵活性，并且经常将不属分布对象与背景杂波混淆。相比之下，我们提出了一种轻量级、模型无关的后处理框架，在保留基础检测器性能的同时明确地将背景与未知对象分离。我们的方法将开放集检测扩展到实时三分类，即对已知目标、不属分布对象和背景进行分类。为此，我们采用了一种融合方案，利用一个紧凑的多层感知机（MLP）聚合多个置信估计和单个检测特征。将不同类型的logit变体整合到MLP中，在二分类和三分类中保持了性能的提升，且不牺牲吞吐量。广泛的消融实验和对比实验表明，与基于阈值的基线方法相比，我们的方法在二分类中的平均AUROC提升2.7%，同时保留或提高了开放集mAP。此外，我们的研究首次实现了稳健的三分类，这是安全无人机导航所需的关键能力，其中不属分布对象必须主动避免，背景区域则需安全忽略。对比分析显示，我们的方法在不同数据集上的AUROC上超越了竞争性技术，同时在闭集mAP上提高了高达9个点，即18%的相对增益。', 'title_zh': '快速事后信心融合方法用于三类开放集航空目标检测'}
{'arxiv_id': 'arXiv:2511.15119', 'title': 'Nonholonomic Robot Parking by Feedback -- Part I: Modular Strict CLF Designs', 'authors': 'Velimir Todorovski, Kwang Hak Kim, Alessandro Astolfi, Miroslav Krstic', 'link': 'https://arxiv.org/abs/2511.15119', 'abstract': 'It has been known in the robotics literature since about 1995 that, in polar coordinates, the nonholonomic unicycle is asymptotically stabilizable by smooth feedback, even globally. We introduce a modular design framework that selects the forward velocity to decouple the radial coordinate, allowing the steering subsystem to be stabilized independently. Within this structure, we develop families of feedback laws using passivity, backstepping, and integrator forwarding. Each law is accompanied by a strict control Lyapunov function, including barrier variants that enforce angular constraints. These strict CLFs provide constructive class KL convergence estimates and enable eigenvalue assignment at the target equilibrium. The framework generalizes and extends prior modular and nonmodular approaches, while preparing the ground for inverse optimal and adaptive redesigns in the sequel paper.', 'abstract_zh': '自1995年以来，机器人文献中已知，非holonomic单轨车在极坐标系下可以通过光滑反馈全局渐近稳定化。我们引入了一种模块化设计框架，选择前向速度以解耦径向坐标，使得转向子系统可以独立稳定化。在该结构内部，我们利用.passivity.、.backstepping.和.积分前馈.发展了一组反馈律。每一律都有严格的控制李亚普诺夫函数，包括强制角向约束的屏障变体。这些严格的CLFs提供了构造性的类KL收敛估计，并允许在目标平衡点处进行特征值分配。该框架扩展了先前的模块化和非模块化方法，为后续论文中的反最优和自适应重新设计奠定了基础。', 'title_zh': '非完整机器人停车控制——第一部分：模块化严格CLF设计'}
{'arxiv_id': 'arXiv:2511.15055', 'title': 'Learning Human-Like RL Agents Through Trajectory Optimization With Action Quantization', 'authors': 'Jian-Ting Guo, Yu-Cheng Chen, Ping-Chun Hsieh, Kuo-Hao Ho, Po-Wei Huang, Ti-Rong Wu, I-Chen Wu', 'link': 'https://arxiv.org/abs/2511.15055', 'abstract': 'Human-like agents have long been one of the goals in pursuing artificial intelligence. Although reinforcement learning (RL) has achieved superhuman performance in many domains, relatively little attention has been focused on designing human-like RL agents. As a result, many reward-driven RL agents often exhibit unnatural behaviors compared to humans, raising concerns for both interpretability and trustworthiness. To achieve human-like behavior in RL, this paper first formulates human-likeness as trajectory optimization, where the objective is to find an action sequence that closely aligns with human behavior while also maximizing rewards, and adapts the classic receding-horizon control to human-like learning as a tractable and efficient implementation. To achieve this, we introduce Macro Action Quantization (MAQ), a human-like RL framework that distills human demonstrations into macro actions via Vector-Quantized VAE. Experiments on D4RL Adroit benchmarks show that MAQ significantly improves human-likeness, increasing trajectory similarity scores, and achieving the highest human-likeness rankings among all RL agents in the human evaluation study. Our results also demonstrate that MAQ can be easily integrated into various off-the-shelf RL algorithms, opening a promising direction for learning human-like RL agents. Our code is available at this https URL.', 'abstract_zh': '类人代理在强化学习中的实现：轨迹优化与宏观动作量化', 'title_zh': '通过动作量化进行轨迹优化学习人类般的RL代理'}
{'arxiv_id': 'arXiv:2511.14970', 'title': 'EGSA-PT:Edge-Guided Spatial Attention with Progressive Training for Monocular Depth Estimation and Segmentation of Transparent Objects', 'authors': 'Gbenga Omotara, Ramy Farag, Seyed Mohamad Ali Tousi, G.N. DeSouza', 'link': 'https://arxiv.org/abs/2511.14970', 'abstract': 'Transparent object perception remains a major challenge in computer vision research, as transparency confounds both depth estimation and semantic segmentation. Recent work has explored multi-task learning frameworks to improve robustness, yet negative cross-task interactions often hinder performance. In this work, we introduce Edge-Guided Spatial Attention (EGSA), a fusion mechanism designed to mitigate destructive interactions by incorporating boundary information into the fusion between semantic and geometric features. On both Syn-TODD and ClearPose benchmarks, EGSA consistently improved depth accuracy over the current state of the art method (MODEST), while preserving competitive segmentation performance, with the largest improvements appearing in transparent regions. Besides our fusion design, our second contribution is a multi-modal progressive training strategy, where learning transitions from edges derived from RGB images to edges derived from predicted depth images. This approach allows the system to bootstrap learning from the rich textures contained in RGB images, and then switch to more relevant geometric content in depth maps, while it eliminates the need for ground-truth depth at training time. Together, these contributions highlight edge-guided fusion as a robust approach capable of improving transparent object perception.', 'abstract_zh': '透明对象感知仍然是计算机视觉研究中的一个主要挑战，因为透明性既干扰深度估计又干扰语义分割。最近的工作探索了多任务学习框架以提高鲁棒性，但跨任务的负交互作用往往会阻碍性能。在本文中，我们提出了边界引导空间注意力（EGSA）机制，通过将边界信息纳入语义和几何特征的融合中，旨在减轻破坏性交互作用。在Syn-TODD和ClearPose基准测试中，EGSA始终在当前最先进的方法（MODEST）上提高了深度精度，同时保持了竞争力的分割性能，最大的改进出现在透明区域。除了我们的融合设计，我们还贡献了一种多模态渐进训练策略，在这种策略中，学习从RGB图像导出的边缘过渡到由预测深度图像导出的边缘。这种方法使得系统可以从RGB图像中丰富的纹理中启动学习，然后切换到深度图中的更相关的几何内容，同时消除了训练时需要地面真值深度的需求。这两方面的贡献共同强调了边界引导融合作为一种稳健的方法，能够改善透明对象感知。', 'title_zh': 'EGSA-PT：基于边缘引导的空间注意力机制与分阶段训练在单目透明物体深度估计与分割中的应用'}
{'arxiv_id': 'arXiv:2511.14952', 'title': 'Artificial intelligence approaches for energy-efficient laser cutting machines', 'authors': 'Mohamed Abdallah Salem, Hamdy Ahmed Ashour, Ahmed Elshenawy', 'link': 'https://arxiv.org/abs/2511.14952', 'abstract': "This research addresses the significant challenges of energy consumption and environmental impact in laser cutting by proposing novel deep learning (DL) methodologies to achieve energy reduction. Recognizing the current lack of adaptive control and the open-loop nature of CO2 laser suction pumps, this study utilizes closed-loop configurations that dynamically adjust pump power based on both the material being cut and the smoke level generated. To implement this adaptive system, diverse material classification methods are introduced, including techniques leveraging lens-less speckle sensing with a customized Convolutional Neural Network (CNN) and an approach using a USB camera with transfer learning via the pre-trained VGG16 CNN model. Furthermore, a separate DL model for smoke level detection is employed to simultaneously refine the pump's power output. This integration prompts the exhaust suction pump to automatically halt during inactive times and dynamically adjust power during operation, leading to experimentally proven and remarkable energy savings, with results showing a 20% to 50% reduction in the smoke suction pump's energy consumption, thereby contributing substantially to sustainable development in the manufacturing sector.", 'abstract_zh': '基于深度学习的激光切割能耗优化方法与应用研究', 'title_zh': '人工智能方法在节能激光切割机中的应用'}
{'arxiv_id': 'arXiv:2511.14876', 'title': 'Attacking Autonomous Driving Agents with Adversarial Machine Learning: A Holistic Evaluation with the CARLA Leaderboard', 'authors': 'Henry Wong, Clement Fung, Weiran Lin, Karen Li, Stanley Chen, Lujo Bauer', 'link': 'https://arxiv.org/abs/2511.14876', 'abstract': 'To autonomously control vehicles, driving agents use outputs from a combination of machine-learning (ML) models, controller logic, and custom modules. Although numerous prior works have shown that adversarial examples can mislead ML models used in autonomous driving contexts, it remains unclear if these attacks are effective at producing harmful driving actions for various agents, environments, and scenarios.\nTo assess the risk of adversarial examples to autonomous driving, we evaluate attacks against a variety of driving agents, rather than against ML models in isolation. To support this evaluation, we leverage CARLA, an urban driving simulator, to create and evaluate adversarial examples. We create adversarial patches designed to stop or steer driving agents, stream them into the CARLA simulator at runtime, and evaluate them against agents from the CARLA Leaderboard, a public repository of best-performing autonomous driving agents from an annual research competition. Unlike prior work, we evaluate attacks against autonomous driving systems without creating or modifying any driving-agent code and against all parts of the agent included with the ML model.\nWe perform a case-study investigation of two attack strategies against three open-source driving agents from the CARLA Leaderboard across multiple driving scenarios, lighting conditions, and locations. Interestingly, we show that, although some attacks can successfully mislead ML models into predicting erroneous stopping or steering commands, some driving agents use modules, such as PID control or GPS-based rules, that can overrule attacker-manipulated predictions from ML models.', 'abstract_zh': '自动驾驶系统中对抗样本的风险评估：对多种驾驶代理的攻击策略评价', 'title_zh': '使用 adversarial machine learning 攻击自主驾驶代理：基于 CARLA 领先榜的综合性评估'}
