{'arxiv_id': 'arXiv:2507.01811', 'title': 'Towards Design and Development of a Concentric Tube Steerable Drilling Robot for Creating S-shape Tunnels for Pelvic Fixation Procedures', 'authors': 'Yash Kulkarni, Susheela Sharma, Sarah Go, Jordan P. Amadio, Mohsen Khadem, Farshid Alambeigi', 'link': 'https://arxiv.org/abs/2507.01811', 'abstract': 'Current pelvic fixation techniques rely on rigid drilling tools, which inherently constrain the placement of rigid medical screws in the complex anatomy of pelvis. These constraints prevent medical screws from following anatomically optimal pathways and force clinicians to fixate screws in linear trajectories. This suboptimal approach, combined with the unnatural placement of the excessively long screws, lead to complications such as screw misplacement, extended surgery times, and increased radiation exposure due to repeated X-ray images taken ensure to safety of procedure. To address these challenges, in this paper, we present the design and development of a unique 4 degree-of-freedom (DoF) pelvic concentric tube steerable drilling robot (pelvic CT-SDR). The pelvic CT-SDR is capable of creating long S-shaped drilling trajectories that follow the natural curvatures of the pelvic anatomy. The performance of the pelvic CT-SDR was thoroughly evaluated through several S-shape drilling experiments in simulated bone phantoms.', 'abstract_zh': '当前的骨盆固定技术依赖于刚性钻具，这固有限制了在骨盆复杂解剖结构中放置刚性医用工件螺钉的位置。这些限制妨碍了螺钉沿解剖最优路径放置，迫使临床医生将螺钉固定在直线轨迹中。这种次优的方法，结合过长螺钉的不自然放置，导致螺钉放置错误、手术时间延长以及由于重复拍摄确保手术安全的X光图像而增加的辐射暴露。为了解决这些挑战，本文介绍了一种独特的具有4自由度（DoF）的骨盆同心管可操控钻孔机器人（骨盆CT-SDR）的设计与开发。骨盆CT-SDR能够创建长S形钻孔轨迹，跟随骨盆解剖结构的自然曲率。骨盆CT-SDR的性能通过在模拟骨骼模型上进行多次S形钻孔实验得到了全面评估。', 'title_zh': '面向S形隧道创建的骨盆固定手术可调弯芯管钻孔机器人设计与开发'}
{'arxiv_id': 'arXiv:2507.01779', 'title': 'S3D: A Spatial Steerable Surgical Drilling Framework for Robotic Spinal Fixation Procedures', 'authors': 'Daniyal Maroufi, Xinyuan Huang, Yash Kulkarni, Omid Rezayof, Susheela Sharma, Vaibhav Goggela, Jordan P. Amadio, Mohsen Khadem, Farshid Alambeigi', 'link': 'https://arxiv.org/abs/2507.01779', 'abstract': 'In this paper, we introduce S3D: A Spatial Steerable Surgical Drilling Framework for Robotic Spinal Fixation Procedures. S3D is designed to enable realistic steerable drilling while accounting for the anatomical constraints associated with vertebral access in spinal fixation (SF) procedures. To achieve this, we first enhanced our previously designed concentric tube Steerable Drilling Robot (CT-SDR) to facilitate steerable drilling across all vertebral levels of the spinal column. Additionally, we propose a four-Phase calibration, registration, and navigation procedure to perform realistic SF procedures on a spine holder phantom by integrating the CT-SDR with a seven-degree-of-freedom robotic manipulator. The functionality of this framework is validated through planar and out-of-plane steerable drilling experiments in vertebral phantoms.', 'abstract_zh': 'S3D：一种用于脊柱固定手术的时空自适应骨钻框架', 'title_zh': 'S3D: 一种用于 robotic脊柱固定手术的时空可调手术钻孔框架'}
{'arxiv_id': 'arXiv:2507.01753', 'title': 'Augmented Bridge Spinal Fixation: A New Concept for Addressing Pedicle Screw Pullout via a Steerable Drilling Robot and Flexible Pedicle Screws', 'authors': 'Yash Kulkarni, Susheela Sharma, Omid Rezayof, Siddhartha Kapuria, Jordan P. Amadio, Mohsen Khadem, Maryam Tilton, Farshid Alambeigi', 'link': 'https://arxiv.org/abs/2507.01753', 'abstract': 'To address the screw loosening and pullout limitations of rigid pedicle screws in spinal fixation procedures, and to leverage our recently developed Concentric Tube Steerable Drilling Robot (CT-SDR) and Flexible Pedicle Screw (FPS), in this paper, we introduce the concept of Augmented Bridge Spinal Fixation (AB-SF). In this concept, two connecting J-shape tunnels are first drilled through pedicles of vertebra using the CT-SDR. Next, two FPSs are passed through this tunnel and bone cement is then injected through the cannulated region of the FPS to form an augmented bridge between two pedicles and reinforce strength of the fixated spine. To experimentally analyze and study the feasibility of AB-SF technique, we first used our robotic system (i.e., a CT-SDR integrated with a robotic arm) to create two different fixation scenarios in which two J-shape tunnels, forming a bridge, were drilled at different depth of a vertebral phantom. Next, we implanted two FPSs within the drilled tunnels and then successfully simulated the bone cement augmentation process.', 'abstract_zh': '增强桥梁脊柱固定术（AB-SF）的概念及其可行性研究', 'title_zh': '可增强脊柱固定的新概念：通过可转向钻孔机器人和柔性椎弓根螺钉解决椎弓根螺钉拉出问题'}
{'arxiv_id': 'arXiv:2507.01705', 'title': 'Efficient Collision Detection for Long and Slender Robotic Links in Euclidean Distance Fields: Application to a Forestry Crane', 'authors': 'Marc-Philip Ecker, Bernhard Bischof, Minh Nhat Vu, Christoph Fröhlich, Tobias Glück, Wolfgang Kemmetmüller', 'link': 'https://arxiv.org/abs/2507.01705', 'abstract': "Collision-free motion planning in complex outdoor environments relies heavily on perceiving the surroundings through exteroceptive sensors. A widely used approach represents the environment as a voxelized Euclidean distance field, where robots are typically approximated by spheres. However, for large-scale manipulators such as forestry cranes, which feature long and slender links, this conventional spherical approximation becomes inefficient and inaccurate. This work presents a novel collision detection algorithm specifically designed to exploit the elongated structure of such manipulators, significantly enhancing the computational efficiency of motion planning algorithms. Unlike traditional sphere decomposition methods, our approach not only improves computational efficiency but also naturally eliminates the need to fine-tune the approximation accuracy as an additional parameter. We validate the algorithm's effectiveness using real-world LiDAR data from a forestry crane application, as well as simulated environment data.", 'abstract_zh': '基于延长结构的复杂户外环境无碰撞运动规划方法', 'title_zh': 'Euclidean距离场中长柔状机器人连杆高效碰撞检测的应用：以林业吊机为例'}
{'arxiv_id': 'arXiv:2507.01561', 'title': 'Self-Closing Suction Grippers for Industrial Grasping via Form-Flexible Design', 'authors': 'Huijiang Wang, Holger Kunz, Timon Adler, Fumiya Iida', 'link': 'https://arxiv.org/abs/2507.01561', 'abstract': 'Shape-morphing robots have shown benefits in industrial grasping. We propose form-flexible grippers for adaptive grasping. The design is based on the hybrid jamming and suction mechanism, which deforms to handle objects that vary significantly in size from the aperture, including both larger and smaller parts. Compared with traditional grippers, the gripper achieves self-closing to form an airtight seal. Under a vacuum, a wide range of grasping is realized through the passive morphing mechanism at the interface that harmonizes pressure and flow rate. This hybrid gripper showcases the capability to securely grasp an egg, as small as 54.5% of its aperture, while achieving a maximum load-to-mass ratio of 94.3.', 'abstract_zh': '形变灵活夹持器实现适应性抓取', 'title_zh': '工业抓取用自闭合吸盘设计综述'}
{'arxiv_id': 'arXiv:2507.01462', 'title': 'Quantum-Assisted Automatic Path-Planning for Robotic Quality Inspection in Industry 4.0', 'authors': 'Eneko Osaba, Estibaliz Garrote, Pablo Miranda-Rodriguez, Alessia Ciacco, Itziar Cabanes, Aitziber Mancisidor', 'link': 'https://arxiv.org/abs/2507.01462', 'abstract': 'This work explores the application of hybrid quantum-classical algorithms to optimize robotic inspection trajectories derived from Computer-Aided Design (CAD) models in industrial settings. By modeling the task as a 3D variant of the Traveling Salesman Problem, incorporating incomplete graphs and open-route constraints, this study evaluates the performance of two D-Wave-based solvers against classical methods such as GUROBI and Google OR-Tools. Results across five real-world cases demonstrate competitive solution quality with significantly reduced computation times, highlighting the potential of quantum approaches in automation under Industry 4.0.', 'abstract_zh': '本研究探讨了混合量子-经典算法在工业环境中利用计算机辅助设计（CAD）模型优化机器人检测路径的应用。通过将任务建模为三维旅行商问题变种，并结合不完全图和开路约束，本研究评估了基于D-Wave的求解器与GUROBI和Google OR-Tools等经典方法的性能。在五个实际案例中的结果表明，量子方法在解决方案质量上具有竞争力，且计算时间显著减少，突显了在 Industry 4.0 中自动化领域量子方法的潜力。', 'title_zh': 'Industry 4.0环境中基于量子辅助自动路径规划的机器人质量检测'}
{'arxiv_id': 'arXiv:2507.01426', 'title': 'Approximation-free Control of Unknown Euler-Lagrangian Systems under Input Constraints', 'authors': 'Ratnangshu Das, Pushpak Jagtap', 'link': 'https://arxiv.org/abs/2507.01426', 'abstract': 'In this paper, we present a novel funnel-based tracking control algorithm for robotic systems with unknown dynamics and prescribed input constraints. The Euler-Lagrange formulation, a common modeling approach for robotic systems, has been adopted in this study to address the trade-off between performance and actuator safety. We establish feasibility conditions that ensure tracking errors evolve within predefined funnel bounds while maintaining bounded control efforts, a crucial consideration for robots with limited actuation capabilities. We propose two approximation-free control strategies for scenarios where these conditions are violated: one actively corrects the error, and the other stops further deviation. Finally, we demonstrate the robust performance and safety of the approach through simulations and experimental validations. This work represents a significant advancement in funnel-based control, enhancing its applicability to real-world robotics systems with input constraints.', 'abstract_zh': '一种新型抛物面基于跟踪控制算法：未知动力学和指定输入约束下的机器人系统控制', 'title_zh': '无近似控制未知欧拉-拉格朗日系统下的输入约束'}
{'arxiv_id': 'arXiv:2507.01308', 'title': 'LANet: A Lane Boundaries-Aware Approach For Robust Trajectory Prediction', 'authors': 'Muhammad Atta ur Rahman, Dooseop Choi, KyoungWook Min', 'link': 'https://arxiv.org/abs/2507.01308', 'abstract': 'Accurate motion forecasting is critical for safe and efficient autonomous driving, enabling vehicles to predict future trajectories and make informed decisions in complex traffic scenarios. Most of the current designs of motion prediction models are based on the major representation of lane centerlines, which limits their capability to capture critical road environments and traffic rules and constraints. In this work, we propose an enhanced motion forecasting model informed by multiple vector map elements, including lane boundaries and road edges, that facilitates a richer and more complete representation of driving environments. An effective feature fusion strategy is developed to merge information in different vector map components, where the model learns holistic information on road structures and their interactions with agents. Since encoding more information about the road environment increases memory usage and is computationally expensive, we developed an effective pruning mechanism that filters the most relevant map connections to the target agent, ensuring computational efficiency while maintaining essential spatial and semantic relationships for accurate trajectory prediction. Overcoming the limitations of lane centerline-based models, our method provides a more informative and efficient representation of the driving environment and advances the state of the art for autonomous vehicle motion forecasting. We verify our approach with extensive experiments on the Argoverse 2 motion forecasting dataset, where our method maintains competitiveness on AV2 while achieving improved performance.\nIndex Terms-Autonomous driving, trajectory prediction, vector map elements, road topology, connection pruning, Argoverse 2.', 'abstract_zh': '准确的动力学预测对于确保自主驾驶的安全和高效至关重要，使车辆能够预测未来的轨迹并在复杂的交通场景中做出明智的决策。当前的动力预测模型主要基于车道中线的表示，这限制了它们捕捉关键道路环境和交通规则及约束的能力。在本工作中，我们提出了一种增强的动力预测模型，该模型由多种矢量地图元素提供信息，包括车道边界和道路边缘，从而提供更丰富和完整的驾驶环境表示。开发了一种有效的特征融合策略，将不同矢量地图组件中的信息合并，模型学习道路结构及其与代理的交互的完整信息。由于编码更多关于道路环境的信息会增加内存使用并计算成本高昂，我们开发了一种有效的剪枝机制，过滤与目标代理最相关的地图连接，确保在保持准确轨迹预测所需的空间和语义关系的同时，提高计算效率。克服车道中线模型的局限性，我们的方法提供了更信息丰富和高效的驾驶环境表示，并推动了自主车辆动力学预测的标准。我们在Argoverse 2动力学预测数据集上进行广泛的实验验证了我们的方法，我们的方法在AV2中保持竞争力的同时实现性能提升。索引术语-自主驾驶，轨迹预测，矢量地图元素，道路拓扑，连接剪枝，Argoverse 2。', 'title_zh': 'LANet：一种关注车道边界的稳健轨迹预测方法'}
{'arxiv_id': 'arXiv:2507.01198', 'title': 'Search-Based Robot Motion Planning With Distance-Based Adaptive Motion Primitives', 'authors': 'Benjamin Kraljusic, Zlatan Ajanovic, Nermin Covic, Bakir Lacevic', 'link': 'https://arxiv.org/abs/2507.01198', 'abstract': 'This work proposes a motion planning algorithm for robotic manipulators that combines sampling-based and search-based planning methods. The core contribution of the proposed approach is the usage of burs of free configuration space (C-space) as adaptive motion primitives within the graph search algorithm. Due to their feature to adaptively expand in free C-space, burs enable more efficient exploration of the configuration space compared to fixed-sized motion primitives, significantly reducing the time to find a valid path and the number of required expansions. The algorithm is implemented within the existing SMPL (Search-Based Motion Planning Library) library and evaluated through a series of different scenarios involving manipulators with varying number of degrees-of-freedom (DoF) and environment complexity. Results demonstrate that the bur-based approach outperforms fixed-primitive planning in complex scenarios, particularly for high DoF manipulators, while achieving comparable performance in simpler scenarios.', 'abstract_zh': '基于采样和搜索规划方法的机器人 manipulator 运动规划算法：基于自由配置空间泡的可适应运动基元', 'title_zh': '基于搜索的机器人运动规划与距离自适应运动基元'}
{'arxiv_id': 'arXiv:2507.01181', 'title': 'A Differentiable Distance Metric for Robotics Through Generalized Alternating Projection', 'authors': 'Vinicius M. Gonçalves, Shiqing Wei, Eduardo Malacarne S. de Souza, Krishnamurthy Prashanth, Anthony Tzes, Farshad Khorrami', 'link': 'https://arxiv.org/abs/2507.01181', 'abstract': 'In many robotics applications, it is necessary to compute not only the distance between the robot and the environment, but also its derivative - for example, when using control barrier functions. However, since the traditional Euclidean distance is not differentiable, there is a need for alternative distance metrics that possess this property. Recently, a metric with guaranteed differentiability was proposed [1]. This approach has some important drawbacks, which we address in this paper. We provide much simpler and practical expressions for the smooth projection for general convex polytopes. Additionally, as opposed to [1], we ensure that the distance vanishes as the objects overlap. We show the efficacy of the approach in experimental results. Our proposed distance metric is publicly available through the Python-based simulation package UAIBot.', 'abstract_zh': '在许多机器人应用中，不仅需要计算机器人与环境之间的距离，还需要计算其导数——例如，在使用控制屏障函数时。由于传统的欧几里得距离不可微，因此需要具有可微性的替代距离度量。近期提出了一种具有保证可微性的度量方法[1]。该方法存在一些重要的缺点，本文对此进行了改进。我们为一般凸多面体提供了更简单且实用的光滑投影表达式。此外，与[1]不同，我们确保当对象重叠时距离为零。我们在实验结果中展示了该方法的有效性。我们提出的距离度量可以通过基于Python的仿真包UAIBot公开获取。', 'title_zh': '通过广义交替投影的可微距离度量在机器人学中的应用'}
{'arxiv_id': 'arXiv:2507.01161', 'title': 'Imitation Learning for Satellite Attitude Control under Unknown Perturbations', 'authors': 'Zhizhuo Zhang, Hao Peng, Xiaoli Bai', 'link': 'https://arxiv.org/abs/2507.01161', 'abstract': "This paper presents a novel satellite attitude control framework that integrates Soft Actor-Critic (SAC) reinforcement learning with Generative Adversarial Imitation Learning (GAIL) to achieve robust performance under various unknown perturbations. Traditional control techniques often rely on precise system models and are sensitive to parameter uncertainties and external perturbations. To overcome these limitations, we first develop a SAC-based expert controller that demonstrates improved resilience against actuator failures, sensor noise, and attitude misalignments, outperforming our previous results in several challenging scenarios. We then use GAIL to train a learner policy that imitates the expert's trajectories, thereby reducing training costs and improving generalization through expert demonstrations. Preliminary experiments under single and combined perturbations show that the SAC expert can rotate the antenna to a specified direction and keep the antenna orientation reliably stable in most of the listed perturbations. Additionally, the GAIL learner can imitate most of the features from the trajectories generated by the SAC expert. Comparative evaluations and ablation studies confirm the effectiveness of the SAC algorithm and reward shaping. The integration of GAIL further reduces sample complexity and demonstrates promising imitation capabilities, paving the way for more intelligent and autonomous spacecraft control systems.", 'abstract_zh': '本文提出了一种新颖的卫星姿态控制框架，该框架将软actor- Critic (SAC) 强化学习与生成对抗式模仿学习 (GAIL) 相融合，以在各种未知干扰下实现稳健性能。传统的控制技术通常依赖于精确的系统模型，并对参数不确定性及外部干扰敏感。为克服这些局限性，我们首先开发了一种基于SAC的专家控制器，该控制器在执行器故障、传感器噪声和姿态错位方面表现出更高的抗干扰能力，并在多个具有挑战性的场景中优于我们之前的结果。然后，我们使用GAIL对学习策略进行训练，使其模仿专家的行为轨迹，从而通过专家演示降低训练成本并提高泛化能力。初步实验表明，在单一和组合干扰下，SAC专家可以将天线对准指定方向，并在大多数列举的干扰下可靠地保持天线姿态稳定。此外，GAIL学习者可以模仿SAC专家生成的大部分轨迹特征。对比评估和消融研究证实了SAC算法和奖励塑形的有效性。GAIL的集成进一步降低了样本复杂性，并展示了强大的模仿能力，为更智能和自主的空间craft控制系统铺平了道路。', 'title_zh': '未知扰动下卫星姿态控制的模仿学习'}
