{'arxiv_id': 'arXiv:2504.17784', 'title': 'Gripper Keypose and Object Pointflow as Interfaces for Bimanual Robotic Manipulation', 'authors': 'Yuyin Yang, Zetao Cai, Yang Tian, Jia Zeng, Jiangmiao Pang', 'link': 'https://arxiv.org/abs/2504.17784', 'abstract': 'Bimanual manipulation is a challenging yet crucial robotic capability, demanding precise spatial localization and versatile motion trajectories, which pose significant challenges to existing approaches. Existing approaches fall into two categories: keyframe-based strategies, which predict gripper poses in keyframes and execute them via motion planners, and continuous control methods, which estimate actions sequentially at each timestep. The keyframe-based method lacks inter-frame supervision, struggling to perform consistently or execute curved motions, while the continuous method suffers from weaker spatial perception. To address these issues, this paper introduces an end-to-end framework PPI (keyPose and Pointflow Interface), which integrates the prediction of target gripper poses and object pointflow with the continuous actions estimation. These interfaces enable the model to effectively attend to the target manipulation area, while the overall framework guides diverse and collision-free trajectories. By combining interface predictions with continuous actions estimation, PPI demonstrates superior performance in diverse bimanual manipulation tasks, providing enhanced spatial localization and satisfying flexibility in handling movement restrictions. In extensive evaluations, PPI significantly outperforms prior methods in both simulated and real-world experiments, achieving state-of-the-art performance with a +16.1% improvement on the RLBench2 simulation benchmark and an average of +27.5% gain across four challenging real-world tasks. Notably, PPI exhibits strong stability, high precision, and remarkable generalization capabilities in real-world scenarios. Project page: this https URL', 'abstract_zh': '双臂操作是具有挑战性但又至关重要的机器人能力，需要精确的空间定位和多样的运动轨迹，这对现有方法提出了重大挑战。现有的方法主要分为两类：关键帧基方法，预测关键帧中的手部姿态并通过运动规划器执行；连续控制方法，在每个时间步序贯估计动作。关键帧基方法缺乏帧间监督，难以一致执行或执行曲线运动，而连续方法则在空间感知方面较弱。为解决这些问题，本文提出了一种端到端框架PPI（目标姿态和点流接口），将目标手部姿态和对象点流的预测与连续动作估计结合。这些接口使模型能够有效关注目标操作区域，而整体框架指导多样的无碰撞轨迹。通过结合接口预测和连续动作估计，PPI 在多种双臂操作任务中表现出优越性能，提供了增强的空间定位和在处理运动限制方面更好的灵活性。在广泛的评估中，PPI 在模拟和真实世界实验中均显著优于先前的方法，在RLBench2模拟基准测试中提高了16.1%，在四个具有挑战性的真实世界任务中平均提高了27.5%。值得一提的是，PPI 在真实世界场景中表现出强大的稳定性、高精度和卓越的泛化能力。项目页面：this https URL。', 'title_zh': 'Gripper Keypose和Object Pointflow作为双臂机器人 manipulation的接口'}
{'arxiv_id': 'arXiv:2504.17771', 'title': 'Integrating Learning-Based Manipulation and Physics-Based Locomotion for Whole-Body Badminton Robot Control', 'authors': 'Haochen Wang, Zhiwei Shi, Chengxi Zhu, Yafei Qiao, Cheng Zhang, Fan Yang, Pengjie Ren, Lan Lu, Dong Xuan', 'link': 'https://arxiv.org/abs/2504.17771', 'abstract': "Learning-based methods, such as imitation learning (IL) and reinforcement learning (RL), can produce excel control policies over challenging agile robot tasks, such as sports robot. However, no existing work has harmonized learning-based policy with model-based methods to reduce training complexity and ensure the safety and stability for agile badminton robot control. In this paper, we introduce \\ourmethod, a novel hybrid control system for agile badminton robots. Specifically, we propose a model-based strategy for chassis locomotion which provides a base for arm policy. We introduce a physics-informed ``IL+RL'' training framework for learning-based arm policy. In this train framework, a model-based strategy with privileged information is used to guide arm policy training during both IL and RL phases. In addition, we train the critic model during IL phase to alleviate the performance drop issue when transitioning from IL to RL. We present results on our self-engineered badminton robot, achieving 94.5% success rate against the serving machine and 90.7% success rate against human players. Our system can be easily generalized to other agile mobile manipulation tasks such as agile catching and table tennis. Our project website: this https URL.", 'abstract_zh': '基于学习的方法，如模仿学习（IL）和强化学习（RL），可以在诸如羽毛球机器人等具有挑战性的敏捷机器人任务中产生优秀的控制策略。然而，目前尚无工作将基于学习的方法与基于模型的方法相结合，以降低训练复杂性并确保敏捷羽毛球机器人控制的安全性和稳定性。在本文中，我们提出了一种新颖的混合控制系统，用于敏捷羽毛球机器人。具体而言，我们提出了一种基于模型的策略，用于底盘运动，作为手臂策略的基础。我们引入了一种物理启发的“IL+RL”训练框架，用于学习基于模型的策略。在该训练框架中，一种包含优先信息的基于模型的策略被用于引导手臂策略在IL和RL阶段的训练。此外，我们在IL阶段训练批评模型，以缓解从IL过渡到RL时的表现下降问题。我们在自行设计的羽毛球机器人上进行了实验，取得了94.5%的成功率，对发球机和90.7%的成功率，对人类对手。我们的系统可以轻松泛化到其他敏捷移动操作任务，如敏捷接球和乒乓球。我们的项目网站: this https URL。', 'title_zh': '基于学习的 manipulation 和基于物理的运动在整体体态羽毛球机器人控制中的集成'}
{'arxiv_id': 'arXiv:2504.17748', 'title': 'Robotic Task Ambiguity Resolution via Natural Language Interaction', 'authors': 'Eugenio Chisari, Jan Ole von Hartz, Fabien Despinoy, Abhinav Valada', 'link': 'https://arxiv.org/abs/2504.17748', 'abstract': 'Language-conditioned policies have recently gained substantial adoption in robotics as they allow users to specify tasks using natural language, making them highly versatile. While much research has focused on improving the action prediction of language-conditioned policies, reasoning about task descriptions has been largely overlooked. Ambiguous task descriptions often lead to downstream policy failures due to misinterpretation by the robotic agent. To address this challenge, we introduce AmbResVLM, a novel method that grounds language goals in the observed scene and explicitly reasons about task ambiguity. We extensively evaluate its effectiveness in both simulated and real-world domains, demonstrating superior task ambiguity detection and resolution compared to recent state-of-the-art baselines. Finally, real robot experiments show that our model improves the performance of downstream robot policies, increasing the average success rate from 69.6% to 97.1%. We make the data, code, and trained models publicly available at this https URL.', 'abstract_zh': '基于语言条件的策略近年来在机器人领域获得了广泛应用，它们允许用户使用自然语言指定任务，使这些策略具有高度的灵活性。虽然许多研究集中在改进语言条件策略的动作预测上，但对任务描述的推理却鲜有关注。含糊的任务描述往往会导致下游策略因机器人代理的误解而失败。为了解决这一挑战，我们提出了AmbResVLM，这是一种新方法，将语言目标与观察到的场景联系起来，并明确地推理任务的含糊性。我们在模拟和实际场景中广泛评估了其有效性，展示了其在检测和解决任务含糊性方面优于最近的先进baseline方法的能力。最后，真实的机器人实验表明，我们的模型提高了下游机器人策略的性能，平均成功率从69.6%提高到97.1%。我们将在以下链接公开数据、代码和训练模型：this https URL。', 'title_zh': '基于自然语言交互的机器人任务歧义解决'}
{'arxiv_id': 'arXiv:2504.17693', 'title': 'BIM-Constrained Optimization for Accurate Localization and Deviation Correction in Construction Monitoring', 'authors': 'Asier Bikandi, Muhammad Shaheer, Hriday Bavle, Jayan Jevanesan, Holger Voos, Jose Luis Sanchez-Lopez', 'link': 'https://arxiv.org/abs/2504.17693', 'abstract': 'Augmented reality (AR) applications for construction monitoring rely on real-time environmental tracking to visualize architectural elements. However, construction sites present significant challenges for traditional tracking methods due to featureless surfaces, dynamic changes, and drift accumulation, leading to misalignment between digital models and the physical world. This paper proposes a BIM-aware drift correction method to address these challenges. Instead of relying solely on SLAM-based localization, we align ``as-built" detected planes from the real-world environment with ``as-planned" architectural planes in BIM. Our method performs robust plane matching and computes a transformation (TF) between SLAM (S) and BIM (B) origin frames using optimization techniques, minimizing drift over time. By incorporating BIM as prior structural knowledge, we can achieve improved long-term localization and enhanced AR visualization accuracy in noisy construction environments. The method is evaluated through real-world experiments, showing significant reductions in drift-induced errors and optimized alignment consistency. On average, our system achieves a reduction of 52.24% in angular deviations and a reduction of 60.8% in the distance error of the matched walls compared to the initial manual alignment by the user.', 'abstract_zh': '基于BIM的增强现实施工监测中的偏移校正方法', 'title_zh': '基于BIM的优化方法以实现施工监控中的精准定位与偏差修正'}
{'arxiv_id': 'arXiv:2504.17647', 'title': 'Unifying Complementarity Constraints and Control Barrier Functions for Safe Whole-Body Robot Control', 'authors': 'Rafael I. Cabral Muchacho, Riddhiman Laha, Florian T. Pokorny, Luis F.C. Figueredo, Nilanjan Chakraborty', 'link': 'https://arxiv.org/abs/2504.17647', 'abstract': 'Safety-critical whole-body robot control demands reactive methods that ensure collision avoidance in real-time. Complementarity constraints and control barrier functions (CBF) have emerged as core tools for ensuring such safety constraints, and each represents a well-developed field. Despite addressing similar problems, their connection remains largely unexplored. This paper bridges this gap by formally proving the equivalence between these two methodologies for sampled-data, first-order systems, considering both single and multiple constraint scenarios. By demonstrating this equivalence, we provide a unified perspective on these techniques. This unification has theoretical and practical implications, facilitating the cross-application of robustness guarantees and algorithmic improvements between complementarity and CBF frameworks. We discuss these synergistic benefits and motivate future work in the comparison of the methods in more general cases.', 'abstract_zh': '安全关键的全身机器人控制需要实时确保碰撞避免的反应性方法。补余约束和控制障碍函数（CBF）已成为确保此类安全约束的核心工具，每种方法都已得到了充分的发展。尽管它们解决类似的问题，但它们之间的联系仍主要未被探索。本文通过正式证明这两大方法在采样数据、一阶系统中的等价性（考虑单个和多个约束场景）来填补这一空白。通过展示这种等价性，我们提供了这些技术的统一视角。这种统一具有理论和实际意义，促进了补余和CBF框架之间稳健性保证和算法改进的交叉应用。我们讨论了这些协同性优势，并为在更一般情况下比较这些方法的未来工作提供了动机。', 'title_zh': '统一互补约束与控制屏障函数以实现全身机器人安全控制'}
{'arxiv_id': 'arXiv:2504.17569', 'title': 'Flying through cluttered and dynamic environments with LiDAR', 'authors': 'Huajie Wu, Wenyi Liu, Yunfan Ren, Zheng Liu, Hairuo Wei, Fangcheng Zhu, Haotian Li, Fu Zhang', 'link': 'https://arxiv.org/abs/2504.17569', 'abstract': 'Navigating unmanned aerial vehicles (UAVs) through cluttered and dynamic environments remains a significant challenge, particularly when dealing with fast-moving or sudden-appearing obstacles. This paper introduces a complete LiDAR-based system designed to enable UAVs to avoid various moving obstacles in complex environments. Benefiting the high computational efficiency of perception and planning, the system can operate in real time using onboard computing resources with low latency. For dynamic environment perception, we have integrated our previous work, M-detector, into the system. M-detector ensures that moving objects of different sizes, colors, and types are reliably detected. For dynamic environment planning, we incorporate dynamic object predictions into the integrated planning and control (IPC) framework, namely DynIPC. This integration allows the UAV to utilize predictions about dynamic obstacles to effectively evade them. We validate our proposed system through both simulations and real-world experiments. In simulation tests, our system outperforms state-of-the-art baselines across several metrics, including success rate, time consumption, average flight time, and maximum velocity. In real-world trials, our system successfully navigates through forests, avoiding moving obstacles along its path.', 'abstract_zh': '基于LiDAR的无人机在复杂动态环境中规避移动障碍物的全程系统：M-detector集成与DynIPC框架应用', 'title_zh': '在杂乱和动态环境中利用LiDAR飞行'}
{'arxiv_id': 'arXiv:2504.17424', 'title': 'Object Pose Estimation by Camera Arm Control Based on the Next Viewpoint Estimation', 'authors': 'Tomoki Mizuno, Kazuya Yabashi, Tsuyoshi Tasaki', 'link': 'https://arxiv.org/abs/2504.17424', 'abstract': 'We have developed a new method to estimate a Next Viewpoint (NV) which is effective for pose estimation of simple-shaped products for product display robots in retail stores. Pose estimation methods using Neural Networks (NN) based on an RGBD camera are highly accurate, but their accuracy significantly decreases when the camera acquires few texture and shape features at a current view point. However, it is difficult for previous mathematical model-based methods to estimate effective NV which is because the simple shaped objects have few shape features. Therefore, we focus on the relationship between the pose estimation and NV estimation. When the pose estimation is more accurate, the NV estimation is more accurate. Therefore, we develop a new pose estimation NN that estimates NV simultaneously. Experimental results showed that our NV estimation realized a pose estimation success rate 77.3\\%, which was 7.4pt higher than the mathematical model-based NV calculation did. Moreover, we verified that the robot using our method displayed 84.2\\% of products.', 'abstract_zh': '我们开发了一种新的方法来估计下一个视点(NV)，该方法适用于零售商店中简单造型产品展示机器人姿态估计。基于RGBD摄像机的神经网络(NN)姿态估计算法具有很高的准确性，但在当前视点摄像机获取少量纹理和形状特征时，其准确性会显著下降。然而，基于数学模型的方法难以估计有效的NV，原因是简单造型对象的形状特征较少。因此，我们将注意力集中在姿态估计与NV估计之间的关系上。当姿态估计更准确时，NV估计也会更准确。因此，我们开发了一种同时估计NV的新型姿态估计算法。实验结果显示，我们的NV估计实现了77.3%的姿态估计成功率，比基于数学模型的NV计算高出7.4个百分点。此外，我们验证了使用该方法的机器人展示了84.2%的产品。', 'title_zh': '基于下一视角估计的摄像臂控制物体姿态估计'}
{'arxiv_id': 'arXiv:2504.17410', 'title': 'Bias-Eliminated PnP for Stereo Visual Odometry: Provably Consistent and Large-Scale Localization', 'authors': 'Guangyang Zeng, Yuan Shen, Ziyang Hong, Yuze Hong, Viorela Ila, Guodong Shi, Junfeng Wu', 'link': 'https://arxiv.org/abs/2504.17410', 'abstract': 'In this paper, we first present a bias-eliminated weighted (Bias-Eli-W) perspective-n-point (PnP) estimator for stereo visual odometry (VO) with provable consistency. Specifically, leveraging statistical theory, we develop an asymptotically unbiased and $\\sqrt {n}$-consistent PnP estimator that accounts for varying 3D triangulation uncertainties, ensuring that the relative pose estimate converges to the ground truth as the number of features increases. Next, on the stereo VO pipeline side, we propose a framework that continuously triangulates contemporary features for tracking new frames, effectively decoupling temporal dependencies between pose and 3D point errors. We integrate the Bias-Eli-W PnP estimator into the proposed stereo VO pipeline, creating a synergistic effect that enhances the suppression of pose estimation errors. We validate the performance of our method on the KITTI and Oxford RobotCar datasets. Experimental results demonstrate that our method: 1) achieves significant improvements in both relative pose error and absolute trajectory error in large-scale environments; 2) provides reliable localization under erratic and unpredictable robot motions. The successful implementation of the Bias-Eli-W PnP in stereo VO indicates the importance of information screening in robotic estimation tasks with high-uncertainty measurements, shedding light on diverse applications where PnP is a key ingredient.', 'abstract_zh': '基于偏差消除加权（Bias-Eli-W）视角-n点（PnP）估计算法的Stereo视觉里程计（VO）及其一致性分析', 'title_zh': '偏置消除的PnP stereo视觉定位：可证明一致且大规模定位'}
{'arxiv_id': 'arXiv:2504.17249', 'title': 'Demonstrating Berkeley Humanoid Lite: An Open-source, Accessible, and Customizable 3D-printed Humanoid Robot', 'authors': 'Yufeng Chi, Qiayuan Liao, Junfeng Long, Xiaoyu Huang, Sophia Shao, Borivoje Nikolic, Zhongyu Li, Koushil Sreenath', 'link': 'https://arxiv.org/abs/2504.17249', 'abstract': "Despite significant interest and advancements in humanoid robotics, most existing commercially available hardware remains high-cost, closed-source, and non-transparent within the robotics community. This lack of accessibility and customization hinders the growth of the field and the broader development of humanoid technologies. To address these challenges and promote democratization in humanoid robotics, we demonstrate Berkeley Humanoid Lite, an open-source humanoid robot designed to be accessible, customizable, and beneficial for the entire community. The core of this design is a modular 3D-printed gearbox for the actuators and robot body. All components can be sourced from widely available e-commerce platforms and fabricated using standard desktop 3D printers, keeping the total hardware cost under $5,000 (based on U.S. market prices). The design emphasizes modularity and ease of fabrication. To address the inherent limitations of 3D-printed gearboxes, such as reduced strength and durability compared to metal alternatives, we adopted a cycloidal gear design, which provides an optimal form factor in this context. Extensive testing was conducted on the 3D-printed actuators to validate their durability and alleviate concerns about the reliability of plastic components. To demonstrate the capabilities of Berkeley Humanoid Lite, we conducted a series of experiments, including the development of a locomotion controller using reinforcement learning. These experiments successfully showcased zero-shot policy transfer from simulation to hardware, highlighting the platform's suitability for research validation. By fully open-sourcing the hardware design, embedded code, and training and deployment frameworks, we aim for Berkeley Humanoid Lite to serve as a pivotal step toward democratizing the development of humanoid robotics. All resources are available at this https URL.", 'abstract_zh': '尽管对类人机器人研究有着显著的兴趣和进展，但大多数现有的商用硬件仍然价格高昂、闭源且在机器人社区中不够透明。这种缺乏可访问性和可定制性的状况阻碍了该领域的增长以及类人技术的更广泛发展。为应对这些挑战并促进类人机器人领域的民主化，我们展示了伯克利类人机器人Lite（Berkeley Humanoid Lite），这是一个开源的类人机器人，旨在提高可访问性、可定制性并惠及整个社区。该设计的核心是模块化的3D打印齿轮箱和机器人主体。所有组件均可从广泛可用的电子商务平台获取，并可以使用标准的桌面3D打印机进行制造，从而使整体硬件成本保持在5000美元以下（基于美国市场价格）。该设计强调模块化和易于制造。为解决3D打印齿轮箱固有的局限性，例如与金属替代品相比的强度和耐用性较低的问题，我们采用了玉轮齿轮设计，这在这一背景下提供了最优的结构形式。对3D打印执行器进行了广泛的测试，以验证其耐用性并缓解对塑料组件可靠性的担忧。为了展示伯克利类人机器人Lite的能力，我们进行了一系列实验，包括使用强化学习开发步行控制器。这些实验成功展示了从模拟到硬件的零样本策略转移，突显了该平台在研究验证方面的适用性。通过全面开源硬件设计、嵌入式代码以及训练和部署框架，我们旨在使伯克利类人机器人Lite成为通向类人机器人领域民主化的关键一步。所有资源可在以下链接获取。', 'title_zh': '展示伯克利 humanoID lite：一个开源、易获取且可定制的3D打印人形机器人'}
{'arxiv_id': 'arXiv:2504.17216', 'title': 'Robotic Grinding Skills Learning Based on Geodesic Length Dynamic Motion Primitives', 'authors': 'Shuai Ke, Huan Zhao, Xiangfei Li, Zhiao Wei, Yecan Yin, Han Ding', 'link': 'https://arxiv.org/abs/2504.17216', 'abstract': 'Learning grinding skills from human craftsmen via imitation learning has become a key research topic in robotic machining. Due to their strong generalization and robustness to external disturbances, Dynamical Movement Primitives (DMPs) offer a promising approach for robotic grinding skill learning. However, directly applying DMPs to grinding tasks faces challenges, such as low orientation accuracy, unsynchronized position-orientation-force, and limited generalization for surface trajectories. To address these issues, this paper proposes a robotic grinding skill learning method based on geodesic length DMPs (Geo-DMPs). First, a normalized 2D weighted Gaussian kernel and intrinsic mean clustering algorithm are developed to extract geometric features from multiple demonstrations. Then, an orientation manifold distance metric removes the time dependency in traditional orientation DMPs, enabling accurate orientation learning via Geo-DMPs. A synchronization encoding framework is further proposed to jointly model position, orientation, and force using a geodesic length-based phase function. This framework enables robotic grinding actions to be generated between any two surface points. Experiments on robotic chamfer grinding and free-form surface grinding validate that the proposed method achieves high geometric accuracy and generalization in skill encoding and generation. To our knowledge, this is the first attempt to use DMPs for jointly learning and generating grinding skills in position, orientation, and force on model-free surfaces, offering a novel path for robotic grinding.', 'abstract_zh': '基于测地长度DMPs的机器人磨削技能学习方法', 'title_zh': '基于测地长度动态运动元的机器人磨削技能学习'}
{'arxiv_id': 'arXiv:2504.17201', 'title': 'Simultaneous Collision Detection and Force Estimation for Dynamic Quadrupedal Locomotion', 'authors': 'Ziyi Zhou, Stefano Di Cairano, Yebin Wang, Karl Berntorp', 'link': 'https://arxiv.org/abs/2504.17201', 'abstract': "In this paper we address the simultaneous collision detection and force estimation problem for quadrupedal locomotion using joint encoder information and the robot dynamics only. We design an interacting multiple-model Kalman filter (IMM-KF) that estimates the external force exerted on the robot and multiple possible contact modes. The method is invariant to any gait pattern design. Our approach leverages pseudo-measurement information of the external forces based on the robot dynamics and encoder information. Based on the estimated contact mode and external force, we design a reflex motion and an admittance controller for the swing leg to avoid collisions by adjusting the leg's reference motion. Additionally, we implement a force-adaptive model predictive controller to enhance balancing. Simulation ablatation studies and experiments show the efficacy of the approach.", 'abstract_zh': '基于关节编码器信息和机器人动力学的腿足机器人碰撞检测与力估计方法', 'title_zh': '动态四腿行进中同时碰撞检测与力估计'}
{'arxiv_id': 'arXiv:2504.17186', 'title': 'MAT-DiSMech: A Discrete Differential Geometry-based Computational Tool for Simulation of Rods, Shells, and Soft Robots', 'authors': 'Radha Lahoti, M. Khalid Jawed', 'link': 'https://arxiv.org/abs/2504.17186', 'abstract': 'Accurate and efficient simulation tools are essential in robotics, enabling the visualization of system dynamics and the validation of control laws before committing resources to physical experimentation. Developing physically accurate simulation tools is particularly challenging in soft robotics, largely due to the prevalence of geometrically nonlinear deformation. A variety of robot simulators tackle this challenge by using simplified modeling techniques -- such as lumped mass models -- which lead to physical inaccuracies in real-world applications. On the other hand, high-fidelity simulation methods for soft structures, like finite element analysis, offer increased accuracy but lead to higher computational costs. In light of this, we present a Discrete Differential Geometry-based simulator that provides a balance between physical accuracy and computational speed. Building on an extensive body of research on rod and shell-based representations of soft robots, our tool provides a pathway to accurately model soft robots in a computationally tractable manner. Our open-source MATLAB-based framework is capable of simulating the deformations of rods, shells, and their combinations, primarily utilizing implicit integration techniques. The software design is modular for the user to customize the code, for example, add new external forces and impose custom boundary conditions. The implementations for prevalent forces encountered in robotics, including gravity, contact, kinetic and viscous friction, and aerodynamic drag, have been provided. We provide several illustrative examples that showcase the capabilities and validate the physical accuracy of the simulator. The open-source code is available at this https URL. We anticipate that the proposed simulator can serve as an effective digital twin tool, enhancing the Sim2Real pathway in soft robotics research.', 'abstract_zh': '基于离散微分几何的高效准确软机器人模拟器', 'title_zh': 'MAT-DiSMech: 基于离散微分几何的杆状结构、壳体和软机器人模拟计算工具'}
{'arxiv_id': 'arXiv:2504.17103', 'title': 'Subframework-based Bearing Rigidity Maintenance Control in Multirobot Networks', 'authors': 'J. Francisco Presenza, Ignacio Mas, J. Ignacio Alvarez-Hamelin, Juan I. Giribet', 'link': 'https://arxiv.org/abs/2504.17103', 'abstract': "This work presents a novel approach for analyzing and controlling bearing rigidity in multi-robot networks with dynamic topology. By decomposing the system's framework into subframeworks, we express bearing rigidity, a global property, as a set of local properties, with rigidity eigenvalues serving as natural local rigidity metrics. We propose a decentralized, scalable, gradient-based controller that uses only bearing measurements to execute mission-specific commands. The controller preserves bearing rigidity by maintaining rigidity eigenvalues above a threshold, and also avoids inter-robot collisions. Simulations confirm the scheme's effectiveness, with information exchange confined to subframeworks, underscoring its scalability and practicality.", 'abstract_zh': '本工作提出了一种用于分析和控制具有动态拓扑的多机器人网络中轴承刚性的新颖方法。通过将系统的框架分解为子框架，我们将作为全局属性的轴承刚性表达为一组本地属性，使用刚性特征值作为自然的本地刚性度量。我们提出了一种仅使用轴承测量值的去中心化、可扩展、梯度基于的控制器，用于执行特定任务的指令。该控制器通过保持刚性特征值高于阈值来保存轴承刚性，并避免机器人之间的碰撞。仿真结果证实了该方案的有效性，信息交换仅限于子框架，突显了其可扩展性和实用性。', 'title_zh': '基于子框架的轴承刚性维持控制在多机器人网络中'}
{'arxiv_id': 'arXiv:2504.17080', 'title': 'Geometric Formulation of Unified Force-Impedance Control on SE(3) for Robotic Manipulators', 'authors': 'Joohwan Seo, Nikhil Potu Surya Prakash, Soomi Lee, Arvind Kruthiventy, Megan Teng, Jongeun Choi, Roberto Horowitz', 'link': 'https://arxiv.org/abs/2504.17080', 'abstract': "In this paper, we present an impedance control framework on the SE(3) manifold, which enables force tracking while guaranteeing passivity. Building upon the unified force-impedance control (UFIC) and our previous work on geometric impedance control (GIC), we develop the geometric unified force impedance control (GUFIC) to account for the SE(3) manifold structure in the controller formulation using a differential geometric perspective. As in the case of the UFIC, the GUFIC utilizes energy tank augmentation for both force-tracking and impedance control to guarantee the manipulator's passivity relative to external forces. This ensures that the end effector maintains safe contact interaction with uncertain environments and tracks a desired interaction force. Moreover, we resolve a non-causal implementation problem in the UFIC formulation by introducing velocity and force fields. Due to its formulation on SE(3), the proposed GUFIC inherits the desirable SE(3) invariance and equivariance properties of the GIC, which helps increase sample efficiency in machine learning applications where a learning algorithm is incorporated into the control law. The proposed control law is validated in a simulation environment under scenarios requiring tracking an SE(3) trajectory, incorporating both position and orientation, while exerting a force on a surface. The codes are available at this https URL.", 'abstract_zh': '基于SE(3)流形的几何统一力阻抗控制框架：力跟踪与持久性保证', 'title_zh': 'SE(3)中统一力-阻抗控制的几何表述及其在机器人 manipulator 中的应用'}
{'arxiv_id': 'arXiv:2504.17070', 'title': 'Robo-Troj: Attacking LLM-based Task Planners', 'authors': 'Mohaiminul Al Nahian, Zainab Altaweel, David Reitano, Sabbir Ahmed, Saumitra Lohokare, Shiqi Zhang, Adnan Siraj Rakin', 'link': 'https://arxiv.org/abs/2504.17070', 'abstract': 'Robots need task planning methods to achieve goals that require more than individual actions. Recently, large language models (LLMs) have demonstrated impressive performance in task planning. LLMs can generate a step-by-step solution using a description of actions and the goal. Despite the successes in LLM-based task planning, there is limited research studying the security aspects of those systems. In this paper, we develop Robo-Troj, the first multi-trigger backdoor attack for LLM-based task planners, which is the main contribution of this work. As a multi-trigger attack, Robo-Troj is trained to accommodate the diversity of robot application domains. For instance, one can use unique trigger words, e.g., "herical", to activate a specific malicious behavior, e.g., cutting hand on a kitchen robot. In addition, we develop an optimization method for selecting the trigger words that are most effective. Through demonstrating the vulnerability of LLM-based planners, we aim to promote the development of secured robot systems.', 'abstract_zh': '基于LLM的任务规划中的Robo-Troj多触发器后门攻击及安全性研究', 'title_zh': 'Robo-Troj: 攻击基于LLM的任务规划器'}
{'arxiv_id': 'arXiv:2504.17791', 'title': 'LiDPM: Rethinking Point Diffusion for Lidar Scene Completion', 'authors': 'Tetiana Martyniuk, Gilles Puy, Alexandre Boulch, Renaud Marlet, Raoul de Charette', 'link': 'https://arxiv.org/abs/2504.17791', 'abstract': 'Training diffusion models that work directly on lidar points at the scale of outdoor scenes is challenging due to the difficulty of generating fine-grained details from white noise over a broad field of view. The latest works addressing scene completion with diffusion models tackle this problem by reformulating the original DDPM as a local diffusion process. It contrasts with the common practice of operating at the level of objects, where vanilla DDPMs are currently used. In this work, we close the gap between these two lines of work. We identify approximations in the local diffusion formulation, show that they are not required to operate at the scene level, and that a vanilla DDPM with a well-chosen starting point is enough for completion. Finally, we demonstrate that our method, LiDPM, leads to better results in scene completion on SemanticKITTI. The project page is this https URL .', 'abstract_zh': '在大规模户外场景中直接对LIDAR点进行训练的扩散模型面临着因广域视角下从白噪声生成细粒度细节的困难。通过将原有的DDPM重新构造成局部扩散过程来解决场景完成问题的最新研究与此处常用的以对象为操作级别的方法相对立。本文通过识别局部扩散形式中的近似，展示这些近似在场景级别上并非必要，并且适当的起始点下的标准DDPM足以完成任务。最后，我们证明我们的方法LiDPM在SemanticKITTI的场景完成任务中取得了更好的结果。项目页面详见此链接：https://github.com/alibaba/CaDiL。', 'title_zh': 'LiDPM: 重新思考激光雷达场景完成中的点扩散过程'}
{'arxiv_id': 'arXiv:2504.17418', 'title': 'Longitudinal Control for Autonomous Racing with Combustion Engine Vehicles', 'authors': 'Phillip Pitschi, Simon Sagmeister, Sven Goblirsch, Markus Lienkamp, Boris Lohmann', 'link': 'https://arxiv.org/abs/2504.17418', 'abstract': 'Usually, a controller for path- or trajectory tracking is employed in autonomous driving. Typically, these controllers generate high-level commands like longitudinal acceleration or force. However, vehicles with combustion engines expect different actuation inputs. This paper proposes a longitudinal control concept that translates high-level trajectory-tracking commands to the required low-level vehicle commands such as throttle, brake pressure and a desired gear. We chose a modular structure to easily integrate different trajectory-tracking control algorithms and vehicles. The proposed control concept enables a close tracking of the high-level control command. An anti-lock braking system, traction control, and brake warmup control also ensure a safe operation during real-world tests. We provide experimental validation of our concept using real world data with longitudinal accelerations reaching up to $25 \\, \\frac{\\mathrm{m}}{\\mathrm{s}^2}$. The experiments were conducted using the EAV24 racecar during the first event of the Abu Dhabi Autonomous Racing League on the Yas Marina Formula 1 Circuit.', 'abstract_zh': '一种将高阶轨迹跟踪命令转化为低阶车辆控制命令的纵向控制概念：以实际数据验证在真实世界测试中的安全操作', 'title_zh': '内燃机车辆的纵向控制在自主赛车中的应用'}
{'arxiv_id': 'arXiv:2504.17399', 'title': 'S2S-Net: Addressing the Domain Gap of Heterogeneous Sensor Systems in LiDAR-Based Collective Perception', 'authors': 'Sven Teufel, Jörg Gamerdinger, Oliver Bringmann', 'link': 'https://arxiv.org/abs/2504.17399', 'abstract': 'Collective Perception (CP) has emerged as a promising approach to overcome the limitations of individual perception in the context of autonomous driving. Various approaches have been proposed to realize collective perception; however, the Sensor2Sensor domain gap that arises from the utilization of different sensor systems in Connected and Automated Vehicles (CAVs) remains mostly unaddressed. This is primarily due to the paucity of datasets containing heterogeneous sensor setups among the CAVs. The recently released SCOPE datasets address this issue by providing data from three different LiDAR sensors for each CAV. This study is the first to tackle the Sensor2Sensor domain gap in vehicle to vehicle (V2V) collective perception. First, we present our sensor-domain robust architecture S2S-Net. Then an in-depth analysis of the Sensor2Sensor domain adaptation capabilities of S2S-Net on the SCOPE dataset is conducted. S2S-Net demonstrates the capability to maintain very high performance in unseen sensor domains and achieved state-of-the-art results on the SCOPE dataset.', 'abstract_zh': '集体感知（CP）已成为克服自主驾驶中个体感知限制的一种有前途的方法。各种方法已被提出以实现集体感知；然而，由于连接和自动车辆（CAVs）中使用不同传感系统而产生的Sensor2Sensor领域差距仍然主要未被解决。这主要是由于CAVs中异构传感系统数据集的稀缺性。最近发布的SCOPE数据集通过为每辆CAV提供来自三种不同LiDAR传感器的数据来解决这一问题。本研究是首次尝试解决车辆到车辆（V2V）集体感知中的Sensor2Sensor领域差距。首先，我们提出了一种传感器领域鲁棒架构S2S-Net。然后，我们对S2S-Net在SCOPE数据集上的Sensor2Sensor领域适应能力进行了深入分析。S2S-Net展示了在未见过的传感器领域保持非常高性能的能力，并在SCOPE数据集上取得了最先进的结果。', 'title_zh': 'S2S-Net: 解决基于LiDAR的集体感知中异构传感器系统领域差距问题'}
{'arxiv_id': 'arXiv:2504.17179', 'title': 'AUTHENTICATION: Identifying Rare Failure Modes in Autonomous Vehicle Perception Systems using Adversarially Guided Diffusion Models', 'authors': 'Mohammad Zarei, Melanie A Jutras, Eliana Evans, Mike Tan, Omid Aaramoon', 'link': 'https://arxiv.org/abs/2504.17179', 'abstract': 'Autonomous Vehicles (AVs) rely on artificial intelligence (AI) to accurately detect objects and interpret their surroundings. However, even when trained using millions of miles of real-world data, AVs are often unable to detect rare failure modes (RFMs). The problem of RFMs is commonly referred to as the "long-tail challenge", due to the distribution of data including many instances that are very rarely seen. In this paper, we present a novel approach that utilizes advanced generative and explainable AI techniques to aid in understanding RFMs. Our methods can be used to enhance the robustness and reliability of AVs when combined with both downstream model training and testing. We extract segmentation masks for objects of interest (e.g., cars) and invert them to create environmental masks. These masks, combined with carefully crafted text prompts, are fed into a custom diffusion model. We leverage the Stable Diffusion inpainting model guided by adversarial noise optimization to generate images containing diverse environments designed to evade object detection models and expose vulnerabilities in AI systems. Finally, we produce natural language descriptions of the generated RFMs that can guide developers and policymakers to improve the safety and reliability of AV systems.', 'abstract_zh': '自主驾驶车辆（AVs）依赖人工智能（AI）准确检测物体并解释其周围环境。然而，即使使用数百万英里的实际数据进行训练，AVs 也常常无法检测到罕见故障模式（RFMs）。RFMs 的问题通常被称为“长尾挑战”，因为数据分布中包含许多非常罕见的情况。在本文中，我们提出了一种新颖的方法，利用先进的生成性和可解释性AI技术以辅助理解RFMs。我们的方法可以结合下游模型训练和测试使用，以增强AVs的 robustness 和可靠性。我们提取目标物体（例如汽车）的分割掩码，并将其反转以生成环境掩码。这些掩码与精心设计的文本提示结合后，输入自定义的扩散模型。我们利用受对抗噪声优化指导的稳定扩散修复模型生成包含多样环境的图像，这些环境旨在避开物体检测模型并暴露AI系统的漏洞。最后，我们生成自然语言描述的RFMs，以指导开发者和政策制定者改进AV系统的安全性和可靠性。', 'title_zh': '身份验证：使用 adversarially 引导的扩散模型识别自主车辆感知系统中的罕见故障模式'}
{'arxiv_id': 'arXiv:2504.17154', 'title': 'Advancing Frontiers of Path Integral Theory for Stochastic Optimal Control', 'authors': 'Apurva Patil', 'link': 'https://arxiv.org/abs/2504.17154', 'abstract': 'Stochastic Optimal Control (SOC) problems arise in systems influenced by uncertainty, such as autonomous robots or financial models. Traditional methods like dynamic programming are often intractable for high-dimensional, nonlinear systems due to the curse of dimensionality. This dissertation explores the path integral control framework as a scalable, sampling-based alternative. By reformulating SOC problems as expectations over stochastic trajectories, it enables efficient policy synthesis via Monte Carlo sampling and supports real-time implementation through GPU parallelization.\nWe apply this framework to six classes of SOC problems: Chance-Constrained SOC, Stochastic Differential Games, Deceptive Control, Task Hierarchical Control, Risk Mitigation of Stealthy Attacks, and Discrete-Time LQR. A sample complexity analysis for the discrete-time case is also provided. These contributions establish a foundation for simulator-driven autonomy in complex, uncertain environments.', 'abstract_zh': '随机最优控制问题(SOC)出现在受不确定性影响的系统中，如自主机器人或财务模型。传统方法如动态规划通常由于维度灾对于高维非线性系统不可行。本论文探讨了路径积分控制框架作为可扩展的、基于采样的替代方案。通过将SOC问题重新表述为随机轨迹的期望，它能够通过蒙特卡洛采样高效地合成策略，并通过GPU并行化支持实时实现。', 'title_zh': '前沿路径积分理论在随机最优控制中的进展'}
{'arxiv_id': 'arXiv:2504.17129', 'title': 'Peer-Aware Cost Estimation in Nonlinear General-Sum Dynamic Games for Mutual Learning and Intent Inference', 'authors': 'Seyed Yousef Soltanian, Wenlong Zhang', 'link': 'https://arxiv.org/abs/2504.17129', 'abstract': "Human-robot interactions can be modeled as incomplete-information general-sum dynamic games since the objective functions of both agents are not explicitly known to each other. However, solving for equilibrium policies for such games presents a major challenge, especially if the games involve nonlinear underlying dynamics. To simplify the problem, existing work often assumes that one agent is an expert with complete information about its peer, which can lead to biased estimates and failures in coordination. To address this challenge, we propose a nonlinear peer-aware cost estimation (N-PACE) algorithm for general-sum dynamic games. In N-PACE, using iterative linear quadratic (LQ) approximation of the nonlinear general-sum game, each agent explicitly models the learning dynamics of its peer agent while inferring their objective functions, leading to unbiased fast learning in inferring the unknown objective function of the peer agent, which is critical for task completion and safety assurance. Additionally, we demonstrate how N-PACE enables \\textbf{intent communication} in such multi-agent systems by explicitly modeling the peer's learning dynamics.", 'abstract_zh': '人类与机器人交互可以建模为不完全信息广义和动态博弈，因为两个代理的目标函数彼此并不明确知晓。然而，解决这类博弈中的均衡策略尤其对于涉及非线性基础动力学的博弈来说是一个重大挑战。为了简化问题，现有工作通常假设一个代理是专家并完全了解其同伴的信息，这可能导致偏差估计和协调失败。为了解决这一挑战，我们提出了一种非线性同伴意识成本估计（N-PACE）算法，用于广义和动态博弈。在N-PACE中，通过迭代线性二次（LQ）逼近非线性广义和博弈，每个代理明确建模其同伴代理的学习动态，在推断同伴代理的目标函数过程中实现无偏的快速学习，这对于任务完成和安全保证至关重要。此外，我们展示了N-PACE如何通过明确建模同伴的学习动态来促进such multi-agent系统的意图通信。', 'title_zh': '基于互学和意图推理的非线性广义和动态博弈中的同伴感知成本估计'}
{'arxiv_id': 'arXiv:2504.17006', 'title': 'A Systematic Approach to Design Real-World Human-in-the-Loop Deep Reinforcement Learning: Salient Features, Challenges and Trade-offs', 'authors': 'Jalal Arabneydi, Saiful Islam, Srijita Das, Sai Krishna Gottipati, William Duguay, Cloderic Mars, Matthew E. Taylor, Matthew Guzdial, Antoine Fagette, Younes Zerouali', 'link': 'https://arxiv.org/abs/2504.17006', 'abstract': 'With the growing popularity of deep reinforcement learning (DRL), human-in-the-loop (HITL) approach has the potential to revolutionize the way we approach decision-making problems and create new opportunities for human-AI collaboration. In this article, we introduce a novel multi-layered hierarchical HITL DRL algorithm that comprises three types of learning: self learning, imitation learning and transfer learning. In addition, we consider three forms of human inputs: reward, action and demonstration. Furthermore, we discuss main challenges, trade-offs and advantages of HITL in solving complex problems and how human information can be integrated in the AI solution systematically. To verify our technical results, we present a real-world unmanned aerial vehicles (UAV) problem wherein a number of enemy drones attack a restricted area. The objective is to design a scalable HITL DRL algorithm for ally drones to neutralize the enemy drones before they reach the area. To this end, we first implement our solution using an award-winning open-source HITL software called Cogment. We then demonstrate several interesting results such as (a) HITL leads to faster training and higher performance, (b) advice acts as a guiding direction for gradient methods and lowers variance, and (c) the amount of advice should neither be too large nor too small to avoid over-training and under-training. Finally, we illustrate the role of human-AI cooperation in solving two real-world complex scenarios, i.e., overloaded and decoy attacks.', 'abstract_zh': '基于人类在环的深度强化学习多层层级算法及应用：解决复杂问题的挑战、权衡与优势', 'title_zh': '一种系统性的人机闭环深度强化学习设计方法：显著特征、挑战与权衡'}
