{'arxiv_id': 'arXiv:2511.14756', 'title': 'HMC: Learning Heterogeneous Meta-Control for Contact-Rich Loco-Manipulation', 'authors': 'Lai Wei, Xuanbin Peng, Ri-Zhao Qiu, Tianshu Huang, Xuxin Cheng, Xiaolong Wang', 'link': 'https://arxiv.org/abs/2511.14756', 'abstract': 'Learning from real-world robot demonstrations holds promise for interacting with complex real-world environments. However, the complexity and variability of interaction dynamics often cause purely positional controllers to struggle with contacts or varying payloads. To address this, we propose a Heterogeneous Meta-Control (HMC) framework for Loco-Manipulation that adaptively stitches multiple control modalities: position, impedance, and hybrid force-position. We first introduce an interface, HMC-Controller, for blending actions from different control profiles continuously in the torque space. HMC-Controller facilitates both teleoperation and policy deployment. Then, to learn a robust force-aware policy, we propose HMC-Policy to unify different controllers into a heterogeneous architecture. We adopt a mixture-of-experts style routing to learn from large-scale position-only data and fine-grained force-aware demonstrations. Experiments on a real humanoid robot show over 50% relative improvement vs. baselines on challenging tasks such as compliant table wiping and drawer opening, demonstrating the efficacy of HMC.', 'abstract_zh': '基于真实世界机器人演示的学习为复杂现实环境交互提供了可能性。然而，交互动力学的复杂性和变异性往往导致仅位置控制在处理接触或变化负载时遇到困难。为解决这一问题，我们提出了一种异构元控制（HMC）框架，用于适应性地拼接多种控制模态：位置控制、阻抗控制以及混合力-位置控制。首先，我们引入了一个接口HMC-Controller，用于在扭矩空间中连续融合不同控制配置文件的动作。HMC-Controller 既支持远程操作又促进策略部署。然后，为了学习鲁棒的力感知策略，我们提出HMC-Policy来将不同控制器统一到一个异构架构中。我们采用专家混合风格的路由来从大规模仅位置数据和细粒度的力感知演示中进行学习。实验证实在诸如顺应性餐桌擦洗和抽屉开启等挑战性任务中，HMC相对于基线方法获得了超过50%的相对改进，证明了HMC的有效性。', 'title_zh': 'HMC：学习异质元控制以应对丰富接触的 locomo-manipulation'}
{'arxiv_id': 'arXiv:2511.14755', 'title': 'Robust Verification of Controllers under State Uncertainty via Hamilton-Jacobi Reachability Analysis', 'authors': 'Albert Lin, Alessandro Pinto, Somil Bansal', 'link': 'https://arxiv.org/abs/2511.14755', 'abstract': 'As perception-based controllers for autonomous systems become increasingly popular in the real world, it is important that we can formally verify their safety and performance despite perceptual uncertainty. Unfortunately, the verification of such systems remains challenging, largely due to the complexity of the controllers, which are often nonlinear, nonconvex, learning-based, and/or black-box. Prior works propose verification algorithms that are based on approximate reachability methods, but they often restrict the class of controllers and systems that can be handled or result in overly conservative analyses. Hamilton-Jacobi (HJ) reachability analysis is a popular formal verification tool for general nonlinear systems that can compute optimal reachable sets under worst-case system uncertainties; however, its application to perception-based systems is currently underexplored. In this work, we propose RoVer-CoRe, a framework for the Robust Verification of Controllers via HJ Reachability. To the best of our knowledge, RoVer-CoRe is the first HJ reachability-based framework for the verification of perception-based systems under perceptual uncertainty. Our key insight is to concatenate the system controller, observation function, and the state estimation modules to obtain an equivalent closed-loop system that is readily compatible with existing reachability frameworks. Within RoVer-CoRe, we propose novel methods for formal safety verification and robust controller design. We demonstrate the efficacy of the framework in case studies involving aircraft taxiing and NN-based rover navigation. Code is available at the link in the footnote.', 'abstract_zh': '基于感知的自主系统控制器的鲁棒验证框架：Hamilton-Jacobi可达性分析方法', 'title_zh': '基于哈密尔顿-雅可比可达性分析的控制器在状态不确定性下的稳健验证'}
{'arxiv_id': 'arXiv:2511.14504', 'title': 'Aerial Assistance System for Automated Firefighting during Turntable Ladder Operations', 'authors': 'Jan Quenzel, Valerij Sekin, Daniel Schleich, Alexander Miller, Merlin Stampa, Norbert Pahlke, Christof Röhrig, Sven Behnke', 'link': 'https://arxiv.org/abs/2511.14504', 'abstract': "Fires in industrial facilities pose special challenges to firefighters, e.g., due to the sheer size and scale of the buildings. The resulting visual obstructions impair firefighting accuracy, further compounded by inaccurate assessments of the fire's location. Such imprecision simultaneously increases the overall damage and prolongs the fire-brigades operation unnecessarily.\nWe propose an automated assistance system for firefighting using a motorized fire monitor on a turntable ladder with aerial support from an unmanned aerial vehicle (UAV). The UAV flies autonomously within an obstacle-free flight funnel derived from geodata, detecting and localizing heat sources. An operator supervises the operation on a handheld controller and selects a fire target in reach. After the selection, the UAV automatically plans and traverses between two triangulation poses for continued fire localization. Simultaneously, our system steers the fire monitor to ensure the water jet reaches the detected heat source. In preliminary tests, our assistance system successfully localized multiple heat sources and directed a water jet towards the fires.", 'abstract_zh': '工业设施中的火灾对消防员构成了特殊挑战，例如，由于建筑规模庞大。由此产生的视觉障碍影响了灭火的准确性，进一步由于对火灾位置的不准确评估而加剧。这种不精确同时增加了整体损失，并无谓地延长了消防队的行动时间。\n我们提出了一种利用回转梯架上的机动消防炮，并由无人驾驶航空车辆（UAV）提供空中支持的自动化辅助系统，用于灭火。UAV在地面数据衍生的无障碍飞行漏斗内自主飞行，检测并定位热源。操作员在手持控制器上监督操作，并选择可触及的火源。选定后，UAV自动规划并穿越两个三角定位姿态以继续火源定位。同时，我们的系统操控消防炮以确保水柱达到检测到的热源。初步测试中，我们的辅助系统成功地定位了多个热源，并将水柱导向火灾。', 'title_zh': '旋转云梯操作期间自动灭火的 aerial 辅助系统'}
{'arxiv_id': 'arXiv:2511.14458', 'title': 'Advancing Minimally Invasive Precision Surgery in Open Cavities with Robotic Flexible Endoscopy', 'authors': 'Michelle Mattille, Alexandre Mesot, Miriam Weisskopf, Nicole Ochsenbein-Kölble, Ueli Moehrlen, Bradley J. Nelson, Quentin Boehler', 'link': 'https://arxiv.org/abs/2511.14458', 'abstract': 'Flexible robots hold great promise for enhancing minimally invasive surgery (MIS) by providing superior dexterity, precise control, and safe tissue interaction. Yet, translating these advantages into endoscopic interventions within open cavities remains challenging. The lack of anatomical constraints and the inherent flexibility of such devices complicate their control, while the limited field of view of endoscopes restricts situational awareness. We present a robotic platform designed to overcome these challenges and demonstrate its potential in fetoscopic laser coagulation, a complex MIS procedure typically performed only by highly experienced surgeons. Our system combines a magnetically actuated flexible endoscope with teleoperated and semi-autonomous navigation capabilities for performing targeted laser ablations. To enhance surgical awareness, the platform reconstructs real-time mosaics of the endoscopic scene, providing an extended and continuous visual context. The ability of this system to address the key limitations of MIS in open spaces is validated in vivo in an ovine model.', 'abstract_zh': '柔性机器人在增强开放空腔内微创手术（MIS）中的潜力通过提供卓越的灵巧性、精确控制和安全的组织交互显示出巨大前景。然而，将这些优势转化为内窥镜干预仍然具有挑战性。缺乏解剖约束和此类设备的固有灵活性使其控制复杂化，而内窥镜的有限视野限制了情景意识。我们提出了一种机器人平台，旨在克服这些挑战，并展示了其在胎儿镜激光凝固术中的潜在应用，这是一种通常仅由经验丰富的外科医生执行的复杂MIS程序。该系统结合了磁控柔性内窥镜，并具备遥操作和半自主导航能力，用于执行目标激光消融。为增强外科手术意识，该平台实时重建内窥镜场景的马赛克图像，提供扩展且连续的视觉上下文。此系统在开放空间内解决MIS关键限制的能力，在羊模型中进行了体内验证。', 'title_zh': '在开放腔隙中推进微创精准手术的柔性内窥镜机器人技术'}
{'arxiv_id': 'arXiv:2511.14434', 'title': 'Achieving Safe Control Online through Integration of Harmonic Control Lyapunov-Barrier Functions with Unsafe Object-Centric Action Policies', 'authors': 'Marlow Fawn, Matthias Scheutz', 'link': 'https://arxiv.org/abs/2511.14434', 'abstract': 'We propose a method for combining Harmonic Control Lyapunov-Barrier Functions (HCLBFs) derived from Signal Temporal Logic (STL) specifications with any given robot policy to turn an unsafe policy into a safe one with formal guarantees.  The two components are combined via HCLBF-derived safety certificates, thus producing commands that preserve both safety and task-driven behavior.  We demonstrate with a simple proof-of-concept implementation for an object-centric force-based policy trained through reinforcement learning for a movement task of a stationary robot arm that is able to avoid colliding with obstacles on a table top after combining the policy with the safety constraints.  The proposed method can be generalized to more complex specifications and dynamic task settings.', 'abstract_zh': '我们提出了一种将信号时逻辑(STL)规范导出的谐波控制拉普拉斯障碍函数(HCLBF)与任何给定的机器人策略结合的方法，以将一个不安全的策略转换为一个在形式上有保证的安全策略。通过HCLBF导出的安全证书将两者结合，从而产生同时保持安全性和任务驱动行为的命令。我们通过一个简单的概念性实现展示了结合安全约束后，一个用于避免桌上障碍物的固定机器人手臂基于力的对象中心策略训练后的安全策略验证。该方法可以推广到更复杂的要求和动态任务设置。', 'title_zh': '通过结合谐波控制李雅普诺夫-障碍函数与不安全对象中心动作政策实现在线安全控制'}
{'arxiv_id': 'arXiv:2511.14432', 'title': 'Mutation Testing for Industrial Robotic Systems', 'authors': 'Marcela Gonçalves dos Santos, Sylvain Hallé, Fábio Petrillo', 'link': 'https://arxiv.org/abs/2511.14432', 'abstract': 'Industrial robotic systems (IRS) are increasingly deployed in diverse environments, where failures can result in severe accidents and costly downtime. Ensuring the reliability of the software controlling these systems is therefore critical. Mutation testing, a technique widely used in software engineering, evaluates the effectiveness of test suites by introducing small faults, or mutants, into the code. However, traditional mutation operators are poorly suited to robotic programs, which involve message-based commands and interactions with the physical world. This paper explores the adaptation of mutation testing to IRS by defining domain-specific mutation operators that capture the semantics of robot actions and sensor readings. We propose a methodology for generating meaningful mutants at the level of high-level read and write operations, including movement, gripper actions, and sensor noise injection. An empirical study on a pick-and-place scenario demonstrates that our approach produces more informative mutants and reduces the number of invalid or equivalent cases compared to conventional operators. Results highlight the potential of mutation testing to enhance test suite quality and contribute to safer, more reliable industrial robotic systems.', 'abstract_zh': '工业机器人系统（IRS）的变异测试适应研究：面向高级读写操作的领域特定变异操作及其应用', 'title_zh': '工业机器人系统的突变测试'}
{'arxiv_id': 'arXiv:2511.14393', 'title': 'Perception-aware Exploration for Consumer-grade UAVs', 'authors': 'Svetlana Seliunina, Daniel Schleich, Sven Behnke', 'link': 'https://arxiv.org/abs/2511.14393', 'abstract': 'In our work, we extend the current state-of-the-art approach for autonomous multi-UAV exploration to consumer-level UAVs, such as the DJI Mini 3 Pro. We propose a pipeline that selects viewpoint pairs from which the depth can be estimated and plans the trajectory that satisfies motion constraints necessary for odometry estimation. For the multi-UAV exploration, we propose a semi-distributed communication scheme that distributes the workload in a balanced manner. We evaluate our model performance in simulation for different numbers of UAVs and prove its ability to safely explore the environment and reconstruct the map even with the hardware limitations of consumer-grade UAVs.', 'abstract_zh': '我们将当前最先进的自主多无人机探索方法扩展到消费级无人机，如大疆Mini 3 Pro。我们提出了一种管道方法，从其中选择视角对深度进行估计，并规划满足用于里程计估计的运动约束的轨迹。对于多无人机探索，我们提出了一种半分布式通信方案，以均衡分配工作量。我们在不同数量的无人机下在仿真中评估了我们模型的性能，并证明了即使在消费级无人机硬件限制下，该方法也能安全地探索环境并重建地图。', 'title_zh': '感知驱动的消费级无人机探索'}
{'arxiv_id': 'arXiv:2511.14327', 'title': 'Dual-Variable Force Characterisation method for Human-Robot Interaction in Wearable Robotics', 'authors': 'Felipe Ballen-Moreno, Pasquale Ferrentino, Milan Amighi, Bram Vanderborght, Tom Verstraten', 'link': 'https://arxiv.org/abs/2511.14327', 'abstract': 'Understanding the physical interaction with wearable robots is essential to ensure safety and comfort. However, this interaction is complex in two key aspects: (1) the motion involved, and (2) the non-linear behaviour of soft tissues. Multiple approaches have been undertaken to better understand this interaction and to improve the quantitative metrics of physical interfaces or cuffs. As these two topics are closely interrelated, finite modelling and soft tissue characterisation offer valuable insights into pressure distribution and shear stress induced by the cuff. Nevertheless, current characterisation methods typically rely on a single fitting variable along one degree of freedom, which limits their applicability, given that interactions with wearable robots often involve multiple degrees of freedom. To address this limitation, this work introduces a dual-variable characterisation method, involving normal and tangential forces, aimed at identifying reliable material parameters and evaluating the impact of single-variable fitting on force and torque responses. This method demonstrates the importance of incorporating two variables into the characterisation process by analysing the normalized mean square error (NMSE) across different scenarios and material models, providing a foundation for simulation at the closest possible level, with a focus on the cuff and the human limb involved in the physical interaction between the user and the wearable robot.', 'abstract_zh': '理解可穿戴机器人的人体物理交互对于确保安全与舒适至关重要。然而，这种交互在两个关键方面具有复杂性：（1）运动方式，（2）软组织的非线性行为。为更好地理解这种交互并改进物理界面或袖套的定量指标，已采取了多种方法。鉴于这两个主题紧密相关，有限元建模和软组织特性分析提供了有关袖套引起的压力分布和剪切应力的重要见解。然而，当前的特性化方法通常依赖于一个单一的拟合变量在一个自由度上，这限制了它们的应用范围，因为与可穿戴机器人的人体交互通常涉及多个自由度。为解决这一限制，本研究引入了一种双变量特性化方法，涉及法向力和切向力，旨在确定可靠的材料参数并评估单一变量拟合对力和扭矩响应的影响。通过分析不同场景和材料模型下的归一化均方误差（NMSE），该方法强调了在特性化过程中纳入两个变量的重要性，从而为最接近实际的模拟奠定了基础，重点关注参与人体与可穿戴机器人物理交互的袖套和人体肢体。', 'title_zh': '穿戴机器人中人类-机器人交互的双变量力特性化方法'}
{'arxiv_id': 'arXiv:2511.14037', 'title': 'BIM-Discrepancy-Driven Active Sensing for Risk-Aware UAV-UGV Navigation', 'authors': 'Hesam Mojtahedi, Reza Akhavian', 'link': 'https://arxiv.org/abs/2511.14037', 'abstract': 'This paper presents a BIM-discrepancy-driven active sensing framework for cooperative navigation between unmanned aerial vehicles (UAVs) and unmanned ground vehicles (UGVs) in dynamic construction environments. Traditional navigation approaches rely on static Building Information Modeling (BIM) priors or limited onboard perception. In contrast, our framework continuously fuses real-time LiDAR data from aerial and ground robots with BIM priors to maintain an evolving 2D occupancy map. We quantify navigation safety through a unified corridor-risk metric integrating occupancy uncertainty, BIM-map discrepancy, and clearance. When risk exceeds safety thresholds, the UAV autonomously re-scans affected regions to reduce uncertainty and enable safe replanning. Validation in PX4-Gazebo simulation with Robotec GPU LiDAR demonstrates that risk-triggered re-scanning reduces mean corridor risk by 58% and map entropy by 43% compared to static BIM navigation, while maintaining clearance margins above 0.4 m. Compared to frontier-based exploration, our approach achieves similar uncertainty reduction in half the mission time. These results demonstrate that integrating BIM priors with risk-adaptive aerial sensing enables scalable, uncertainty-aware autonomy for construction robotics.', 'abstract_zh': '基于BIM差异驱动的主动传感框架：在动态施工环境中的无人机与地面机器人协同导航', 'title_zh': '基于BIM差异的主动传感以实现风险意识的无人机-地面机器人导航'}
{'arxiv_id': 'arXiv:2511.13985', 'title': 'LIO-MARS: Non-uniform Continuous-time Trajectories for Real-time LiDAR-Inertial-Odometry', 'authors': 'Jan Quenzel, Sven Behnke', 'link': 'https://arxiv.org/abs/2511.13985', 'abstract': 'Autonomous robotic systems heavily rely on environment knowledge to safely navigate. For search & rescue, a flying robot requires robust real-time perception, enabled by complementary sensors. IMU data constrains acceleration and rotation, whereas LiDAR measures accurate distances around the robot. Building upon the LiDAR odometry MARS, our LiDAR-inertial odometry (LIO) jointly aligns multi-resolution surfel maps with a Gaussian mixture model (GMM) using a continuous-time B-spline trajectory. Our new scan window uses non-uniform temporal knot placement to ensure continuity over the whole trajectory without additional scan delay. Moreover, we accelerate essential covariance and GMM computations with Kronecker sums and products by a factor of 3.3. An unscented transform de-skews surfels, while a splitting into intra-scan segments facilitates motion compensation during spline optimization. Complementary soft constraints on relative poses and preintegrated IMU pseudo-measurements further improve robustness and accuracy. Extensive evaluation showcases the state-of-the-art quality of our LIO-MARS w.r.t. recent LIO systems on various handheld, ground and aerial vehicle-based datasets.', 'abstract_zh': '自主机器人系统强烈依赖环境知识以实现安全导航。在搜索与救援任务中，飞行机器人需要 robust 的实时感知能力，这得益于互补传感器的应用。IMU 数据限制加速度和旋转，而 LiDAR 测量机器人周围精确的距离。基于 LiDAR 里程计 MARS，我们提出的 LiDAR-惯性里程计 (LIO) 使用高斯混合模型 (GMM) 和连续时间 B-样条轨迹联合对多分辨率 surfel 地图进行对齐。我们的新扫描窗口通过非均匀时间结点放置来确保轨迹全程连续性，而无需额外的扫描延迟。此外，我们通过克罗内cker和积加速关键的协方差和 GMM 计算，加速比达到 3.3。使用无迹变换 (unscented transform) 使 surfel 偏斜，而将扫描区间分割成子段有助于在样条优化过程中进行运动补偿。相对姿态的互补软约束和预整合 IMU 模态进一步提高鲁棒性和准确性。广泛的评估展示了我们的 LIO-MARS 在多种手持、地面和空中机器人数据集上的先进质量，与最近的 LIO 系统相比。', 'title_zh': 'LIO-MARS：非均匀连续时间轨迹的LiDAR-惯性-.odometry-real-time'}
{'arxiv_id': 'arXiv:2511.14438', 'title': 'Towards A Catalogue of Requirement Patterns for Space Robotic Missions', 'authors': 'Mahdi Etumi, Hazel M. Taylor, Marie Farrell', 'link': 'https://arxiv.org/abs/2511.14438', 'abstract': "In the development of safety and mission-critical systems, including autonomous space robotic missions, complex behaviour is captured during the requirements elicitation phase. Requirements are typically expressed using natural language which is ambiguous and not amenable to formal verification methods that can provide robust guarantees of system behaviour. To support the definition of formal requirements, specification patterns provide reusable, logic-based templates. A suite of robotic specification patterns, along with their formalisation in NASA's Formal Requirements Elicitation Tool (FRET) already exists. These pre-existing requirement patterns are domain agnostic and, in this paper we explore their applicability for space missions. To achieve this we carried out a literature review of existing space missions and formalised their requirements using FRET, contributing a corpus of space mission requirements. We categorised these requirements using pre-existing specification patterns which demonstrated their applicability in space missions. However, not all of the requirements that we formalised corresponded to an existing pattern so we have contributed 5 new requirement specification patterns as well as several variants of the existing and new patterns. We also conducted an expert evaluation of the new patterns, highlighting their benefits and limitations.", 'abstract_zh': '在安全和关键任务系统的开发中，包括自主太空机器人任务在内，复杂行为在需求获取阶段被捕捉。需求通常用自然语言表达，这种表达方式具有模糊性，不适合进行提供系统行为稳健保证的形式化验证方法。为了支持形式化需求的定义，规格模式提供了可重用的基于逻辑的模板。NASA的形式化需求获取工具（FRET）中已经存在一套机器人规格模式及其形式化表示。这些预先存在的需求模式是领域无关的，本文探讨了它们在太空任务中的适用性。为此，我们进行了现有太空任务的文献综述，并使用FRET对其需求进行了形式化，贡献了一套太空任务需求语料库。我们使用预先存在的规格模式对这些需求进行了分类，证明了它们在太空任务中的适用性。然而，并不是我们形式化的所有需求都对应现有的模式，因此我们贡献了5种新的需求规格模式及其现有和新模式的各种变体。我们还对新模式进行了专家评估，指出了它们的优势和局限性。', 'title_zh': '面向空间机器人任务的需求模式catalogue研究'}
{'arxiv_id': 'arXiv:2511.14433', 'title': 'Safe-ROS: An Architecture for Autonomous Robots in Safety-Critical Domains', 'authors': 'Diana C. Benjumea, Marie Farrell, Louise A. Dennis', 'link': 'https://arxiv.org/abs/2511.14433', 'abstract': 'Deploying autonomous robots in safety-critical domains requires architectures that ensure operational effectiveness and safety compliance. In this paper, we contribute the Safe-ROS architecture for developing reliable and verifiable autonomous robots in such domains. It features two distinct subsystems: (1) an intelligent control system that is responsible for normal/routine operations, and (2) a Safety System consisting of Safety Instrumented Functions (SIFs) that provide formally verifiable independent oversight. We demonstrate Safe-ROS on an AgileX Scout Mini robot performing autonomous inspection in a nuclear environment. One safety requirement is selected and instantiated as a SIF. To support verification, we implement the SIF as a cognitive agent, programmed to stop the robot whenever it detects that it is too close to an obstacle. We verify that the agent meets the safety requirement and integrate it into the autonomous inspection. This integration is also verified, and the full deployment is validated in a Gazebo simulation, and lab testing. We evaluate this architecture in the context of the UK nuclear sector, where safety and regulation are crucial aspects of deployment. Success criteria include the development of a formal property from the safety requirement, implementation, and verification of the SIF, and the integration of the SIF into the operational robotic autonomous system. Our results demonstrate that the  Safe-ROS architecture can provide safety verifiable oversight while deploying autonomous robots in safety-critical domains, offering a robust framework that can be extended to additional requirements and various applications.', 'abstract_zh': '在安全关键领域部署自主机器人需要确保运行有效性与安全合规的架构。本文贡献了Safe-ROS架构，用于此类领域开发可靠可验证的自主机器人。该架构包含两个独立子系统：（1）智能控制系统，负责正常/常规操作；（2）安全系统，包括安全仪表功能（SIFs），提供形式可验证的独立监督。我们以AgileX Scout Mini机器人在核环境中进行自主检测为例，选取一个安全需求并实例化为一个SIF。为支持验证，我们将SIF实现为认知代理，编程在检测到机器人与障碍物距离过近时停止机器人。验证代理满足安全需求并在自主检测中集成。此集成亦进行了验证，并在Gazebo仿真和实验室测试中对完整部署进行了验证。我们在英国核产业背景下评估了该架构，安全与监管是部署中的关键因素。成功标准包括从安全需求开发形式属性、实现并验证SIF以及将SIF集成到运营自主机器人系统中。我们的结果证明，Safe-ROS架构可以在安全关键领域部署自主机器人时提供可验证的安全监督，提供一个可以扩展到更多要求和各种应用的稳健框架。', 'title_zh': 'Safe-ROS：安全关键领域自主机器人的一种架构'}
{'arxiv_id': 'arXiv:2511.14311', 'title': 'Multi-Timescale Model Predictive Control for Slow-Fast Systems', 'authors': 'Lukas Schroth, Daniel Morton, Amon Lahr, Daniele Gammelli, Andrea Carron, Marco Pavone', 'link': 'https://arxiv.org/abs/2511.14311', 'abstract': 'Model Predictive Control (MPC) has established itself as the primary methodology for constrained control, enabling autonomy across diverse applications. While model fidelity is crucial in MPC, solving the corresponding optimization problem in real time remains challenging when combining long horizons with high-fidelity models that capture both short-term dynamics and long-term behavior. Motivated by results on the Exponential Decay of Sensitivities (EDS), which imply that, under certain conditions, the influence of modeling inaccuracies decreases exponentially along the prediction horizon, this paper proposes a multi-timescale MPC scheme for fast-sampled control. Tailored to systems with both fast and slow dynamics, the proposed approach improves computational efficiency by i) switching to a reduced model that captures only the slow, dominant dynamics and ii) exponentially increasing integration step sizes to progressively reduce model detail along the horizon. We evaluate the method on three practically motivated robotic control problems in simulation and observe speed-ups of up to an order of magnitude.', 'abstract_zh': '基于指数衰减敏感性的多时间尺度模型预测控制方法', 'title_zh': '多时间尺度模型预测控制方法及其应用于慢快系统'}
