{'arxiv_id': 'arXiv:2508.09971', 'title': 'Vision-driven River Following of UAV via Safe Reinforcement Learning using Semantic Dynamics Model', 'authors': 'Zihan Wang, Nina Mahmoudian', 'link': 'https://arxiv.org/abs/2508.09971', 'abstract': "Vision-driven autonomous river following by Unmanned Aerial Vehicles is critical for applications such as rescue, surveillance, and environmental monitoring, particularly in dense riverine environments where GPS signals are unreliable. We formalize river following as a coverage control problem in which the reward function is submodular, yielding diminishing returns as more unique river segments are visited, thereby framing the task as a Submodular Markov Decision Process. First, we introduce Marginal Gain Advantage Estimation, which refines the reward advantage function by using a sliding window baseline computed from historical episodic returns, thus aligning the advantage estimation with the agent's evolving recognition of action value in non-Markovian settings. Second, we develop a Semantic Dynamics Model based on patchified water semantic masks that provides more interpretable and data-efficient short-term prediction of future observations compared to latent vision dynamics models. Third, we present the Constrained Actor Dynamics Estimator architecture, which integrates the actor, the cost estimator, and SDM for cost advantage estimation to form a model-based SafeRL framework capable of solving partially observable Constrained Submodular Markov Decision Processes. Simulation results demonstrate that MGAE achieves faster convergence and superior performance over traditional critic-based methods like Generalized Advantage Estimation. SDM provides more accurate short-term state predictions that enable the cost estimator to better predict potential violations. Overall, CADE effectively integrates safety regulation into model-based RL, with the Lagrangian approach achieving the soft balance of reward and safety during training, while the safety layer enhances performance during inference by hard action overlay.", 'abstract_zh': '基于视觉的自主河流跟踪对于救援、监控和环境监测等应用至关重要，特别是在GPS信号不可靠的密集河流环境中。我们将河流跟踪形式化为一个覆盖控制问题，其中回报函数为亚模函数，随着时间的推移访问更多独特的河流段落而回报递减，从而将任务框架化为亚模马克ʾ夫决策过程。首先，我们引入了边缘增益优势估计方法，通过使用从历史 episodic 回报中计算的滑动窗口基准来细化优势回报函数，从而在非马克_overflow: 龙\\-维设置中将优势估计与代理行动价值的演变认识相一致。其次，我们基于斑块化的水语义掩码开发了一种语义动力学模型，相比潜在视觉动力学模型，它能提供更具有解释性和数据效率的未来观测短期预测。第三，我们提出了约束动作动力学估计器架构，该架构结合了动作、成本估计器和语义动力学模型进行成本优势估计，形成了一种基于模型的SafeRL框架，能够解决部分可观测的约束亚模马克\\-维决策过程。仿真结果表明，MGAE 在收敛速度和性能上优于传统的基于评论的方法如广义优势估计算法。语义动力学模型提供了更准确的短期状态预测，使成本估计器能够更好地预测潜在的违规行为。总体而言，CADE 有效将安全性约束整合到基于模型的强化学习中，通过拉格朗日方法在训练过程中实现奖励和安全性的软平衡，而安全层则在推理过程中通过硬动作叠加增强性能。', 'title_zh': '基于视觉的无人机河流跟踪通过语义动力学模型的稳健强化学习'}
{'arxiv_id': 'arXiv:2508.09876', 'title': 'A Shank Angle-Based Control System Enables Soft Exoskeleton to Assist Human Non-Steady Locomotion', 'authors': 'Xiaowei Tan, Weizhong Jiang, Bi Zhang, Wanxin Chen, Yiwen Zhao, Ning Li, Lianqing Liu, Xingang Zhao', 'link': 'https://arxiv.org/abs/2508.09876', 'abstract': "Exoskeletons have been shown to effectively assist humans during steady locomotion. However, their effects on non-steady locomotion, characterized by nonlinear phase progression within a gait cycle, remain insufficiently explored, particularly across diverse activities. This work presents a shank angle-based control system that enables the exoskeleton to maintain real-time coordination with human gait, even under phase perturbations, while dynamically shaping assistance profiles to match the biological ankle moment patterns across walking, running, stair negotiation tasks. The control system consists of an assistance profile online generation method and a model-based feedforward control method. The assistance profile is formulated as a dual-Gaussian model with the shank angle as the independent variable. Leveraging only IMU measurements, the model parameters are updated online each stride to adapt to inter- and intra-individual biomechanical variability. The profile tracking control employs a human-exoskeleton kinematics and stiffness model as a feedforward component, reducing reliance on historical control data due to the lack of clear and consistent periodicity in non-steady locomotion. Three experiments were conducted using a lightweight soft exoskeleton with multiple subjects. The results validated the effectiveness of each individual method, demonstrated the robustness of the control system against gait perturbations across various activities, and revealed positive biomechanical and physiological responses of human users to the exoskeleton's mechanical assistance.", 'abstract_zh': '基于小腿角的外骨骼控制系统：应对非稳态步行的实时协调与辅助塑造', 'title_zh': '基于足尖角的控制系统使软外骨骼能够辅助人类非稳态运动'}
{'arxiv_id': 'arXiv:2508.09595', 'title': 'HapticGiant: A Novel Very Large Kinesthetic Haptic Interface with Hierarchical Force Control', 'authors': 'Michael Fennel, Markus Walker, Dominik Pikos, Uwe D. Hanebeck', 'link': 'https://arxiv.org/abs/2508.09595', 'abstract': 'Research in virtual reality and haptic technologies has consistently aimed to enhance immersion. While advanced head-mounted displays are now commercially available, kinesthetic haptic interfaces still face challenges such as limited workspaces, insufficient degrees of freedom, and kinematics not matching the human arm. In this paper, we present HapticGiant, a novel large-scale kinesthetic haptic interface designed to match the properties of the human arm as closely as possible and to facilitate natural user locomotion while providing full haptic feedback. The interface incorporates a novel admittance-type force control scheme, leveraging hierarchical optimization to render both arbitrary serial kinematic chains and Cartesian admittances. Notably, the proposed control scheme natively accounts for system limitations, including joint and Cartesian constraints, as well as singularities. Experimental results demonstrate the effectiveness of HapticGiant and its control scheme, paving the way for highly immersive virtual reality applications.', 'abstract_zh': '基于虚拟现实和触觉技术的研究一直致力于增强沉浸感。虽然先进的头戴式显示设备已经商业化，但动觉触觉接口仍面临工作空间有限、自由度不足以及运动学与人类手臂不匹配等挑战。在本文中，我们提出了一种名为HapticGiant的新颖大规模动觉触觉接口，旨在尽可能地匹配人类手臂的特性，并促进自然用户移动，同时提供完整的触觉反馈。该接口采用了一种新颖的阻抗型力控制方案，利用分层优化来呈现任意串联系动链和笛卡尔阻抗。值得注意的是，所提出的控制方案自然地考虑了系统的局限性，包括关节和笛卡尔约束以及奇异性。实验结果表明HapticGiant及其控制方案的有效性，为高度沉浸的虚拟现实应用铺平了道路。', 'title_zh': 'HapticGiant：一种具有分层力控制的新型大型触觉力反馈接口'}
{'arxiv_id': 'arXiv:2508.09581', 'title': 'ESCoT: An Enhanced Step-based Coordinate Trajectory Planning Method for Multiple Car-like Robots', 'authors': 'Junkai Jiang, Yihe Chen, Yibin Yang, Ruochen Li, Shaobing Xu, Jianqiang Wang', 'link': 'https://arxiv.org/abs/2508.09581', 'abstract': "Multi-vehicle trajectory planning (MVTP) is one of the key challenges in multi-robot systems (MRSs) and has broad applications across various fields. This paper presents ESCoT, an enhanced step-based coordinate trajectory planning method for multiple car-like robots. ESCoT incorporates two key strategies: collaborative planning for local robot groups and replanning for duplicate configurations. These strategies effectively enhance the performance of step-based MVTP methods. Through extensive experiments, we show that ESCoT 1) in sparse scenarios, significantly improves solution quality compared to baseline step-based method, achieving up to 70% improvement in typical conflict scenarios and 34% in randomly generated scenarios, while maintaining high solving efficiency; and 2) in dense scenarios, outperforms all baseline methods, maintains a success rate of over 50% even in the most challenging configurations. The results demonstrate that ESCoT effectively solves MVTP, further extending the capabilities of step-based methods. Finally, practical robot tests validate the algorithm's applicability in real-world scenarios.", 'abstract_zh': '多车辆轨迹规划（MVTP）是多机器人系统（MRSs）中的一个关键挑战，具有广泛的应用前景。本文提出了一种增强的基于步长的坐标轨迹规划方法ESCoT，用于多个类似车辆的机器人。ESCoT结合了两种关键技术策略：局部机器人组的协作规划和重复配置的重规划。这些策略有效提高了基于步长的多车辆轨迹规划方法的性能。通过广泛的实验，我们展示了ESCoT在稀疏场景中显著提高了解的质量，与基线基于步长的方法相比，在典型冲突场景中提高了70%，在随机生成的场景中提高了34%，同时保持了高解算效率；在密集场景中，ESCoT超过了所有基线方法，在最具挑战性的配置中仍能保持超过50%的成功率。结果表明，ESCoT有效地解决了MVTP问题，进一步扩展了基于步长的方法的能力。最后，实际的机器人测试验证了该算法在现实场景中的适用性。', 'title_zh': 'ESCoT: 一种增强型基于步进的坐标轨迹规划方法用于多个类汽车机器人'}
{'arxiv_id': 'arXiv:2508.09558', 'title': 'CaRoBio: 3D Cable Routing with a Bio-inspired Gripper Fingernail', 'authors': 'Jiahui Zuo, Boyang Zhang, Fumin Zhang', 'link': 'https://arxiv.org/abs/2508.09558', 'abstract': 'The manipulation of deformable linear flexures has a wide range of applications in industry, such as cable routing in automotive manufacturing and textile production. Cable routing, as a complex multi-stage robot manipulation scenario, is a challenging task for robot automation. Common parallel two-finger grippers have the risk of over-squeezing and over-tension when grasping and guiding cables. In this paper, a novel eagle-inspired fingernail is designed and mounted on the gripper fingers, which helps with cable grasping on planar surfaces and in-hand cable guiding operations. Then we present a single-grasp end-to-end 3D cable routing framework utilizing the proposed fingernails, instead of the common pick-and-place strategy. Continuous control is achieved to efficiently manipulate cables through vision-based state estimation of task configurations and offline trajectory planning based on motion primitives. We evaluate the effectiveness of the proposed framework with a variety of cables and channel slots, significantly outperforming the pick-and-place manipulation process under equivalent perceptual conditions. Our reconfigurable task setting and the proposed framework provide a reference for future cable routing manipulations in 3D space.', 'abstract_zh': '基于鹰爪启发的新型指节在单握持连续3D电缆布线框架中的应用', 'title_zh': 'CaRoBio: 基于生物启发式夹具指甲的3D电缆布线'}
{'arxiv_id': 'arXiv:2508.09508', 'title': 'SMART-OC: A Real-time Time-risk Optimal Replanning Algorithm for Dynamic Obstacles and Spatio-temporally Varying Currents', 'authors': 'Reema Raval, Shalabh Gupta', 'link': 'https://arxiv.org/abs/2508.09508', 'abstract': 'Typical marine environments are highly complex with spatio-temporally varying currents and dynamic obstacles, presenting significant challenges to Unmanned Surface Vehicles (USVs) for safe and efficient navigation. Thus, the USVs need to continuously adapt their paths with real-time information to avoid collisions and follow the path of least resistance to the goal via exploiting ocean currents. In this regard, we introduce a novel algorithm, called Self-Morphing Adaptive Replanning Tree for dynamic Obstacles and Currents (SMART-OC), that facilitates real-time time-risk optimal replanning in dynamic environments. SMART-OC integrates the obstacle risks along a path with the time cost to reach the goal to find the time-risk optimal path. The effectiveness of SMART-OC is validated by simulation experiments, which demonstrate that the USV performs fast replannings to avoid dynamic obstacles and exploit ocean currents to successfully reach the goal.', 'abstract_zh': '自适应形态变化重规划树以应对动态障碍和洋流（SMART-OC）：复杂海洋环境下的实时时间风险优化重规划算法', 'title_zh': 'SMART-OC：动态障碍物和时空变化流场下的实时时间风险最优重规划算法'}
{'arxiv_id': 'arXiv:2508.09502', 'title': 'Reactive Model Predictive Contouring Control for Robot Manipulators', 'authors': 'Junheon Yoon, Woo-Jeong Baek, Jaeheung Park', 'link': 'https://arxiv.org/abs/2508.09502', 'abstract': 'This contribution presents a robot path-following framework via Reactive Model Predictive Contouring Control (RMPCC) that successfully avoids obstacles, singularities and self-collisions in dynamic environments at 100 Hz. Many path-following methods rely on the time parametrization, but struggle to handle collision and singularity avoidance while adhering kinematic limits or other constraints. Specifically, the error between the desired path and the actual position can become large when executing evasive maneuvers. Thus, this paper derives a method that parametrizes the reference path by a path parameter and performs the optimization via RMPCC. In particular, Control Barrier Functions (CBFs) are introduced to avoid collisions and singularities in dynamic environments. A Jacobian-based linearization and Gauss-Newton Hessian approximation enable solving the nonlinear RMPCC problem at 100 Hz, outperforming state-of-the-art methods by a factor of 10. Experiments confirm that the framework handles dynamic obstacles in real-world settings with low contouring error and low robot acceleration.', 'abstract_zh': '基于反应模型预测轮廓控制（RMPCC）的机器人路径跟随框架：在动态环境中的高频率避障与避奇异性', 'title_zh': '基于反应模型预测轮廓控制的机器人 manipulator 控制方法'}
{'arxiv_id': 'arXiv:2508.09304', 'title': 'Decision-Making-Based Path Planning for Autonomous UAVs: A Survey', 'authors': 'Kelen C. Teixeira Vivaldini, Robert Pěnička, Martin Saska', 'link': 'https://arxiv.org/abs/2508.09304', 'abstract': 'One of the most critical features for the successful operation of autonomous UAVs is the ability to make decisions based on the information acquired from their surroundings. Each UAV must be able to make decisions during the flight in order to deal with uncertainties in its system and the environment, and to further act upon the information being received. Such decisions influence the future behavior of the UAV, which is expressed as the path plan. Thus, decision-making in path planning is an enabling technique for deploying autonomous UAVs in real-world applications. This survey provides an overview of existing studies that use aspects of decision-making in path planning, presenting the research strands for Exploration Path Planning and Informative Path Planning, and focusing on characteristics of how data have been modeled and understood. Finally, we highlight the existing challenges for relevant topics in this field.', 'abstract_zh': '自主自主无人机成功运行的关键特征之一是基于从周围环境获取的信息作出决策的能力。在飞行过程中，每个无人机都必须能够根据其系统和环境中的不确定性进行决策，并进一步处理接收到的信息。这些决策影响无人机未来的行为，即路径规划。因此，路径规划中的决策制定是部署自主无人机在实际应用中的一项使能技术。本文综述了现有利用路径规划中决策制定方面进行研究的工作，概述了探索路径规划和信息性路径规划的研究方向，并集中探讨了数据建模与理解的特点。最后，本文指出了该领域相关主题所面临的现有挑战。', 'title_zh': '基于决策的自主无人机路径规划：一个综述'}
{'arxiv_id': 'arXiv:2508.09908', 'title': 'Collision-Free Bearing-Driven Formation Tracking for Euler-Lagrange Systems', 'authors': 'Haoshu Cheng, Martin Guay, Shimin Wang, Yunhong Che', 'link': 'https://arxiv.org/abs/2508.09908', 'abstract': "In this paper, we investigate the problem of tracking formations driven by bearings for heterogeneous Euler-Lagrange systems with parametric uncertainty in the presence of multiple moving leaders. To estimate the leaders' velocities and accelerations, we first design a distributed observer for the leader system, utilizing a bearing-based localization condition in place of the conventional connectivity assumption. This observer, coupled with an adaptive mechanism, enables the synthesis of a novel distributed control law that guides the formation towards the target formation, without requiring prior knowledge of the system parameters. Furthermore, we establish a sufficient condition, dependent on the initial formation configuration, that ensures collision avoidance throughout the formation evolution. The effectiveness of the proposed approach is demonstrated through a numerical example.", 'abstract_zh': '本文研究了具有参数不确定性且存在多个移动领航者情况下异构Euler-Lagrange系统基于轴承的形成跟踪问题。为估计领航者的速度和加速度，我们首先设计了一个分布式观测器，利用基于轴承的定位条件替代传统的连通性假设。该观测器与自适应机制相结合，使我们能够合成一种新的分布式控制律来引导形成趋向目标形成，而不需先验系统参数知识。此外，我们建立了依赖于初始形成配置的充分条件，确保在整个形成演化过程中避免碰撞。所提出方法的有效性通过数值例子得到了验证。', 'title_zh': '欧拉-拉格朗日系统无碰撞方位驱动构形跟踪'}
{'arxiv_id': 'arXiv:2504.19716', 'title': 'QuickGrasp: Lightweight Antipodal Grasp Planning with Point Clouds', 'authors': 'Navin Sriram Ravie, Keerthi Vasan M, Asokan Thondiyath, Bijo Sebastian', 'link': 'https://arxiv.org/abs/2504.19716', 'abstract': 'Grasping has been a long-standing challenge in facilitating the final interface between a robot and the environment. As environments and tasks become complicated, the need to embed higher intelligence to infer from the surroundings and act on them has become necessary. Although most methods utilize techniques to estimate grasp pose by treating the problem via pure sampling-based approaches in the six-degree-of-freedom space or as a learning problem, they usually fail in real-life settings owing to poor generalization across domains. In addition, the time taken to generate the grasp plan and the lack of repeatability, owing to sampling inefficiency and the probabilistic nature of existing grasp planning approaches, severely limits their application in real-world tasks. This paper presents a lightweight analytical approach towards robotic grasp planning, particularly antipodal grasps, with little to no sampling in the six-degree-of-freedom space. The proposed grasp planning algorithm is formulated as an optimization problem towards estimating grasp points on the object surface instead of directly estimating the end-effector pose. To this extent, a soft-region-growing algorithm is presented for effective plane segmentation, even in the case of curved surfaces. An optimization-based quality metric is then used for the evaluation of grasp points to ensure indirect force closure. The proposed grasp framework is compared with the existing state-of-the-art grasp planning approach, Grasp pose detection (GPD), as a baseline over multiple simulated objects. The effectiveness of the proposed approach in comparison to GPD is also evaluated in a real-world setting using image and point-cloud data, with the planned grasps being executed using a ROBOTIQ gripper and UR5 manipulator.', 'abstract_zh': '基于轻量级分析方法的六自由度空间少采样机器人抓取规划', 'title_zh': 'QuickGrasp: 基于点云的轻量级反抓取规划'}
